var regions =
  {
    "全国": {
      "id": 0,
      "children": {
        "全部": {
          "id": 0,
          "children": [{
            "id": 0,
            "name": "全部"
          }]
        }
      }
    },
    "辽宁省": {
      "id": 1,
      "children": {
        "全部": {
          "id": 1,
          "children": [{
            "id": 1,
            "name": "全部"
          }]
        },
        "鞍山": {
          "id": 2,
          "children": [{
            "id": 2,
            "name": "全部"
          },
          {
            "id": 3,
            "name": "铁西区"
          },
          {
            "id": 4,
            "name": "立山区"
          },
          {
            "id": 5,
            "name": "铁东区"
          },
          {
            "id": 6,
            "name": "台安县"
          },
          {
            "id": 7,
            "name": "高新区"
          },
          {
            "id": 8,
            "name": "千山区"
          },
          {
            "id": 9,
            "name": "汤岗新城"
          },
          {
            "id": 10,
            "name": "岫岩满族自治县"
          },
          {
            "id": 15,
            "name": "达道湾新城"
          },
          {
            "id": 79,
            "name": "海城市"
          }]
        },
        "营口": {
          "id": 432,
          "children": [{
            "id": 432,
            "name": "全部"
          },
          {
            "id": 433,
            "name": "老边区"
          },
          {
            "id": 435,
            "name": "站前区"
          },
          {
            "id": 437,
            "name": "大石桥市"
          },
          {
            "id": 438,
            "name": "鲅鱼圈区"
          },
          {
            "id": 441,
            "name": "西市区"
          },
          {
            "id": 444,
            "name": "盖州市"
          }]
        },
        "铁岭": {
          "id": 875,
          "children": [{
            "id": 875,
            "name": "全部"
          },
          {
            "id": 876,
            "name": "清河区"
          },
          {
            "id": 877,
            "name": "调兵山市"
          },
          {
            "id": 878,
            "name": "开原市"
          },
          {
            "id": 879,
            "name": "铁岭县"
          },
          {
            "id": 885,
            "name": "银州区"
          },
          {
            "id": 888,
            "name": "西丰县"
          },
          {
            "id": 897,
            "name": "昌图县"
          }]
        },
        "沈阳": {
          "id": 1135,
          "children": [{
            "id": 1135,
            "name": "全部"
          },
          {
            "id": 1136,
            "name": "沈河区"
          },
          {
            "id": 1142,
            "name": "铁西区"
          },
          {
            "id": 1143,
            "name": "大东区"
          },
          {
            "id": 1144,
            "name": "和平区"
          },
          {
            "id": 1145,
            "name": "皇姑区"
          },
          {
            "id": 1150,
            "name": "苏家屯区"
          },
          {
            "id": 1152,
            "name": "沈北新区"
          },
          {
            "id": 1154,
            "name": "于洪区"
          },
          {
            "id": 1155,
            "name": "近郊"
          },
          {
            "id": 1156,
            "name": "新民市"
          },
          {
            "id": 1157,
            "name": "辽中县"
          },
          {
            "id": 1158,
            "name": "浑南区"
          },
          {
            "id": 1161,
            "name": "康平县"
          },
          {
            "id": 1167,
            "name": "法库县"
          }]
        },
        "辽阳": {
          "id": 1805,
          "children": [{
            "id": 1805,
            "name": "全部"
          },
          {
            "id": 1806,
            "name": "白塔区"
          },
          {
            "id": 1808,
            "name": "文圣区"
          },
          {
            "id": 1814,
            "name": "宏伟区"
          },
          {
            "id": 1818,
            "name": "弓长岭区"
          },
          {
            "id": 1822,
            "name": "太子河区"
          },
          {
            "id": 1827,
            "name": "辽阳县"
          },
          {
            "id": 1833,
            "name": "灯塔市"
          }]
        },
        "锦州": {
          "id": 2084,
          "children": [{
            "id": 2084,
            "name": "全部"
          },
          {
            "id": 2085,
            "name": "古塔区"
          },
          {
            "id": 2086,
            "name": "凌海市"
          },
          {
            "id": 2089,
            "name": "太和区"
          },
          {
            "id": 2090,
            "name": "凌河区"
          },
          {
            "id": 2091,
            "name": "北镇市"
          },
          {
            "id": 2092,
            "name": "义县"
          },
          {
            "id": 2093,
            "name": "经济开发区"
          },
          {
            "id": 2094,
            "name": "松山新区"
          },
          {
            "id": 2097,
            "name": "黑山县"
          }]
        },
        "葫芦岛": {
          "id": 2222,
          "children": [{
            "id": 2222,
            "name": "全部"
          },
          {
            "id": 2223,
            "name": "南票区"
          },
          {
            "id": 2228,
            "name": "连山区"
          },
          {
            "id": 2229,
            "name": "兴城市"
          },
          {
            "id": 2232,
            "name": "建昌县"
          },
          {
            "id": 2234,
            "name": "龙港区"
          },
          {
            "id": 2240,
            "name": "绥中县"
          }]
        },
        "阜新": {
          "id": 2553,
          "children": [{
            "id": 2553,
            "name": "全部"
          },
          {
            "id": 2554,
            "name": "太平区"
          },
          {
            "id": 2555,
            "name": "新邱区"
          },
          {
            "id": 2556,
            "name": "细河区"
          },
          {
            "id": 2557,
            "name": "清河门区"
          },
          {
            "id": 2558,
            "name": "海州区"
          },
          {
            "id": 2561,
            "name": "彰武县"
          },
          {
            "id": 2562,
            "name": "阜新县"
          }]
        },
        "抚顺": {
          "id": 2559,
          "children": [{
            "id": 2559,
            "name": "全部"
          },
          {
            "id": 2560,
            "name": "望花区"
          },
          {
            "id": 2563,
            "name": "顺城区"
          },
          {
            "id": 2565,
            "name": "东洲区"
          },
          {
            "id": 2566,
            "name": "新抚区"
          },
          {
            "id": 2567,
            "name": "抚顺县"
          },
          {
            "id": 2568,
            "name": "李石经济开发区"
          },
          {
            "id": 2575,
            "name": "高湾经济开发区"
          },
          {
            "id": 2576,
            "name": "新宾满族自治县"
          },
          {
            "id": 2577,
            "name": "清原满族自治县"
          }]
        },
        "丹东": {
          "id": 2692,
          "children": [{
            "id": 2692,
            "name": "全部"
          },
          {
            "id": 2693,
            "name": "元宝区"
          },
          {
            "id": 2701,
            "name": "振安区"
          },
          {
            "id": 2703,
            "name": "振兴区"
          },
          {
            "id": 2713,
            "name": "凤城市"
          },
          {
            "id": 2714,
            "name": "宽甸满族自治县"
          },
          {
            "id": 2716,
            "name": "东港市"
          }]
        },
        "大连": {
          "id": 2742,
          "children": [{
            "id": 2742,
            "name": "全部"
          },
          {
            "id": 2743,
            "name": "西岗区"
          },
          {
            "id": 2744,
            "name": "开发区"
          },
          {
            "id": 2745,
            "name": "中山区"
          },
          {
            "id": 2747,
            "name": "金州区"
          },
          {
            "id": 2749,
            "name": "旅顺口区"
          },
          {
            "id": 2750,
            "name": "近郊"
          },
          {
            "id": 2751,
            "name": "沙河口区"
          },
          {
            "id": 2752,
            "name": "甘井子区"
          },
          {
            "id": 2760,
            "name": "长海县"
          },
          {
            "id": 2761,
            "name": "普兰店市"
          },
          {
            "id": 2767,
            "name": "瓦房店市"
          },
          {
            "id": 2772,
            "name": "庄河市"
          },
          {
            "id": 2778,
            "name": "金石滩"
          }]
        },
        "本溪": {
          "id": 2986,
          "children": [{
            "id": 2986,
            "name": "全部"
          },
          {
            "id": 2987,
            "name": "溪湖区"
          },
          {
            "id": 2988,
            "name": "平山区"
          },
          {
            "id": 2993,
            "name": "南芬区"
          },
          {
            "id": 2997,
            "name": "本溪满族自治县"
          },
          {
            "id": 2998,
            "name": "桓仁满族自治县"
          },
          {
            "id": 2999,
            "name": "明山区"
          }]
        },
        "盘锦": {
          "id": 3137,
          "children": [{
            "id": 3137,
            "name": "全部"
          },
          {
            "id": 3138,
            "name": "双台子区"
          },
          {
            "id": 3139,
            "name": "大洼县"
          },
          {
            "id": 3140,
            "name": "兴隆台区"
          },
          {
            "id": 3141,
            "name": "盘山县"
          }]
        }
      }
    },
    "安徽省": {
      "id": 11,
      "children": {
        "全部": {
          "id": 11,
          "children": [{
            "id": 11,
            "name": "全部"
          }]
        },
        "蚌埠": {
          "id": 12,
          "children": [{
            "id": 12,
            "name": "全部"
          },
          {
            "id": 13,
            "name": "蚌山区"
          },
          {
            "id": 14,
            "name": "禹会区"
          },
          {
            "id": 16,
            "name": "龙子湖区"
          },
          {
            "id": 17,
            "name": "固镇县"
          },
          {
            "id": 18,
            "name": "淮上区"
          },
          {
            "id": 22,
            "name": "五河县"
          },
          {
            "id": 34,
            "name": "怀远县"
          }]
        },
        "亳州": {
          "id": 96,
          "children": [{
            "id": 96,
            "name": "全部"
          },
          {
            "id": 97,
            "name": "谯城区"
          },
          {
            "id": 111,
            "name": "涡阳县"
          },
          {
            "id": 112,
            "name": "蒙城县"
          },
          {
            "id": 116,
            "name": "利辛县"
          }]
        },
        "宣城": {
          "id": 657,
          "children": [{
            "id": 657,
            "name": "全部"
          },
          {
            "id": 658,
            "name": "宁国市"
          },
          {
            "id": 659,
            "name": "宣州区"
          },
          {
            "id": 660,
            "name": "郎溪县"
          },
          {
            "id": 661,
            "name": "泾县"
          },
          {
            "id": 662,
            "name": "广德县"
          },
          {
            "id": 664,
            "name": "绩溪县"
          },
          {
            "id": 665,
            "name": "旌德县"
          }]
        },
        "芜湖": {
          "id": 802,
          "children": [{
            "id": 802,
            "name": "全部"
          },
          {
            "id": 803,
            "name": "镜湖区"
          },
          {
            "id": 807,
            "name": "鸠江区"
          },
          {
            "id": 808,
            "name": "繁昌县"
          },
          {
            "id": 813,
            "name": "弋江区"
          },
          {
            "id": 814,
            "name": "芜湖县"
          },
          {
            "id": 815,
            "name": "三山区"
          },
          {
            "id": 821,
            "name": "无为县"
          },
          {
            "id": 824,
            "name": "南陵县"
          }]
        },
        "铜陵": {
          "id": 883,
          "children": [{
            "id": 883,
            "name": "全部"
          },
          {
            "id": 884,
            "name": "铜官区"
          },
          {
            "id": 886,
            "name": "铜陵县"
          },
          {
            "id": 889,
            "name": "郊区"
          },
          {
            "id": 890,
            "name": "枞阳县"
          }]
        },
        "宿州": {
          "id": 1065,
          "children": [{
            "id": 1065,
            "name": "全部"
          },
          {
            "id": 1066,
            "name": "萧县"
          },
          {
            "id": 1067,
            "name": "砀山县"
          },
          {
            "id": 1070,
            "name": "灵璧县"
          },
          {
            "id": 1079,
            "name": "埇桥区"
          },
          {
            "id": 1080,
            "name": "泗县"
          }]
        },
        "马鞍山": {
          "id": 1602,
          "children": [{
            "id": 1602,
            "name": "全部"
          },
          {
            "id": 1603,
            "name": "雨山区"
          },
          {
            "id": 1604,
            "name": "当涂县"
          },
          {
            "id": 1605,
            "name": "含山县"
          },
          {
            "id": 1606,
            "name": "和县"
          },
          {
            "id": 1616,
            "name": "博望区"
          },
          {
            "id": 1617,
            "name": "花山区"
          }]
        },
        "六安": {
          "id": 1787,
          "children": [{
            "id": 1787,
            "name": "全部"
          },
          {
            "id": 1788,
            "name": "金安区"
          },
          {
            "id": 1792,
            "name": "霍邱县"
          },
          {
            "id": 1800,
            "name": "裕安区"
          },
          {
            "id": 1801,
            "name": "金寨县"
          },
          {
            "id": 1802,
            "name": "舒城县"
          },
          {
            "id": 1811,
            "name": "叶集区"
          },
          {
            "id": 1812,
            "name": "霍山县"
          }]
        },
        "淮北": {
          "id": 2162,
          "children": [{
            "id": 2162,
            "name": "全部"
          },
          {
            "id": 2163,
            "name": "杜集区"
          },
          {
            "id": 2164,
            "name": "濉溪县"
          },
          {
            "id": 2168,
            "name": "烈山区"
          },
          {
            "id": 2176,
            "name": "相山区"
          }]
        },
        "淮南": {
          "id": 2346,
          "children": [{
            "id": 2346,
            "name": "全部"
          },
          {
            "id": 2347,
            "name": "大通区"
          },
          {
            "id": 2351,
            "name": "谢家集区"
          },
          {
            "id": 2356,
            "name": "八公山区"
          },
          {
            "id": 2357,
            "name": "潘集区"
          },
          {
            "id": 2363,
            "name": "寿县"
          },
          {
            "id": 2374,
            "name": "田家庵区"
          },
          {
            "id": 2375,
            "name": "凤台县"
          }]
        },
        "合肥": {
          "id": 2416,
          "children": [{
            "id": 2416,
            "name": "全部"
          },
          {
            "id": 2417,
            "name": "经开区"
          },
          {
            "id": 2418,
            "name": "庐阳区"
          },
          {
            "id": 2419,
            "name": "新站区"
          },
          {
            "id": 2421,
            "name": "蜀山区"
          },
          {
            "id": 2422,
            "name": "瑶海区"
          },
          {
            "id": 2423,
            "name": "高新区"
          },
          {
            "id": 2424,
            "name": "包河区"
          },
          {
            "id": 2425,
            "name": "肥西县"
          },
          {
            "id": 2426,
            "name": "肥东县"
          },
          {
            "id": 2427,
            "name": "滨湖区"
          },
          {
            "id": 2428,
            "name": "长丰县"
          },
          {
            "id": 2429,
            "name": "巢湖市"
          },
          {
            "id": 2430,
            "name": "近郊"
          },
          {
            "id": 2443,
            "name": "庐江县"
          }]
        },
        "阜阳": {
          "id": 2582,
          "children": [{
            "id": 2582,
            "name": "全部"
          },
          {
            "id": 2583,
            "name": "颍东区"
          },
          {
            "id": 2585,
            "name": "颍泉区"
          },
          {
            "id": 2587,
            "name": "界首市"
          },
          {
            "id": 2588,
            "name": "阜南县"
          },
          {
            "id": 2591,
            "name": "太和县"
          },
          {
            "id": 2592,
            "name": "临泉县"
          },
          {
            "id": 2597,
            "name": "颍上县"
          },
          {
            "id": 2598,
            "name": "颍州区"
          }]
        },
        "池州": {
          "id": 2790,
          "children": [{
            "id": 2790,
            "name": "全部"
          },
          {
            "id": 2791,
            "name": "东至县"
          },
          {
            "id": 2792,
            "name": "石台县"
          },
          {
            "id": 2794,
            "name": "青阳县"
          },
          {
            "id": 2810,
            "name": "贵池区"
          }]
        },
        "巢湖": {
          "id": 2795,
          "children": [{
            "id": 2795,
            "name": "全部"
          },
          {
            "id": 2796,
            "name": "半汤温泉"
          },
          {
            "id": 2797,
            "name": "万尚城时尚广场"
          },
          {
            "id": 2798,
            "name": "巢湖百大购物中心"
          },
          {
            "id": 2799,
            "name": "信泰广场"
          },
          {
            "id": 2800,
            "name": "巢湖职业技术学院"
          },
          {
            "id": 2801,
            "name": "安德利购物中心"
          },
          {
            "id": 2802,
            "name": "巢湖火车站"
          },
          {
            "id": 2803,
            "name": "巢湖市中医院"
          },
          {
            "id": 2804,
            "name": "巢湖学院"
          },
          {
            "id": 2805,
            "name": "第一人民医院"
          },
          {
            "id": 2806,
            "name": "巢湖香泉"
          },
          {
            "id": 2807,
            "name": "耳街"
          },
          {
            "id": 2808,
            "name": "东方新世界"
          },
          {
            "id": 2809,
            "name": "军分区路"
          },
          {
            "id": 2813,
            "name": "忠庙"
          },
          {
            "id": 2816,
            "name": "巢湖电大"
          },
          {
            "id": 2820,
            "name": "中凯"
          }]
        },
        "滁州": {
          "id": 2818,
          "children": [{
            "id": 2818,
            "name": "全部"
          },
          {
            "id": 2819,
            "name": "南谯区"
          },
          {
            "id": 2821,
            "name": "明光市"
          },
          {
            "id": 2827,
            "name": "全椒县"
          },
          {
            "id": 2828,
            "name": "来安县"
          },
          {
            "id": 2829,
            "name": "定远县"
          },
          {
            "id": 2830,
            "name": "天长市"
          },
          {
            "id": 2833,
            "name": "凤阳县"
          },
          {
            "id": 2842,
            "name": "琅琊区"
          }]
        },
        "安庆": {
          "id": 3041,
          "children": [{
            "id": 3041,
            "name": "全部"
          },
          {
            "id": 3042,
            "name": "宜秀区"
          },
          {
            "id": 3043,
            "name": "迎江区"
          },
          {
            "id": 3045,
            "name": "大观区"
          },
          {
            "id": 3048,
            "name": "桐城市"
          },
          {
            "id": 3051,
            "name": "太湖县"
          },
          {
            "id": 3052,
            "name": "宿松县"
          },
          {
            "id": 3054,
            "name": "潜山县"
          },
          {
            "id": 3055,
            "name": "望江县"
          },
          {
            "id": 3056,
            "name": "怀宁县"
          },
          {
            "id": 3069,
            "name": "岳西县"
          }]
        }
      }
    },
    "河北省": {
      "id": 19,
      "children": {
        "全部": {
          "id": 19,
          "children": [{
            "id": 19,
            "name": "全部"
          }]
        },
        "保定": {
          "id": 20,
          "children": [{
            "id": 20,
            "name": "全部"
          },
          {
            "id": 21,
            "name": "竞秀区"
          },
          {
            "id": 23,
            "name": "莲池区"
          },
          {
            "id": 24,
            "name": "易县"
          },
          {
            "id": 25,
            "name": "安国市"
          },
          {
            "id": 26,
            "name": "涿州市"
          },
          {
            "id": 27,
            "name": "定州市"
          },
          {
            "id": 28,
            "name": "高碑店市"
          },
          {
            "id": 29,
            "name": "满城区"
          },
          {
            "id": 33,
            "name": "清苑区"
          },
          {
            "id": 35,
            "name": "定兴县"
          },
          {
            "id": 39,
            "name": "望都县"
          },
          {
            "id": 40,
            "name": "唐县"
          },
          {
            "id": 43,
            "name": "涞源县"
          },
          {
            "id": 45,
            "name": "顺平县"
          },
          {
            "id": 55,
            "name": "徐水区"
          },
          {
            "id": 60,
            "name": "安新县"
          },
          {
            "id": 62,
            "name": "雄县"
          },
          {
            "id": 64,
            "name": "高阳县"
          },
          {
            "id": 65,
            "name": "阜平县"
          },
          {
            "id": 66,
            "name": "博野县"
          },
          {
            "id": 67,
            "name": "涞水县"
          },
          {
            "id": 68,
            "name": "曲阳县"
          },
          {
            "id": 70,
            "name": "容城县"
          },
          {
            "id": 77,
            "name": "蠡县"
          }]
        },
        "张家口": {
          "id": 180,
          "children": [{
            "id": 180,
            "name": "全部"
          },
          {
            "id": 181,
            "name": "桥西区"
          },
          {
            "id": 182,
            "name": "下花园区"
          },
          {
            "id": 183,
            "name": "桥东区"
          },
          {
            "id": 184,
            "name": "康保县"
          },
          {
            "id": 185,
            "name": "张北县"
          },
          {
            "id": 186,
            "name": "沽源县"
          },
          {
            "id": 187,
            "name": "蔚县"
          },
          {
            "id": 188,
            "name": "阳原县"
          },
          {
            "id": 189,
            "name": "尚义县"
          },
          {
            "id": 190,
            "name": "怀安县"
          },
          {
            "id": 191,
            "name": "怀来县"
          },
          {
            "id": 192,
            "name": "赤城县"
          },
          {
            "id": 196,
            "name": "崇礼区"
          },
          {
            "id": 197,
            "name": "万全县"
          },
          {
            "id": 198,
            "name": "涿鹿县"
          },
          {
            "id": 245,
            "name": "宣化区"
          }]
        },
        "邢台": {
          "id": 573,
          "children": [{
            "id": 573,
            "name": "全部"
          },
          {
            "id": 574,
            "name": "桥东区"
          },
          {
            "id": 579,
            "name": "桥西区"
          },
          {
            "id": 584,
            "name": "沙河市"
          },
          {
            "id": 585,
            "name": "内丘县"
          },
          {
            "id": 587,
            "name": "邢台县"
          },
          {
            "id": 590,
            "name": "临城县"
          },
          {
            "id": 594,
            "name": "任县"
          },
          {
            "id": 595,
            "name": "南和县"
          },
          {
            "id": 596,
            "name": "南宫市"
          },
          {
            "id": 597,
            "name": "宁晋县"
          },
          {
            "id": 598,
            "name": "柏乡县"
          },
          {
            "id": 599,
            "name": "广宗县"
          },
          {
            "id": 604,
            "name": "巨鹿县"
          },
          {
            "id": 606,
            "name": "平乡县"
          },
          {
            "id": 610,
            "name": "新河县"
          },
          {
            "id": 612,
            "name": "隆尧县"
          },
          {
            "id": 616,
            "name": "威县"
          },
          {
            "id": 617,
            "name": "清河县"
          },
          {
            "id": 618,
            "name": "临西县"
          }]
        },
        "石家庄": {
          "id": 1169,
          "children": [{
            "id": 1169,
            "name": "全部"
          },
          {
            "id": 1170,
            "name": "长安区"
          },
          {
            "id": 1171,
            "name": "桥西区"
          },
          {
            "id": 1175,
            "name": "裕华区"
          },
          {
            "id": 1180,
            "name": "新华区"
          },
          {
            "id": 1184,
            "name": "开发区"
          },
          {
            "id": 1185,
            "name": "井陉县"
          },
          {
            "id": 1188,
            "name": "藁城区"
          },
          {
            "id": 1189,
            "name": "辛集市"
          },
          {
            "id": 1193,
            "name": "正定县"
          },
          {
            "id": 1195,
            "name": "井陉矿区"
          },
          {
            "id": 1198,
            "name": "近郊"
          },
          {
            "id": 1200,
            "name": "晋州市"
          },
          {
            "id": 1204,
            "name": "鹿泉区"
          },
          {
            "id": 1205,
            "name": "新乐市"
          },
          {
            "id": 1207,
            "name": "行唐县"
          },
          {
            "id": 1208,
            "name": "灵寿县"
          },
          {
            "id": 1209,
            "name": "栾城区"
          },
          {
            "id": 1212,
            "name": "高邑县"
          },
          {
            "id": 1214,
            "name": "赞皇县"
          },
          {
            "id": 1216,
            "name": "深泽县"
          },
          {
            "id": 1217,
            "name": "无极县"
          },
          {
            "id": 1220,
            "name": "赵县"
          },
          {
            "id": 1221,
            "name": "平山县"
          },
          {
            "id": 1223,
            "name": "元氏县"
          }]
        },
        "秦皇岛": {
          "id": 1371,
          "children": [{
            "id": 1371,
            "name": "全部"
          },
          {
            "id": 1372,
            "name": "昌黎县"
          },
          {
            "id": 1373,
            "name": "山海关区"
          },
          {
            "id": 1375,
            "name": "北戴河区"
          },
          {
            "id": 1376,
            "name": "卢龙县"
          },
          {
            "id": 1378,
            "name": "抚宁区"
          },
          {
            "id": 1379,
            "name": "海港区"
          },
          {
            "id": 1380,
            "name": "南戴河"
          },
          {
            "id": 1381,
            "name": "青龙县"
          },
          {
            "id": 1387,
            "name": "开发区"
          }]
        },
        "廊坊": {
          "id": 1815,
          "children": [{
            "id": 1815,
            "name": "全部"
          },
          {
            "id": 1816,
            "name": "广阳区"
          },
          {
            "id": 1819,
            "name": "三河市"
          },
          {
            "id": 1820,
            "name": "安次区"
          },
          {
            "id": 1823,
            "name": "霸州市"
          },
          {
            "id": 1826,
            "name": "香河县"
          },
          {
            "id": 1829,
            "name": "固安县"
          },
          {
            "id": 1830,
            "name": "永清县"
          },
          {
            "id": 1831,
            "name": "开发区"
          },
          {
            "id": 1832,
            "name": "文安县"
          },
          {
            "id": 1835,
            "name": "大城县"
          },
          {
            "id": 1841,
            "name": "大厂回族自治县"
          }]
        },
        "衡水": {
          "id": 2244,
          "children": [{
            "id": 2244,
            "name": "全部"
          },
          {
            "id": 2245,
            "name": "冀州市"
          },
          {
            "id": 2247,
            "name": "枣强县"
          },
          {
            "id": 2248,
            "name": "武邑县"
          },
          {
            "id": 2249,
            "name": "深州市"
          },
          {
            "id": 2251,
            "name": "饶阳县"
          },
          {
            "id": 2254,
            "name": "景县"
          },
          {
            "id": 2255,
            "name": "故城县"
          },
          {
            "id": 2256,
            "name": "安平县"
          },
          {
            "id": 2257,
            "name": "武强县"
          },
          {
            "id": 2261,
            "name": "阜城县"
          },
          {
            "id": 2266,
            "name": "桃城区"
          }]
        },
        "邯郸": {
          "id": 2336,
          "children": [{
            "id": 2336,
            "name": "全部"
          },
          {
            "id": 2337,
            "name": "复兴区"
          },
          {
            "id": 2338,
            "name": "邯山区"
          },
          {
            "id": 2340,
            "name": "丛台区"
          },
          {
            "id": 2342,
            "name": "峰峰矿区"
          },
          {
            "id": 2343,
            "name": "武安市"
          },
          {
            "id": 2350,
            "name": "成安县"
          },
          {
            "id": 2352,
            "name": "涉县"
          },
          {
            "id": 2353,
            "name": "磁县"
          },
          {
            "id": 2354,
            "name": "永年县"
          },
          {
            "id": 2359,
            "name": "临漳县"
          },
          {
            "id": 2360,
            "name": "魏县"
          },
          {
            "id": 2364,
            "name": "大名县"
          },
          {
            "id": 2365,
            "name": "肥乡区"
          },
          {
            "id": 2367,
            "name": "鸡泽县"
          },
          {
            "id": 2369,
            "name": "广平县"
          },
          {
            "id": 2370,
            "name": "馆陶县"
          },
          {
            "id": 2371,
            "name": "曲周县"
          },
          {
            "id": 2372,
            "name": "邱县"
          }]
        },
        "沧州": {
          "id": 2837,
          "children": [{
            "id": 2837,
            "name": "全部"
          },
          {
            "id": 2838,
            "name": "新华区"
          },
          {
            "id": 2839,
            "name": "泊头市"
          },
          {
            "id": 2843,
            "name": "运河区"
          },
          {
            "id": 2846,
            "name": "任丘市"
          },
          {
            "id": 2848,
            "name": "黄骅市"
          },
          {
            "id": 2851,
            "name": "河间市"
          },
          {
            "id": 2852,
            "name": "沧县"
          },
          {
            "id": 2860,
            "name": "青县"
          },
          {
            "id": 2862,
            "name": "东光县"
          },
          {
            "id": 2865,
            "name": "海兴县"
          },
          {
            "id": 2871,
            "name": "盐山县"
          },
          {
            "id": 2874,
            "name": "肃宁县"
          },
          {
            "id": 2878,
            "name": "献县"
          },
          {
            "id": 2880,
            "name": "孟村回族自治县"
          },
          {
            "id": 2881,
            "name": "南皮县"
          },
          {
            "id": 2885,
            "name": "吴桥县"
          }]
        },
        "承德": {
          "id": 3062,
          "children": [{
            "id": 3062,
            "name": "全部"
          },
          {
            "id": 3063,
            "name": "双滦区"
          },
          {
            "id": 3066,
            "name": "双桥区"
          },
          {
            "id": 3067,
            "name": "兴隆县"
          },
          {
            "id": 3068,
            "name": "鹰手营子矿区"
          },
          {
            "id": 3070,
            "name": "承德县"
          },
          {
            "id": 3071,
            "name": "平泉市"
          },
          {
            "id": 3072,
            "name": "隆化县"
          },
          {
            "id": 3073,
            "name": "宽城满族自治县"
          },
          {
            "id": 3074,
            "name": "围场县"
          },
          {
            "id": 3077,
            "name": "滦平县"
          },
          {
            "id": 3081,
            "name": "丰宁满族自治县"
          }]
        },
        "唐山": {
          "id": 3157,
          "children": [{
            "id": 3157,
            "name": "全部"
          },
          {
            "id": 3158,
            "name": "丰润区"
          },
          {
            "id": 3160,
            "name": "丰南区"
          },
          {
            "id": 3161,
            "name": "古冶区"
          },
          {
            "id": 3162,
            "name": "开平区"
          },
          {
            "id": 3163,
            "name": "迁安市"
          },
          {
            "id": 3164,
            "name": "迁西县"
          },
          {
            "id": 3165,
            "name": "路北区"
          },
          {
            "id": 3167,
            "name": "滦县"
          },
          {
            "id": 3168,
            "name": "路南区"
          },
          {
            "id": 3169,
            "name": "遵化市"
          },
          {
            "id": 3172,
            "name": "滦南县"
          },
          {
            "id": 3173,
            "name": "曹妃甸区"
          },
          {
            "id": 3182,
            "name": "乐亭县"
          },
          {
            "id": 3187,
            "name": "玉田县"
          }]
        }
      }
    },
    "内蒙古自治区": {
      "id": 30,
      "children": {
        "全部": {
          "id": 30,
          "children": [{
            "id": 30,
            "name": "全部"
          }]
        },
        "巴彦淖尔": {
          "id": 31,
          "children": [{
            "id": 31,
            "name": "全部"
          },
          {
            "id": 32,
            "name": "临河区"
          },
          {
            "id": 48,
            "name": "五原县"
          },
          {
            "id": 49,
            "name": "乌拉特中旗"
          },
          {
            "id": 50,
            "name": "乌拉特后旗"
          },
          {
            "id": 52,
            "name": "杭锦后旗"
          },
          {
            "id": 53,
            "name": "乌拉特前旗"
          },
          {
            "id": 54,
            "name": "磴口县"
          }]
        },
        "包头": {
          "id": 105,
          "children": [{
            "id": 105,
            "name": "全部"
          },
          {
            "id": 106,
            "name": "昆都仑区"
          },
          {
            "id": 108,
            "name": "东河区"
          },
          {
            "id": 109,
            "name": "九原区"
          },
          {
            "id": 113,
            "name": "青山区"
          },
          {
            "id": 114,
            "name": "白云矿区"
          },
          {
            "id": 115,
            "name": "固阳县"
          },
          {
            "id": 117,
            "name": "高新区"
          },
          {
            "id": 118,
            "name": "达茂旗"
          },
          {
            "id": 119,
            "name": "石拐区"
          },
          {
            "id": 121,
            "name": "土默特右旗"
          }]
        },
        "兴安盟": {
          "id": 554,
          "children": [{
            "id": 554,
            "name": "全部"
          },
          {
            "id": 555,
            "name": "乌兰浩特市"
          },
          {
            "id": 560,
            "name": "阿尔山市"
          },
          {
            "id": 566,
            "name": "科尔沁右翼前旗"
          },
          {
            "id": 567,
            "name": "科尔沁右翼中旗"
          },
          {
            "id": 568,
            "name": "扎赉特旗"
          },
          {
            "id": 571,
            "name": "突泉县"
          }]
        },
        "乌兰察布": {
          "id": 731,
          "children": [{
            "id": 731,
            "name": "全部"
          },
          {
            "id": 732,
            "name": "集宁区"
          },
          {
            "id": 733,
            "name": "丰镇市"
          },
          {
            "id": 734,
            "name": "化德县"
          },
          {
            "id": 737,
            "name": "卓资县"
          },
          {
            "id": 738,
            "name": "凉城县"
          },
          {
            "id": 739,
            "name": "兴和县"
          },
          {
            "id": 740,
            "name": "察哈尔右翼前旗"
          },
          {
            "id": 742,
            "name": "商都县"
          },
          {
            "id": 743,
            "name": "察哈尔右翼中旗"
          },
          {
            "id": 744,
            "name": "察哈尔右翼后旗"
          },
          {
            "id": 747,
            "name": "四子王旗"
          }]
        },
        "乌海": {
          "id": 745,
          "children": [{
            "id": 745,
            "name": "全部"
          },
          {
            "id": 746,
            "name": "乌达区"
          },
          {
            "id": 755,
            "name": "海南区"
          },
          {
            "id": 756,
            "name": "海勃湾区"
          }]
        },
        "通辽": {
          "id": 866,
          "children": [{
            "id": 866,
            "name": "全部"
          },
          {
            "id": 867,
            "name": "库伦旗"
          },
          {
            "id": 868,
            "name": "开鲁县"
          },
          {
            "id": 869,
            "name": "科尔沁区"
          },
          {
            "id": 870,
            "name": "奈曼旗"
          },
          {
            "id": 871,
            "name": "科尔沁左翼中旗"
          },
          {
            "id": 872,
            "name": "扎鲁特旗"
          },
          {
            "id": 873,
            "name": "霍林郭勒市"
          },
          {
            "id": 874,
            "name": "科尔沁左翼后旗"
          }]
        },
        "呼伦贝尔": {
          "id": 2230,
          "children": [{
            "id": 2230,
            "name": "全部"
          },
          {
            "id": 2231,
            "name": "海拉尔区"
          },
          {
            "id": 2233,
            "name": "根河市"
          },
          {
            "id": 2235,
            "name": "阿荣旗"
          },
          {
            "id": 2236,
            "name": "满洲里市"
          },
          {
            "id": 2237,
            "name": "牙克石市"
          },
          {
            "id": 2238,
            "name": "陈巴尔虎旗"
          },
          {
            "id": 2239,
            "name": "鄂温克族自治旗"
          },
          {
            "id": 2241,
            "name": "新巴尔虎右旗"
          },
          {
            "id": 2242,
            "name": "鄂伦春自治旗"
          },
          {
            "id": 2243,
            "name": "新巴尔虎左旗"
          },
          {
            "id": 2246,
            "name": "额尔古纳市"
          },
          {
            "id": 2250,
            "name": "莫力达瓦旗"
          },
          {
            "id": 2252,
            "name": "扎赉诺尔区"
          },
          {
            "id": 2253,
            "name": "扎兰屯市"
          }]
        },
        "呼和浩特": {
          "id": 2305,
          "children": [{
            "id": 2305,
            "name": "全部"
          },
          {
            "id": 2306,
            "name": "赛罕区"
          },
          {
            "id": 2307,
            "name": "新城区"
          },
          {
            "id": 2311,
            "name": "近郊"
          },
          {
            "id": 2314,
            "name": "回民区"
          },
          {
            "id": 2315,
            "name": "玉泉区"
          },
          {
            "id": 2316,
            "name": "武川县"
          },
          {
            "id": 2322,
            "name": "清水河县"
          },
          {
            "id": 2324,
            "name": "托克托县"
          },
          {
            "id": 2325,
            "name": "土默特左旗"
          },
          {
            "id": 2328,
            "name": "金川开发区"
          },
          {
            "id": 2334,
            "name": "和林格尔县"
          }]
        },
        "鄂尔多斯": {
          "id": 2620,
          "children": [{
            "id": 2620,
            "name": "全部"
          },
          {
            "id": 2621,
            "name": "达拉特旗"
          },
          {
            "id": 2624,
            "name": "鄂托克前旗"
          },
          {
            "id": 2625,
            "name": "乌审旗"
          },
          {
            "id": 2627,
            "name": "鄂托克旗"
          },
          {
            "id": 2628,
            "name": "东胜区"
          },
          {
            "id": 2629,
            "name": "伊金霍洛旗"
          },
          {
            "id": 2630,
            "name": "康巴什区"
          },
          {
            "id": 2631,
            "name": "准格尔旗"
          },
          {
            "id": 2635,
            "name": "杭锦旗"
          }]
        },
        "赤峰": {
          "id": 2831,
          "children": [{
            "id": 2831,
            "name": "全部"
          },
          {
            "id": 2832,
            "name": "红山区"
          },
          {
            "id": 2834,
            "name": "松山区"
          },
          {
            "id": 2835,
            "name": "宁城县"
          },
          {
            "id": 2836,
            "name": "林西县"
          },
          {
            "id": 2840,
            "name": "元宝山区"
          },
          {
            "id": 2841,
            "name": "巴林左旗"
          },
          {
            "id": 2847,
            "name": "巴林右旗"
          },
          {
            "id": 2849,
            "name": "克什克腾旗"
          },
          {
            "id": 2853,
            "name": "阿鲁科尔沁旗"
          },
          {
            "id": 2858,
            "name": "喀喇沁旗"
          },
          {
            "id": 2859,
            "name": "新城区"
          },
          {
            "id": 2861,
            "name": "翁牛特旗"
          },
          {
            "id": 2864,
            "name": "敖汉旗"
          }]
        },
        "阿拉善盟": {
          "id": 3022,
          "children": [{
            "id": 3022,
            "name": "全部"
          },
          {
            "id": 3023,
            "name": "阿拉善左旗"
          },
          {
            "id": 3024,
            "name": "阿拉善右旗"
          },
          {
            "id": 3027,
            "name": "额济纳旗"
          }]
        }
      }
    },
    "山东省": {
      "id": 36,
      "children": {
        "全部": {
          "id": 36,
          "children": [{
            "id": 36,
            "name": "全部"
          }]
        },
        "滨州": {
          "id": 37,
          "children": [{
            "id": 37,
            "name": "全部"
          },
          {
            "id": 38,
            "name": "滨城区"
          },
          {
            "id": 41,
            "name": "惠民县"
          },
          {
            "id": 42,
            "name": "阳信县"
          },
          {
            "id": 44,
            "name": "沾化区"
          },
          {
            "id": 46,
            "name": "博兴县"
          },
          {
            "id": 47,
            "name": "无棣县"
          },
          {
            "id": 51,
            "name": "邹平县"
          }]
        },
        "枣庄": {
          "id": 201,
          "children": [{
            "id": 201,
            "name": "全部"
          },
          {
            "id": 202,
            "name": "峄城区"
          },
          {
            "id": 204,
            "name": "山亭区"
          },
          {
            "id": 205,
            "name": "薛城区"
          },
          {
            "id": 206,
            "name": "台儿庄区"
          },
          {
            "id": 207,
            "name": "滕州市"
          },
          {
            "id": 227,
            "name": "市中区"
          }]
        },
        "淄博": {
          "id": 256,
          "children": [{
            "id": 256,
            "name": "全部"
          },
          {
            "id": 257,
            "name": "张店区"
          },
          {
            "id": 265,
            "name": "临淄区"
          },
          {
            "id": 266,
            "name": "淄川区"
          },
          {
            "id": 267,
            "name": "周村区"
          },
          {
            "id": 268,
            "name": "博山区"
          },
          {
            "id": 269,
            "name": "高青县"
          },
          {
            "id": 270,
            "name": "沂源县"
          },
          {
            "id": 273,
            "name": "桓台县"
          }]
        },
        "烟台": {
          "id": 479,
          "children": [{
            "id": 479,
            "name": "全部"
          },
          {
            "id": 480,
            "name": "芝罘区"
          },
          {
            "id": 486,
            "name": "福山区"
          },
          {
            "id": 488,
            "name": "牟平区"
          },
          {
            "id": 489,
            "name": "开发区"
          },
          {
            "id": 495,
            "name": "莱山区"
          },
          {
            "id": 501,
            "name": "栖霞市"
          },
          {
            "id": 505,
            "name": "莱阳市"
          },
          {
            "id": 506,
            "name": "招远市"
          },
          {
            "id": 507,
            "name": "海阳市"
          },
          {
            "id": 508,
            "name": "长岛县"
          },
          {
            "id": 515,
            "name": "莱州市"
          },
          {
            "id": 519,
            "name": "蓬莱市"
          },
          {
            "id": 533,
            "name": "龙口市"
          }]
        },
        "威海": {
          "id": 773,
          "children": [{
            "id": 773,
            "name": "全部"
          },
          {
            "id": 774,
            "name": "荣成市"
          },
          {
            "id": 775,
            "name": "文登区"
          },
          {
            "id": 779,
            "name": "乳山市"
          },
          {
            "id": 780,
            "name": "经济开发区"
          },
          {
            "id": 781,
            "name": "高区"
          },
          {
            "id": 788,
            "name": "环翠区"
          }]
        },
        "潍坊": {
          "id": 797,
          "children": [{
            "id": 797,
            "name": "全部"
          },
          {
            "id": 798,
            "name": "潍城区"
          },
          {
            "id": 799,
            "name": "坊子区"
          },
          {
            "id": 801,
            "name": "诸城市"
          },
          {
            "id": 804,
            "name": "奎文区"
          },
          {
            "id": 805,
            "name": "寿光市"
          },
          {
            "id": 806,
            "name": "昌邑市"
          },
          {
            "id": 809,
            "name": "临朐县"
          },
          {
            "id": 810,
            "name": "安丘市"
          },
          {
            "id": 811,
            "name": "青州市"
          },
          {
            "id": 816,
            "name": "高密市"
          },
          {
            "id": 817,
            "name": "高新区"
          },
          {
            "id": 818,
            "name": "昌乐县"
          },
          {
            "id": 819,
            "name": "寒亭区"
          }]
        },
        "日照": {
          "id": 1224,
          "children": [{
            "id": 1224,
            "name": "全部"
          },
          {
            "id": 1225,
            "name": "莒县"
          },
          {
            "id": 1226,
            "name": "五莲县"
          },
          {
            "id": 1233,
            "name": "岚山区"
          },
          {
            "id": 1234,
            "name": "东港区"
          }]
        },
        "青岛": {
          "id": 1382,
          "children": [{
            "id": 1382,
            "name": "全部"
          },
          {
            "id": 1383,
            "name": "李沧区"
          },
          {
            "id": 1384,
            "name": "市南区"
          },
          {
            "id": 1385,
            "name": "市北区"
          },
          {
            "id": 1386,
            "name": "崂山区"
          },
          {
            "id": 1388,
            "name": "即墨市"
          },
          {
            "id": 1389,
            "name": "城阳区"
          },
          {
            "id": 1391,
            "name": "平度市"
          },
          {
            "id": 1392,
            "name": "黄岛区"
          },
          {
            "id": 1393,
            "name": "胶州市"
          },
          {
            "id": 1402,
            "name": "莱西市"
          }]
        },
        "莱芜": {
          "id": 1716,
          "children": [{
            "id": 1716,
            "name": "全部"
          },
          {
            "id": 1717,
            "name": "莱城区"
          },
          {
            "id": 1718,
            "name": "钢城区"
          }]
        },
        "聊城": {
          "id": 1854,
          "children": [{
            "id": 1854,
            "name": "全部"
          },
          {
            "id": 1855,
            "name": "莘县"
          },
          {
            "id": 1856,
            "name": "阳谷县"
          },
          {
            "id": 1857,
            "name": "东阿县"
          },
          {
            "id": 1858,
            "name": "冠县"
          },
          {
            "id": 1859,
            "name": "临清市"
          },
          {
            "id": 1860,
            "name": "高唐县"
          },
          {
            "id": 1861,
            "name": "茌平县"
          },
          {
            "id": 1870,
            "name": "开发区"
          },
          {
            "id": 1874,
            "name": "东昌府区"
          }]
        },
        "临沂": {
          "id": 1898,
          "children": [{
            "id": 1898,
            "name": "全部"
          },
          {
            "id": 1899,
            "name": "罗庄区"
          },
          {
            "id": 1900,
            "name": "河东区"
          },
          {
            "id": 1906,
            "name": "沂水县"
          },
          {
            "id": 1909,
            "name": "兰陵县"
          },
          {
            "id": 1913,
            "name": "蒙阴县"
          },
          {
            "id": 1914,
            "name": "郯城县"
          },
          {
            "id": 1915,
            "name": "沂南县"
          },
          {
            "id": 1916,
            "name": "临沭县"
          },
          {
            "id": 1917,
            "name": "兰山区"
          },
          {
            "id": 1918,
            "name": "莒南县"
          },
          {
            "id": 1919,
            "name": "平邑县"
          },
          {
            "id": 1920,
            "name": "费县"
          }]
        },
        "济宁": {
          "id": 2095,
          "children": [{
            "id": 2095,
            "name": "全部"
          },
          {
            "id": 2096,
            "name": "任城区"
          },
          {
            "id": 2098,
            "name": "邹城市"
          },
          {
            "id": 2099,
            "name": "汶上县"
          },
          {
            "id": 2100,
            "name": "兖州区"
          },
          {
            "id": 2101,
            "name": "微山县"
          },
          {
            "id": 2102,
            "name": "嘉祥县"
          },
          {
            "id": 2103,
            "name": "鱼台县"
          },
          {
            "id": 2104,
            "name": "金乡县"
          },
          {
            "id": 2105,
            "name": "泗水县"
          },
          {
            "id": 2106,
            "name": "梁山县"
          }]
        },
        "济南": {
          "id": 2117,
          "children": [{
            "id": 2117,
            "name": "全部"
          },
          {
            "id": 2118,
            "name": "市中区"
          },
          {
            "id": 2119,
            "name": "历城区"
          },
          {
            "id": 2122,
            "name": "历下区"
          },
          {
            "id": 2125,
            "name": "槐荫区"
          },
          {
            "id": 2136,
            "name": "长清区"
          },
          {
            "id": 2137,
            "name": "近郊"
          },
          {
            "id": 2143,
            "name": "天桥区"
          },
          {
            "id": 2146,
            "name": "平阴县"
          },
          {
            "id": 2148,
            "name": "高新区"
          },
          {
            "id": 2150,
            "name": "济阳县"
          },
          {
            "id": 2154,
            "name": "商河县"
          },
          {
            "id": 2157,
            "name": "章丘区"
          }]
        },
        "菏泽": {
          "id": 2292,
          "children": [{
            "id": 2292,
            "name": "全部"
          },
          {
            "id": 2293,
            "name": "牡丹区"
          },
          {
            "id": 2297,
            "name": "曹县"
          },
          {
            "id": 2298,
            "name": "定陶区"
          },
          {
            "id": 2300,
            "name": "成武县"
          },
          {
            "id": 2301,
            "name": "单县"
          },
          {
            "id": 2304,
            "name": "东明县"
          },
          {
            "id": 2308,
            "name": "巨野县"
          },
          {
            "id": 2309,
            "name": "郓城县"
          },
          {
            "id": 2310,
            "name": "鄄城县"
          }]
        },
        "德州": {
          "id": 2678,
          "children": [{
            "id": 2678,
            "name": "全部"
          },
          {
            "id": 2679,
            "name": "乐陵市"
          },
          {
            "id": 2683,
            "name": "德城区"
          },
          {
            "id": 2684,
            "name": "禹城市"
          },
          {
            "id": 2685,
            "name": "陵城区"
          },
          {
            "id": 2686,
            "name": "平原县"
          },
          {
            "id": 2687,
            "name": "夏津县"
          },
          {
            "id": 2691,
            "name": "武城县"
          },
          {
            "id": 2694,
            "name": "齐河县"
          },
          {
            "id": 2699,
            "name": "临邑县"
          },
          {
            "id": 2700,
            "name": "宁津县"
          },
          {
            "id": 2705,
            "name": "庆云县"
          }]
        },
        "泰安": {
          "id": 3148,
          "children": [{
            "id": 3148,
            "name": "全部"
          },
          {
            "id": 3149,
            "name": "岱岳区"
          },
          {
            "id": 3152,
            "name": "肥城市"
          },
          {
            "id": 3153,
            "name": "新泰市"
          },
          {
            "id": 3154,
            "name": "宁阳县"
          },
          {
            "id": 3155,
            "name": "东平县"
          },
          {
            "id": 3166,
            "name": "泰山区"
          }]
        }
      }
    },
    "北京市": {
      "id": 56,
      "children": {
        "全部": {
          "id": 56,
          "children": [{
            "id": 56,
            "name": "全部"
          }]
        },
        "北京": {
          "id": 57,
          "children": [{
            "id": 57,
            "name": "全部"
          },
          {
            "id": 58,
            "name": "海淀区"
          },
          {
            "id": 59,
            "name": "西城区"
          },
          {
            "id": 61,
            "name": "丰台区"
          },
          {
            "id": 63,
            "name": "朝阳区"
          },
          {
            "id": 69,
            "name": "东城区"
          },
          {
            "id": 71,
            "name": "昌平区"
          },
          {
            "id": 72,
            "name": "石景山区"
          },
          {
            "id": 73,
            "name": "通州区"
          },
          {
            "id": 83,
            "name": "大兴区"
          },
          {
            "id": 85,
            "name": "密云区"
          },
          {
            "id": 87,
            "name": "房山区"
          },
          {
            "id": 89,
            "name": "顺义区"
          },
          {
            "id": 90,
            "name": "怀柔区"
          },
          {
            "id": 98,
            "name": "延庆区"
          },
          {
            "id": 102,
            "name": "门头沟"
          },
          {
            "id": 110,
            "name": "平谷区"
          }]
        }
      }
    },
    "陕西省": {
      "id": 74,
      "children": {
        "全部": {
          "id": 74,
          "children": [{
            "id": 74,
            "name": "全部"
          }]
        },
        "宝鸡": {
          "id": 75,
          "children": [{
            "id": 75,
            "name": "全部"
          },
          {
            "id": 76,
            "name": "陈仓区"
          },
          {
            "id": 78,
            "name": "扶风县"
          },
          {
            "id": 80,
            "name": "岐山县"
          },
          {
            "id": 81,
            "name": "凤翔县"
          },
          {
            "id": 82,
            "name": "渭滨区"
          },
          {
            "id": 84,
            "name": "金台区"
          },
          {
            "id": 86,
            "name": "眉县"
          },
          {
            "id": 88,
            "name": "陇县"
          },
          {
            "id": 91,
            "name": "千阳县"
          },
          {
            "id": 92,
            "name": "太白县"
          },
          {
            "id": 93,
            "name": "高新区"
          },
          {
            "id": 94,
            "name": "麟游县"
          },
          {
            "id": 95,
            "name": "凤县"
          }]
        },
        "延安": {
          "id": 312,
          "children": [{
            "id": 312,
            "name": "全部"
          },
          {
            "id": 313,
            "name": "延长县"
          },
          {
            "id": 314,
            "name": "延川县"
          },
          {
            "id": 315,
            "name": "子长县"
          },
          {
            "id": 316,
            "name": "宝塔区"
          },
          {
            "id": 317,
            "name": "安塞县"
          },
          {
            "id": 318,
            "name": "甘泉县"
          },
          {
            "id": 319,
            "name": "富县"
          },
          {
            "id": 320,
            "name": "洛川县"
          },
          {
            "id": 321,
            "name": "宜川县"
          },
          {
            "id": 322,
            "name": "黄龙县"
          },
          {
            "id": 324,
            "name": "吴起县"
          },
          {
            "id": 325,
            "name": "黄陵县"
          },
          {
            "id": 326,
            "name": "志丹县"
          }]
        },
        "榆林": {
          "id": 374,
          "children": [{
            "id": 374,
            "name": "全部"
          },
          {
            "id": 375,
            "name": "府谷县"
          },
          {
            "id": 376,
            "name": "定边县"
          },
          {
            "id": 377,
            "name": "横山县"
          },
          {
            "id": 378,
            "name": "神木市"
          },
          {
            "id": 379,
            "name": "绥德县"
          },
          {
            "id": 383,
            "name": "米脂县"
          },
          {
            "id": 384,
            "name": "吴堡县"
          },
          {
            "id": 386,
            "name": "靖边县"
          },
          {
            "id": 389,
            "name": "清涧县"
          },
          {
            "id": 390,
            "name": "子洲县"
          },
          {
            "id": 391,
            "name": "佳县"
          },
          {
            "id": 392,
            "name": "榆阳区"
          }]
        },
        "咸阳": {
          "id": 642,
          "children": [{
            "id": 642,
            "name": "全部"
          },
          {
            "id": 643,
            "name": "乾县"
          },
          {
            "id": 645,
            "name": "杨陵"
          },
          {
            "id": 646,
            "name": "渭城"
          },
          {
            "id": 648,
            "name": "泾阳"
          },
          {
            "id": 649,
            "name": "礼泉"
          },
          {
            "id": 650,
            "name": "秦都"
          },
          {
            "id": 651,
            "name": "三原"
          },
          {
            "id": 652,
            "name": "永寿"
          },
          {
            "id": 653,
            "name": "彬县"
          },
          {
            "id": 654,
            "name": "长武"
          },
          {
            "id": 655,
            "name": "兴平"
          },
          {
            "id": 656,
            "name": "淳化"
          },
          {
            "id": 663,
            "name": "武功"
          },
          {
            "id": 668,
            "name": "旬邑"
          }]
        },
        "渭南": {
          "id": 748,
          "children": [{
            "id": 748,
            "name": "全部"
          },
          {
            "id": 749,
            "name": "华阴市"
          },
          {
            "id": 750,
            "name": "韩城市"
          },
          {
            "id": 751,
            "name": "蒲城县"
          },
          {
            "id": 752,
            "name": "澄城县"
          },
          {
            "id": 753,
            "name": "白水县"
          },
          {
            "id": 754,
            "name": "华县"
          },
          {
            "id": 757,
            "name": "大荔县"
          },
          {
            "id": 758,
            "name": "富平县"
          },
          {
            "id": 764,
            "name": "临渭区"
          },
          {
            "id": 765,
            "name": "合阳县"
          },
          {
            "id": 767,
            "name": "潼关县"
          }]
        },
        "商洛": {
          "id": 981,
          "children": [{
            "id": 981,
            "name": "全部"
          },
          {
            "id": 982,
            "name": "商州区"
          },
          {
            "id": 987,
            "name": "商南县"
          },
          {
            "id": 990,
            "name": "镇安县"
          },
          {
            "id": 991,
            "name": "柞水县"
          },
          {
            "id": 992,
            "name": "山阳县"
          },
          {
            "id": 1011,
            "name": "洛南县"
          },
          {
            "id": 1012,
            "name": "丹凤县"
          }]
        },
        "汉中": {
          "id": 2165,
          "children": [{
            "id": 2165,
            "name": "全部"
          },
          {
            "id": 2166,
            "name": "南郑区"
          },
          {
            "id": 2167,
            "name": "城固县"
          },
          {
            "id": 2169,
            "name": "西乡县"
          },
          {
            "id": 2170,
            "name": "勉县"
          },
          {
            "id": 2171,
            "name": "洋县"
          },
          {
            "id": 2172,
            "name": "宁强县"
          },
          {
            "id": 2173,
            "name": "留坝县"
          },
          {
            "id": 2174,
            "name": "镇巴县"
          },
          {
            "id": 2175,
            "name": "佛坪县"
          },
          {
            "id": 2177,
            "name": "略阳县"
          },
          {
            "id": 2182,
            "name": "汉台区"
          }]
        },
        "安康": {
          "id": 3025,
          "children": [{
            "id": 3025,
            "name": "全部"
          },
          {
            "id": 3026,
            "name": "汉阴县"
          },
          {
            "id": 3028,
            "name": "宁陕县"
          },
          {
            "id": 3029,
            "name": "紫阳县"
          },
          {
            "id": 3030,
            "name": "石泉县"
          },
          {
            "id": 3031,
            "name": "平利县"
          },
          {
            "id": 3032,
            "name": "岚皋县"
          },
          {
            "id": 3033,
            "name": "镇坪县"
          },
          {
            "id": 3034,
            "name": "旬阳县"
          },
          {
            "id": 3035,
            "name": "白河县"
          },
          {
            "id": 3039,
            "name": "汉滨区"
          }]
        },
        "铜川": {
          "id": 3170,
          "children": [{
            "id": 3170,
            "name": "全部"
          },
          {
            "id": 3171,
            "name": "王益区"
          },
          {
            "id": 3174,
            "name": "印台区"
          },
          {
            "id": 3177,
            "name": "耀州区"
          },
          {
            "id": 3179,
            "name": "宜君县"
          }]
        }
      }
    },
    "吉林省": {
      "id": 99,
      "children": {
        "全部": {
          "id": 99,
          "children": [{
            "id": 99,
            "name": "全部"
          }]
        },
        "白城": {
          "id": 100,
          "children": [{
            "id": 100,
            "name": "全部"
          },
          {
            "id": 101,
            "name": "洮北区"
          },
          {
            "id": 103,
            "name": "大安市"
          },
          {
            "id": 104,
            "name": "洮南市"
          },
          {
            "id": 107,
            "name": "镇赉县"
          },
          {
            "id": 120,
            "name": "通榆县"
          }]
        },
        "延边": {
          "id": 333,
          "children": [{
            "id": 333,
            "name": "全部"
          },
          {
            "id": 334,
            "name": "图们市"
          },
          {
            "id": 335,
            "name": "和龙市"
          },
          {
            "id": 336,
            "name": "珲春市"
          },
          {
            "id": 337,
            "name": "汪清县"
          },
          {
            "id": 338,
            "name": "龙井市"
          },
          {
            "id": 339,
            "name": "安图县"
          },
          {
            "id": 340,
            "name": "延吉市"
          },
          {
            "id": 345,
            "name": "敦化市"
          }]
        },
        "通化": {
          "id": 880,
          "children": [{
            "id": 880,
            "name": "全部"
          },
          {
            "id": 881,
            "name": "东昌区"
          },
          {
            "id": 882,
            "name": "梅河口市"
          },
          {
            "id": 887,
            "name": "二道江区"
          },
          {
            "id": 891,
            "name": "通化县"
          },
          {
            "id": 892,
            "name": "柳河县"
          },
          {
            "id": 893,
            "name": "集安市"
          },
          {
            "id": 894,
            "name": "辉南县"
          }]
        },
        "四平": {
          "id": 960,
          "children": [{
            "id": 960,
            "name": "全部"
          },
          {
            "id": 961,
            "name": "铁西区"
          },
          {
            "id": 966,
            "name": "铁东区"
          },
          {
            "id": 969,
            "name": "双辽市"
          },
          {
            "id": 971,
            "name": "公主岭市"
          },
          {
            "id": 977,
            "name": "梨树县"
          },
          {
            "id": 986,
            "name": "伊通满族自治县"
          }]
        },
        "松原": {
          "id": 1113,
          "children": [{
            "id": 1113,
            "name": "全部"
          },
          {
            "id": 1114,
            "name": "扶余市"
          },
          {
            "id": 1115,
            "name": "宁江区"
          },
          {
            "id": 1118,
            "name": "长岭县"
          },
          {
            "id": 1128,
            "name": "前郭县"
          },
          {
            "id": 1130,
            "name": "乾安县"
          }]
        },
        "辽源": {
          "id": 1733,
          "children": [{
            "id": 1733,
            "name": "全部"
          },
          {
            "id": 1734,
            "name": "龙山区"
          },
          {
            "id": 1735,
            "name": "西安区"
          },
          {
            "id": 1739,
            "name": "东辽县"
          },
          {
            "id": 1747,
            "name": "东丰县"
          }]
        },
        "吉林": {
          "id": 2133,
          "children": [{
            "id": 2133,
            "name": "全部"
          },
          {
            "id": 2134,
            "name": "昌邑区"
          },
          {
            "id": 2141,
            "name": "龙潭区"
          },
          {
            "id": 2142,
            "name": "蛟河市"
          },
          {
            "id": 2144,
            "name": "磐石市"
          },
          {
            "id": 2145,
            "name": "丰满区"
          },
          {
            "id": 2147,
            "name": "船营区"
          },
          {
            "id": 2149,
            "name": "舒兰市"
          },
          {
            "id": 2151,
            "name": "永吉县"
          },
          {
            "id": 2155,
            "name": "桦甸市"
          }]
        },
        "长春": {
          "id": 2856,
          "children": [{
            "id": 2856,
            "name": "全部"
          },
          {
            "id": 2857,
            "name": "南关区"
          },
          {
            "id": 2863,
            "name": "绿园区"
          },
          {
            "id": 2867,
            "name": "二道区"
          },
          {
            "id": 2869,
            "name": "朝阳区"
          },
          {
            "id": 2870,
            "name": "宽城区"
          },
          {
            "id": 2875,
            "name": "汽车开发区"
          },
          {
            "id": 2882,
            "name": "经济开发区"
          },
          {
            "id": 2883,
            "name": "高新区"
          },
          {
            "id": 2884,
            "name": "净月开发区"
          },
          {
            "id": 2886,
            "name": "近郊"
          },
          {
            "id": 2890,
            "name": "德惠市"
          },
          {
            "id": 2891,
            "name": "九台区"
          },
          {
            "id": 2892,
            "name": "双阳区"
          },
          {
            "id": 2895,
            "name": "高新开发区"
          },
          {
            "id": 2899,
            "name": "汽车产业开发区"
          },
          {
            "id": 2900,
            "name": "榆树市"
          },
          {
            "id": 2921,
            "name": "农安县"
          }]
        },
        "白山": {
          "id": 2976,
          "children": [{
            "id": 2976,
            "name": "全部"
          },
          {
            "id": 2977,
            "name": "靖宇县"
          },
          {
            "id": 2978,
            "name": "临江市"
          },
          {
            "id": 2980,
            "name": "长白县"
          },
          {
            "id": 2981,
            "name": "抚松县"
          },
          {
            "id": 3004,
            "name": "江源区"
          },
          {
            "id": 3015,
            "name": "八道江区"
          }]
        }
      }
    },
    "宁夏回族自治区": {
      "id": 122,
      "children": {
        "全部": {
          "id": 122,
          "children": [{
            "id": 122,
            "name": "全部"
          }]
        },
        "中卫": {
          "id": 123,
          "children": [{
            "id": 123,
            "name": "全部"
          },
          {
            "id": 124,
            "name": "中宁县"
          },
          {
            "id": 125,
            "name": "海原县"
          },
          {
            "id": 129,
            "name": "沙坡头区"
          }]
        },
        "银川": {
          "id": 425,
          "children": [{
            "id": 425,
            "name": "全部"
          },
          {
            "id": 426,
            "name": "西夏区"
          },
          {
            "id": 428,
            "name": "金凤区"
          },
          {
            "id": 430,
            "name": "永宁县"
          },
          {
            "id": 431,
            "name": "灵武市"
          },
          {
            "id": 434,
            "name": "兴庆区"
          },
          {
            "id": 436,
            "name": "贺兰县"
          }]
        },
        "吴忠": {
          "id": 712,
          "children": [{
            "id": 712,
            "name": "全部"
          },
          {
            "id": 713,
            "name": "盐池县"
          },
          {
            "id": 716,
            "name": "红寺堡区"
          },
          {
            "id": 717,
            "name": "同心县"
          },
          {
            "id": 718,
            "name": "青铜峡市"
          },
          {
            "id": 721,
            "name": "利通区"
          }]
        },
        "石嘴山": {
          "id": 972,
          "children": [{
            "id": 972,
            "name": "全部"
          },
          {
            "id": 973,
            "name": "平罗县"
          },
          {
            "id": 976,
            "name": "大武口区"
          },
          {
            "id": 984,
            "name": "惠农区"
          }]
        },
        "固原": {
          "id": 2464,
          "children": [{
            "id": 2464,
            "name": "全部"
          },
          {
            "id": 2465,
            "name": "隆德县"
          },
          {
            "id": 2466,
            "name": "西吉县"
          },
          {
            "id": 2468,
            "name": "泾源县"
          },
          {
            "id": 2471,
            "name": "彭阳县"
          },
          {
            "id": 2474,
            "name": "原州区"
          }]
        }
      }
    },
    "甘肃省": {
      "id": 126,
      "children": {
        "全部": {
          "id": 126,
          "children": [{
            "id": 126,
            "name": "全部"
          }]
        },
        "张掖": {
          "id": 127,
          "children": [{
            "id": 127,
            "name": "全部"
          },
          {
            "id": 128,
            "name": "民乐县"
          },
          {
            "id": 130,
            "name": "高台县"
          },
          {
            "id": 131,
            "name": "临泽县"
          },
          {
            "id": 132,
            "name": "山丹县"
          },
          {
            "id": 133,
            "name": "肃南县"
          },
          {
            "id": 143,
            "name": "甘州区"
          }]
        },
        "武威": {
          "id": 719,
          "children": [{
            "id": 719,
            "name": "全部"
          },
          {
            "id": 720,
            "name": "民勤县"
          },
          {
            "id": 723,
            "name": "凉州区"
          },
          {
            "id": 735,
            "name": "天祝藏族自治县"
          },
          {
            "id": 741,
            "name": "古浪县"
          }]
        },
        "天水": {
          "id": 895,
          "children": [{
            "id": 895,
            "name": "全部"
          },
          {
            "id": 896,
            "name": "秦安县"
          },
          {
            "id": 898,
            "name": "甘谷县"
          },
          {
            "id": 899,
            "name": "秦州区"
          },
          {
            "id": 900,
            "name": "张家川县"
          },
          {
            "id": 901,
            "name": "武山县"
          },
          {
            "id": 904,
            "name": "清水县"
          },
          {
            "id": 913,
            "name": "麦积区"
          }]
        },
        "庆阳": {
          "id": 1321,
          "children": [{
            "id": 1321,
            "name": "全部"
          },
          {
            "id": 1322,
            "name": "西峰区"
          },
          {
            "id": 1326,
            "name": "环县"
          },
          {
            "id": 1328,
            "name": "庆城县"
          },
          {
            "id": 1331,
            "name": "华池县"
          },
          {
            "id": 1342,
            "name": "合水县"
          },
          {
            "id": 1343,
            "name": "镇原县"
          },
          {
            "id": 1349,
            "name": "宁县"
          },
          {
            "id": 1352,
            "name": "正宁县"
          }]
        },
        "平凉": {
          "id": 1411,
          "children": [{
            "id": 1411,
            "name": "全部"
          },
          {
            "id": 1412,
            "name": "灵台县"
          },
          {
            "id": 1413,
            "name": "泾川县"
          },
          {
            "id": 1416,
            "name": "崇信县"
          },
          {
            "id": 1417,
            "name": "崆峒区"
          },
          {
            "id": 1419,
            "name": "庄浪县"
          },
          {
            "id": 1420,
            "name": "静宁县"
          },
          {
            "id": 1423,
            "name": "华亭县"
          }]
        },
        "陇南": {
          "id": 1645,
          "children": [{
            "id": 1645,
            "name": "全部"
          },
          {
            "id": 1646,
            "name": "宕昌县"
          },
          {
            "id": 1647,
            "name": "康县"
          },
          {
            "id": 1649,
            "name": "成县"
          },
          {
            "id": 1650,
            "name": "文县"
          },
          {
            "id": 1651,
            "name": "礼县"
          },
          {
            "id": 1652,
            "name": "西和县"
          },
          {
            "id": 1653,
            "name": "两当县"
          },
          {
            "id": 1656,
            "name": "徽县"
          },
          {
            "id": 1667,
            "name": "武都区"
          }]
        },
        "兰州": {
          "id": 1862,
          "children": [{
            "id": 1862,
            "name": "全部"
          },
          {
            "id": 1863,
            "name": "七里河区"
          },
          {
            "id": 1864,
            "name": "榆中县"
          },
          {
            "id": 1865,
            "name": "西固区"
          },
          {
            "id": 1867,
            "name": "红古区"
          },
          {
            "id": 1868,
            "name": "永登县"
          },
          {
            "id": 1869,
            "name": "安宁区"
          },
          {
            "id": 1878,
            "name": "皋兰县"
          },
          {
            "id": 1879,
            "name": "城关区"
          }]
        },
        "金昌": {
          "id": 1958,
          "children": [{
            "id": 1958,
            "name": "全部"
          },
          {
            "id": 1959,
            "name": "永昌县"
          },
          {
            "id": 1960,
            "name": "金川区"
          }]
        },
        "嘉峪关": {
          "id": 1962,
          "children": [{
            "id": 1962,
            "name": "全部"
          },
          {
            "id": 1963,
            "name": "镜铁区"
          },
          {
            "id": 1965,
            "name": "长城区"
          },
          {
            "id": 1966,
            "name": "雄关区"
          }]
        },
        "酒泉": {
          "id": 1967,
          "children": [{
            "id": 1967,
            "name": "全部"
          },
          {
            "id": 1968,
            "name": "玉门市"
          },
          {
            "id": 1972,
            "name": "金塔县"
          },
          {
            "id": 1975,
            "name": "阿克塞县"
          },
          {
            "id": 1976,
            "name": "肃北县"
          },
          {
            "id": 1977,
            "name": "敦煌市"
          },
          {
            "id": 1978,
            "name": "瓜州县"
          },
          {
            "id": 1979,
            "name": "肃州区"
          }]
        },
        "甘南": {
          "id": 2437,
          "children": [{
            "id": 2437,
            "name": "全部"
          },
          {
            "id": 2438,
            "name": "合作市"
          },
          {
            "id": 2439,
            "name": "舟曲县"
          },
          {
            "id": 2445,
            "name": "玛曲县"
          },
          {
            "id": 2446,
            "name": "卓尼县"
          },
          {
            "id": 2449,
            "name": "碌曲县"
          },
          {
            "id": 2450,
            "name": "夏河县"
          },
          {
            "id": 2453,
            "name": "迭部县"
          }]
        },
        "定西": {
          "id": 2663,
          "children": [{
            "id": 2663,
            "name": "全部"
          },
          {
            "id": 2664,
            "name": "临洮县"
          },
          {
            "id": 2665,
            "name": "通渭县"
          },
          {
            "id": 2666,
            "name": "漳县"
          },
          {
            "id": 2670,
            "name": "安定区"
          },
          {
            "id": 2671,
            "name": "岷县"
          },
          {
            "id": 2675,
            "name": "陇西县"
          },
          {
            "id": 2677,
            "name": "渭源县"
          }]
        }
      }
    },
    "湖南省": {
      "id": 134,
      "children": {
        "全部": {
          "id": 134,
          "children": [{
            "id": 134,
            "name": "全部"
          }]
        },
        "张家界": {
          "id": 135,
          "children": [{
            "id": 135,
            "name": "全部"
          },
          {
            "id": 136,
            "name": "桑植县"
          },
          {
            "id": 137,
            "name": "慈利县"
          },
          {
            "id": 138,
            "name": "永定区"
          },
          {
            "id": 139,
            "name": "武陵源区"
          }]
        },
        "株洲": {
          "id": 211,
          "children": [{
            "id": 211,
            "name": "全部"
          },
          {
            "id": 212,
            "name": "荷塘区"
          },
          {
            "id": 215,
            "name": "天元区"
          },
          {
            "id": 216,
            "name": "芦淞区"
          },
          {
            "id": 217,
            "name": "株洲县"
          },
          {
            "id": 221,
            "name": "石峰区"
          },
          {
            "id": 222,
            "name": "醴陵市"
          },
          {
            "id": 228,
            "name": "茶陵县"
          },
          {
            "id": 231,
            "name": "攸县"
          },
          {
            "id": 232,
            "name": "炎陵县"
          }]
        },
        "永州": {
          "id": 351,
          "children": [{
            "id": 351,
            "name": "全部"
          },
          {
            "id": 352,
            "name": "东安县"
          },
          {
            "id": 353,
            "name": "道县"
          },
          {
            "id": 354,
            "name": "宁远县"
          },
          {
            "id": 355,
            "name": "江永县"
          },
          {
            "id": 356,
            "name": "蓝山县"
          },
          {
            "id": 357,
            "name": "新田县"
          },
          {
            "id": 358,
            "name": "双牌县"
          },
          {
            "id": 359,
            "name": "冷水滩区"
          },
          {
            "id": 360,
            "name": "祁阳县"
          },
          {
            "id": 361,
            "name": "江华瑶族自治县"
          },
          {
            "id": 362,
            "name": "零陵区"
          }]
        },
        "益阳": {
          "id": 380,
          "children": [{
            "id": 380,
            "name": "全部"
          },
          {
            "id": 381,
            "name": "赫山区"
          },
          {
            "id": 382,
            "name": "资阳区"
          },
          {
            "id": 385,
            "name": "南县"
          },
          {
            "id": 387,
            "name": "桃江县"
          },
          {
            "id": 388,
            "name": "沅江市"
          },
          {
            "id": 393,
            "name": "安化县"
          }]
        },
        "岳阳": {
          "id": 439,
          "children": [{
            "id": 439,
            "name": "全部"
          },
          {
            "id": 440,
            "name": "岳阳楼区"
          },
          {
            "id": 447,
            "name": "君山区"
          },
          {
            "id": 448,
            "name": "云溪区"
          },
          {
            "id": 449,
            "name": "临湘市"
          },
          {
            "id": 461,
            "name": "汨罗市"
          },
          {
            "id": 465,
            "name": "岳阳县"
          },
          {
            "id": 468,
            "name": "湘阴县"
          },
          {
            "id": 471,
            "name": "平江县"
          },
          {
            "id": 476,
            "name": "华容县"
          }]
        },
        "湘西": {
          "id": 509,
          "children": [{
            "id": 509,
            "name": "全部"
          },
          {
            "id": 510,
            "name": "吉首市"
          },
          {
            "id": 511,
            "name": "泸溪县"
          },
          {
            "id": 512,
            "name": "凤凰县"
          },
          {
            "id": 513,
            "name": "花垣县"
          },
          {
            "id": 514,
            "name": "保靖县"
          },
          {
            "id": 516,
            "name": "永顺县"
          },
          {
            "id": 517,
            "name": "古丈县"
          },
          {
            "id": 518,
            "name": "龙山县"
          }]
        },
        "湘潭": {
          "id": 614,
          "children": [{
            "id": 614,
            "name": "全部"
          },
          {
            "id": 615,
            "name": "岳塘区"
          },
          {
            "id": 620,
            "name": "湘乡市"
          },
          {
            "id": 622,
            "name": "韶山市"
          },
          {
            "id": 623,
            "name": "湘潭县"
          },
          {
            "id": 624,
            "name": "雨湖区"
          }]
        },
        "邵阳": {
          "id": 1072,
          "children": [{
            "id": 1072,
            "name": "全部"
          },
          {
            "id": 1073,
            "name": "双清区"
          },
          {
            "id": 1086,
            "name": "大祥区"
          },
          {
            "id": 1088,
            "name": "北塔区"
          },
          {
            "id": 1093,
            "name": "邵东县"
          },
          {
            "id": 1099,
            "name": "隆回县"
          },
          {
            "id": 1101,
            "name": "邵阳县"
          },
          {
            "id": 1103,
            "name": "洞口县"
          },
          {
            "id": 1104,
            "name": "新邵县"
          },
          {
            "id": 1106,
            "name": "武冈市"
          },
          {
            "id": 1109,
            "name": "绥宁县"
          },
          {
            "id": 1116,
            "name": "城步苗族自治县"
          },
          {
            "id": 1121,
            "name": "新宁县"
          }]
        },
        "娄底": {
          "id": 1708,
          "children": [{
            "id": 1708,
            "name": "全部"
          },
          {
            "id": 1709,
            "name": "娄星区"
          },
          {
            "id": 1710,
            "name": "冷水江市"
          },
          {
            "id": 1712,
            "name": "涟源市"
          },
          {
            "id": 1713,
            "name": "双峰县"
          },
          {
            "id": 1715,
            "name": "新化县"
          }]
        },
        "怀化": {
          "id": 2270,
          "children": [{
            "id": 2270,
            "name": "全部"
          },
          {
            "id": 2271,
            "name": "洪江市"
          },
          {
            "id": 2272,
            "name": "沅陵县"
          },
          {
            "id": 2276,
            "name": "鹤城区"
          },
          {
            "id": 2278,
            "name": "辰溪县"
          },
          {
            "id": 2281,
            "name": "溆浦县"
          },
          {
            "id": 2285,
            "name": "会同县"
          },
          {
            "id": 2286,
            "name": "新晃侗族自治县"
          },
          {
            "id": 2287,
            "name": "麻阳苗族自治县"
          },
          {
            "id": 2288,
            "name": "芷江侗族自治县"
          },
          {
            "id": 2289,
            "name": "中方县"
          },
          {
            "id": 2290,
            "name": "通道侗族自治县"
          },
          {
            "id": 2291,
            "name": "靖州县"
          }]
        },
        "衡阳": {
          "id": 2332,
          "children": [{
            "id": 2332,
            "name": "全部"
          },
          {
            "id": 2333,
            "name": "石鼓区"
          },
          {
            "id": 2341,
            "name": "蒸湘区"
          },
          {
            "id": 2344,
            "name": "珠晖区"
          },
          {
            "id": 2345,
            "name": "雁峰区"
          },
          {
            "id": 2348,
            "name": "华新开发区"
          },
          {
            "id": 2349,
            "name": "南岳区"
          },
          {
            "id": 2355,
            "name": "衡阳县"
          },
          {
            "id": 2358,
            "name": "常宁市"
          },
          {
            "id": 2361,
            "name": "耒阳市"
          },
          {
            "id": 2362,
            "name": "衡南县"
          },
          {
            "id": 2366,
            "name": "衡山县"
          },
          {
            "id": 2368,
            "name": "祁东县"
          },
          {
            "id": 2373,
            "name": "衡东县"
          }]
        },
        "常德": {
          "id": 2811,
          "children": [{
            "id": 2811,
            "name": "全部"
          },
          {
            "id": 2812,
            "name": "鼎城区"
          },
          {
            "id": 2814,
            "name": "津市市"
          },
          {
            "id": 2815,
            "name": "安乡县"
          },
          {
            "id": 2817,
            "name": "汉寿县"
          },
          {
            "id": 2822,
            "name": "澧县"
          },
          {
            "id": 2823,
            "name": "临澧县"
          },
          {
            "id": 2824,
            "name": "石门县"
          },
          {
            "id": 2825,
            "name": "桃源县"
          },
          {
            "id": 2826,
            "name": "武陵区"
          }]
        },
        "长沙": {
          "id": 2897,
          "children": [{
            "id": 2897,
            "name": "全部"
          },
          {
            "id": 2898,
            "name": "芙蓉区"
          },
          {
            "id": 2902,
            "name": "雨花区"
          },
          {
            "id": 2903,
            "name": "天心区"
          },
          {
            "id": 2904,
            "name": "开福区"
          },
          {
            "id": 2907,
            "name": "望城区"
          },
          {
            "id": 2908,
            "name": "近郊"
          },
          {
            "id": 2909,
            "name": "宁乡县"
          },
          {
            "id": 2910,
            "name": "长沙县"
          },
          {
            "id": 2911,
            "name": "岳麓区"
          },
          {
            "id": 2917,
            "name": "浏阳市"
          }]
        },
        "郴州": {
          "id": 3075,
          "children": [{
            "id": 3075,
            "name": "全部"
          },
          {
            "id": 3076,
            "name": "苏仙区"
          },
          {
            "id": 3078,
            "name": "资兴市"
          },
          {
            "id": 3079,
            "name": "嘉禾县"
          },
          {
            "id": 3080,
            "name": "临武县"
          },
          {
            "id": 3082,
            "name": "汝城县"
          },
          {
            "id": 3083,
            "name": "桂东县"
          },
          {
            "id": 3084,
            "name": "北湖区"
          },
          {
            "id": 3085,
            "name": "安仁县"
          },
          {
            "id": 3086,
            "name": "桂阳县"
          },
          {
            "id": 3089,
            "name": "永兴县"
          },
          {
            "id": 3090,
            "name": "宜章县"
          }]
        }
      }
    },
    "云南省": {
      "id": 140,
      "children": {
        "全部": {
          "id": 140,
          "children": [{
            "id": 140,
            "name": "全部"
          }]
        },
        "昭通": {
          "id": 141,
          "children": [{
            "id": 141,
            "name": "全部"
          },
          {
            "id": 142,
            "name": "鲁甸县"
          },
          {
            "id": 144,
            "name": "昭阳区"
          },
          {
            "id": 145,
            "name": "永善县"
          },
          {
            "id": 146,
            "name": "巧家县"
          },
          {
            "id": 147,
            "name": "大关县"
          },
          {
            "id": 148,
            "name": "绥江县"
          },
          {
            "id": 149,
            "name": "镇雄县"
          },
          {
            "id": 150,
            "name": "彝良县"
          },
          {
            "id": 151,
            "name": "威信县"
          },
          {
            "id": 152,
            "name": "盐津县"
          },
          {
            "id": 153,
            "name": "水富县"
          }]
        },
        "玉溪": {
          "id": 303,
          "children": [{
            "id": 303,
            "name": "全部"
          },
          {
            "id": 304,
            "name": "江川县"
          },
          {
            "id": 305,
            "name": "华宁县"
          },
          {
            "id": 306,
            "name": "澄江县"
          },
          {
            "id": 307,
            "name": "峨山彝族自治县"
          },
          {
            "id": 308,
            "name": "通海县"
          },
          {
            "id": 309,
            "name": "易门县"
          },
          {
            "id": 310,
            "name": "元江县"
          },
          {
            "id": 311,
            "name": "新平县"
          },
          {
            "id": 323,
            "name": "红塔区"
          }]
        },
        "西双版纳": {
          "id": 535,
          "children": [{
            "id": 535,
            "name": "全部"
          },
          {
            "id": 536,
            "name": "勐海县"
          },
          {
            "id": 537,
            "name": "勐腊县"
          },
          {
            "id": 558,
            "name": "景洪市"
          }]
        },
        "曲靖": {
          "id": 1357,
          "children": [{
            "id": 1357,
            "name": "全部"
          },
          {
            "id": 1358,
            "name": "沾益县"
          },
          {
            "id": 1360,
            "name": "富源县"
          },
          {
            "id": 1361,
            "name": "师宗县"
          },
          {
            "id": 1362,
            "name": "马龙县"
          },
          {
            "id": 1363,
            "name": "宣威市"
          },
          {
            "id": 1364,
            "name": "陆良县"
          },
          {
            "id": 1365,
            "name": "会泽县"
          },
          {
            "id": 1370,
            "name": "罗平县"
          },
          {
            "id": 1377,
            "name": "麒麟区"
          }]
        },
        "怒江": {
          "id": 1425,
          "children": [{
            "id": 1425,
            "name": "全部"
          },
          {
            "id": 1426,
            "name": "泸水县"
          },
          {
            "id": 1429,
            "name": "福贡县"
          },
          {
            "id": 1430,
            "name": "贡山县"
          },
          {
            "id": 1431,
            "name": "兰坪县"
          }]
        },
        "普洱": {
          "id": 1441,
          "children": [{
            "id": 1441,
            "name": "全部"
          },
          {
            "id": 1442,
            "name": "宁洱县"
          },
          {
            "id": 1445,
            "name": "景东彝族自治县"
          },
          {
            "id": 1448,
            "name": "墨江哈尼族自治县"
          },
          {
            "id": 1449,
            "name": "景谷县"
          },
          {
            "id": 1450,
            "name": "江城县"
          },
          {
            "id": 1451,
            "name": "孟连县"
          },
          {
            "id": 1452,
            "name": "澜沧县"
          },
          {
            "id": 1453,
            "name": "西盟佤族自治县"
          },
          {
            "id": 1456,
            "name": "镇沅县"
          },
          {
            "id": 1481,
            "name": "思茅区"
          }]
        },
        "临沧": {
          "id": 1681,
          "children": [{
            "id": 1681,
            "name": "全部"
          },
          {
            "id": 1682,
            "name": "云县"
          },
          {
            "id": 1683,
            "name": "凤庆县"
          },
          {
            "id": 1684,
            "name": "永德县"
          },
          {
            "id": 1685,
            "name": "双江县"
          },
          {
            "id": 1687,
            "name": "镇康县"
          },
          {
            "id": 1688,
            "name": "耿马县"
          },
          {
            "id": 1689,
            "name": "沧源佤族自治县"
          },
          {
            "id": 1697,
            "name": "临翔区"
          }]
        },
        "丽江": {
          "id": 1722,
          "children": [{
            "id": 1722,
            "name": "全部"
          },
          {
            "id": 1723,
            "name": "永胜县"
          },
          {
            "id": 1724,
            "name": "华坪县"
          },
          {
            "id": 1729,
            "name": "宁蒗彝族自治县"
          },
          {
            "id": 1732,
            "name": "玉龙县"
          },
          {
            "id": 1742,
            "name": "古城区"
          }]
        },
        "昆明": {
          "id": 1941,
          "children": [{
            "id": 1941,
            "name": "全部"
          },
          {
            "id": 1942,
            "name": "五华区"
          },
          {
            "id": 1945,
            "name": "西山区"
          },
          {
            "id": 1946,
            "name": "寻甸回族彝族自治县"
          },
          {
            "id": 1947,
            "name": "盘龙区"
          },
          {
            "id": 1948,
            "name": "官渡区"
          },
          {
            "id": 1949,
            "name": "呈贡区"
          },
          {
            "id": 1951,
            "name": "晋宁区"
          },
          {
            "id": 1952,
            "name": "东川区"
          },
          {
            "id": 1953,
            "name": "富民县"
          },
          {
            "id": 1954,
            "name": "近郊"
          },
          {
            "id": 1955,
            "name": "嵩明县"
          },
          {
            "id": 1956,
            "name": "禄劝彝族苗族自治县"
          },
          {
            "id": 1957,
            "name": "石林彝族自治县"
          },
          {
            "id": 1961,
            "name": "宜良县"
          },
          {
            "id": 1964,
            "name": "安宁市"
          }]
        },
        "德宏": {
          "id": 2637,
          "children": [{
            "id": 2637,
            "name": "全部"
          },
          {
            "id": 2638,
            "name": "梁河县"
          },
          {
            "id": 2639,
            "name": "陇川县"
          },
          {
            "id": 2640,
            "name": "盈江县"
          },
          {
            "id": 2641,
            "name": "芒市"
          },
          {
            "id": 2642,
            "name": "瑞丽市"
          }]
        },
        "迪庆": {
          "id": 2643,
          "children": [{
            "id": 2643,
            "name": "全部"
          },
          {
            "id": 2644,
            "name": "维西县"
          },
          {
            "id": 2645,
            "name": "德钦县"
          },
          {
            "id": 2650,
            "name": "香格里拉市"
          }]
        },
        "保山": {
          "id": 2982,
          "children": [{
            "id": 2982,
            "name": "全部"
          },
          {
            "id": 2983,
            "name": "腾冲县"
          },
          {
            "id": 2984,
            "name": "施甸县"
          },
          {
            "id": 2985,
            "name": "龙陵县"
          },
          {
            "id": 2989,
            "name": "隆阳区"
          },
          {
            "id": 3002,
            "name": "昌宁县"
          }]
        },
        "红河": {
          "id": 3118,
          "children": [{
            "id": 3118,
            "name": "全部"
          },
          {
            "id": 3119,
            "name": "石屏县"
          },
          {
            "id": 3120,
            "name": "开远市"
          },
          {
            "id": 3121,
            "name": "绿春县"
          },
          {
            "id": 3122,
            "name": "元阳县"
          },
          {
            "id": 3123,
            "name": "建水县"
          },
          {
            "id": 3124,
            "name": "个旧市"
          },
          {
            "id": 3125,
            "name": "泸西县"
          },
          {
            "id": 3126,
            "name": "蒙自市"
          },
          {
            "id": 3127,
            "name": "河口瑶族自治县"
          },
          {
            "id": 3128,
            "name": "屏边苗族自治县"
          },
          {
            "id": 3129,
            "name": "弥勒市"
          },
          {
            "id": 3130,
            "name": "红河县"
          }]
        }
      }
    },
    "贵州省": {
      "id": 154,
      "children": {
        "全部": {
          "id": 154,
          "children": [{
            "id": 154,
            "name": "全部"
          }]
        },
        "遵义": {
          "id": 155,
          "children": [{
            "id": 155,
            "name": "全部"
          },
          {
            "id": 156,
            "name": "红花岗区"
          },
          {
            "id": 157,
            "name": "赤水市"
          },
          {
            "id": 158,
            "name": "仁怀市"
          },
          {
            "id": 159,
            "name": "汇川区"
          },
          {
            "id": 160,
            "name": "播州区"
          },
          {
            "id": 161,
            "name": "绥阳县"
          },
          {
            "id": 162,
            "name": "桐梓县"
          },
          {
            "id": 167,
            "name": "正安县"
          },
          {
            "id": 169,
            "name": "凤冈县"
          },
          {
            "id": 173,
            "name": "习水县"
          },
          {
            "id": 174,
            "name": "余庆县"
          },
          {
            "id": 177,
            "name": "湄潭县"
          },
          {
            "id": 178,
            "name": "务川县"
          },
          {
            "id": 179,
            "name": "道真县"
          }]
        },
        "黔南": {
          "id": 1235,
          "children": [{
            "id": 1235,
            "name": "全部"
          },
          {
            "id": 1236,
            "name": "都匀市"
          },
          {
            "id": 1238,
            "name": "荔波县"
          },
          {
            "id": 1239,
            "name": "贵定县"
          },
          {
            "id": 1241,
            "name": "瓮安县"
          },
          {
            "id": 1242,
            "name": "福泉市"
          },
          {
            "id": 1243,
            "name": "独山县"
          },
          {
            "id": 1244,
            "name": "平塘县"
          },
          {
            "id": 1245,
            "name": "罗甸县"
          },
          {
            "id": 1246,
            "name": "长顺县"
          },
          {
            "id": 1249,
            "name": "三都水族自治县"
          },
          {
            "id": 1260,
            "name": "龙里县"
          },
          {
            "id": 1261,
            "name": "惠水县"
          }]
        },
        "黔西南": {
          "id": 1250,
          "children": [{
            "id": 1250,
            "name": "全部"
          },
          {
            "id": 1251,
            "name": "普安县"
          },
          {
            "id": 1252,
            "name": "兴仁县"
          },
          {
            "id": 1254,
            "name": "晴隆县"
          },
          {
            "id": 1256,
            "name": "兴义市"
          },
          {
            "id": 1263,
            "name": "望谟县"
          },
          {
            "id": 1267,
            "name": "册亨县"
          },
          {
            "id": 1269,
            "name": "贞丰县"
          },
          {
            "id": 1270,
            "name": "安龙县"
          }]
        },
        "黔东南": {
          "id": 1274,
          "children": [{
            "id": 1274,
            "name": "全部"
          },
          {
            "id": 1275,
            "name": "黄平县"
          },
          {
            "id": 1276,
            "name": "三穗县"
          },
          {
            "id": 1278,
            "name": "施秉县"
          },
          {
            "id": 1280,
            "name": "天柱县"
          },
          {
            "id": 1281,
            "name": "锦屏县"
          },
          {
            "id": 1282,
            "name": "剑河县"
          },
          {
            "id": 1283,
            "name": "台江县"
          },
          {
            "id": 1284,
            "name": "榕江县"
          },
          {
            "id": 1285,
            "name": "镇远县"
          },
          {
            "id": 1286,
            "name": "从江县"
          },
          {
            "id": 1287,
            "name": "岑巩县"
          },
          {
            "id": 1289,
            "name": "丹寨县"
          },
          {
            "id": 1290,
            "name": "麻江县"
          },
          {
            "id": 1293,
            "name": "雷山县"
          },
          {
            "id": 1294,
            "name": "黎平县"
          },
          {
            "id": 1307,
            "name": "凯里市"
          }]
        },
        "六盘水": {
          "id": 1719,
          "children": [{
            "id": 1719,
            "name": "全部"
          },
          {
            "id": 1720,
            "name": "水城县（滥坝镇）"
          },
          {
            "id": 1721,
            "name": "六枝特区"
          },
          {
            "id": 1725,
            "name": "盘州市"
          },
          {
            "id": 1731,
            "name": "钟山区"
          }]
        },
        "贵阳": {
          "id": 2503,
          "children": [{
            "id": 2503,
            "name": "全部"
          },
          {
            "id": 2504,
            "name": "乌当区"
          },
          {
            "id": 2505,
            "name": "白云区"
          },
          {
            "id": 2507,
            "name": "近郊"
          },
          {
            "id": 2508,
            "name": "南明区"
          },
          {
            "id": 2509,
            "name": "云岩区"
          },
          {
            "id": 2510,
            "name": "修文县"
          },
          {
            "id": 2511,
            "name": "息烽县"
          },
          {
            "id": 2514,
            "name": "花溪区"
          },
          {
            "id": 2515,
            "name": "清镇市"
          },
          {
            "id": 2518,
            "name": "开阳县"
          },
          {
            "id": 2521,
            "name": "金阳新区"
          },
          {
            "id": 2527,
            "name": "观山湖区"
          }]
        },
        "安顺": {
          "id": 3036,
          "children": [{
            "id": 3036,
            "name": "全部"
          },
          {
            "id": 3037,
            "name": "关岭县"
          },
          {
            "id": 3038,
            "name": "紫云县"
          },
          {
            "id": 3040,
            "name": "镇宁县"
          },
          {
            "id": 3044,
            "name": "西秀区"
          },
          {
            "id": 3046,
            "name": "普定县"
          },
          {
            "id": 3047,
            "name": "平坝区"
          }]
        }
      }
    },
    "广东省": {
      "id": 163,
      "children": {
        "全部": {
          "id": 163,
          "children": [{
            "id": 163,
            "name": "全部"
          }]
        },
        "肇庆": {
          "id": 164,
          "children": [{
            "id": 164,
            "name": "全部"
          },
          {
            "id": 165,
            "name": "端州区"
          },
          {
            "id": 166,
            "name": "高要区"
          },
          {
            "id": 168,
            "name": "鼎湖区"
          },
          {
            "id": 170,
            "name": "封开县"
          },
          {
            "id": 171,
            "name": "广宁县"
          },
          {
            "id": 172,
            "name": "四会市"
          },
          {
            "id": 175,
            "name": "德庆县"
          },
          {
            "id": 176,
            "name": "怀集县"
          }]
        },
        "珠海": {
          "id": 208,
          "children": [{
            "id": 208,
            "name": "全部"
          },
          {
            "id": 209,
            "name": "横琴新区"
          },
          {
            "id": 210,
            "name": "金湾区"
          },
          {
            "id": 213,
            "name": "斗门区"
          },
          {
            "id": 214,
            "name": "香洲区"
          }]
        },
        "湛江": {
          "id": 247,
          "children": [{
            "id": 247,
            "name": "全部"
          },
          {
            "id": 248,
            "name": "吴川市"
          },
          {
            "id": 249,
            "name": "雷州市"
          },
          {
            "id": 250,
            "name": "坡头区"
          },
          {
            "id": 251,
            "name": "廉江市"
          },
          {
            "id": 252,
            "name": "遂溪县"
          },
          {
            "id": 253,
            "name": "赤坎区"
          },
          {
            "id": 254,
            "name": "徐闻县"
          },
          {
            "id": 255,
            "name": "麻章区"
          },
          {
            "id": 264,
            "name": "霞山区"
          }]
        },
        "云浮": {
          "id": 346,
          "children": [{
            "id": 346,
            "name": "全部"
          },
          {
            "id": 347,
            "name": "郁南县"
          },
          {
            "id": 348,
            "name": "新兴县"
          },
          {
            "id": 349,
            "name": "云安区"
          },
          {
            "id": 350,
            "name": "罗定市"
          },
          {
            "id": 371,
            "name": "云城区"
          }]
        },
        "阳江": {
          "id": 395,
          "children": [{
            "id": 395,
            "name": "全部"
          },
          {
            "id": 396,
            "name": "阳春市"
          },
          {
            "id": 397,
            "name": "海陵岛\/闸坡"
          },
          {
            "id": 400,
            "name": "江城区"
          },
          {
            "id": 405,
            "name": "阳西县"
          },
          {
            "id": 406,
            "name": "阳东区"
          }]
        },
        "汕尾": {
          "id": 988,
          "children": [{
            "id": 988,
            "name": "全部"
          },
          {
            "id": 989,
            "name": "城区"
          },
          {
            "id": 993,
            "name": "陆丰市"
          },
          {
            "id": 994,
            "name": "陆河县"
          },
          {
            "id": 998,
            "name": "海丰县"
          }]
        },
        "韶关": {
          "id": 1083,
          "children": [{
            "id": 1083,
            "name": "全部"
          },
          {
            "id": 1084,
            "name": "浈江区"
          },
          {
            "id": 1090,
            "name": "曲江区"
          },
          {
            "id": 1095,
            "name": "武江区"
          },
          {
            "id": 1097,
            "name": "南雄市"
          },
          {
            "id": 1098,
            "name": "翁源县"
          },
          {
            "id": 1102,
            "name": "始兴县"
          },
          {
            "id": 1108,
            "name": "乐昌市"
          },
          {
            "id": 1111,
            "name": "新丰县"
          },
          {
            "id": 1112,
            "name": "乳源瑶族自治县"
          },
          {
            "id": 1117,
            "name": "仁化县"
          }]
        },
        "汕头": {
          "id": 1125,
          "children": [{
            "id": 1125,
            "name": "全部"
          },
          {
            "id": 1126,
            "name": "濠江区"
          },
          {
            "id": 1129,
            "name": "金平区"
          },
          {
            "id": 1131,
            "name": "潮南区"
          },
          {
            "id": 1132,
            "name": "潮阳区"
          },
          {
            "id": 1138,
            "name": "南澳县"
          },
          {
            "id": 1139,
            "name": "龙湖区"
          },
          {
            "id": 1140,
            "name": "澄海区"
          }]
        },
        "深圳": {
          "id": 1181,
          "children": [{
            "id": 1181,
            "name": "全部"
          },
          {
            "id": 1182,
            "name": "福田区"
          },
          {
            "id": 1186,
            "name": "南山区"
          },
          {
            "id": 1191,
            "name": "罗湖区"
          },
          {
            "id": 1194,
            "name": "宝安区"
          },
          {
            "id": 1197,
            "name": "龙岗区"
          },
          {
            "id": 1199,
            "name": "南澳大鹏新区"
          },
          {
            "id": 1202,
            "name": "盐田区"
          },
          {
            "id": 1203,
            "name": "龙华区"
          },
          {
            "id": 1206,
            "name": "坪山区"
          }]
        },
        "清远": {
          "id": 1316,
          "children": [{
            "id": 1316,
            "name": "全部"
          },
          {
            "id": 1317,
            "name": "旧城"
          },
          {
            "id": 1318,
            "name": "新城"
          },
          {
            "id": 1324,
            "name": "清新区"
          },
          {
            "id": 1327,
            "name": "清城区"
          },
          {
            "id": 1330,
            "name": "佛冈县"
          },
          {
            "id": 1332,
            "name": "英德市"
          },
          {
            "id": 1333,
            "name": "连州市"
          },
          {
            "id": 1335,
            "name": "连山县"
          },
          {
            "id": 1336,
            "name": "阳山县"
          },
          {
            "id": 1337,
            "name": "连南瑶族自治县"
          },
          {
            "id": 1350,
            "name": "东城"
          }]
        },
        "茂名": {
          "id": 1594,
          "children": [{
            "id": 1594,
            "name": "全部"
          },
          {
            "id": 1595,
            "name": "茂南区"
          },
          {
            "id": 1596,
            "name": "化州市"
          },
          {
            "id": 1597,
            "name": "信宜市"
          },
          {
            "id": 1599,
            "name": "高州市"
          },
          {
            "id": 1600,
            "name": "电白区"
          }]
        },
        "梅州": {
          "id": 1610,
          "children": [{
            "id": 1610,
            "name": "全部"
          },
          {
            "id": 1611,
            "name": "梅江区"
          },
          {
            "id": 1615,
            "name": "兴宁市"
          },
          {
            "id": 1621,
            "name": "梅县区"
          },
          {
            "id": 1622,
            "name": "大埔县"
          },
          {
            "id": 1631,
            "name": "平远县"
          },
          {
            "id": 1632,
            "name": "丰顺县"
          },
          {
            "id": 1633,
            "name": "蕉岭县"
          },
          {
            "id": 1635,
            "name": "五华县"
          }]
        },
        "揭阳": {
          "id": 2059,
          "children": [{
            "id": 2059,
            "name": "全部"
          },
          {
            "id": 2060,
            "name": "普宁市"
          },
          {
            "id": 2061,
            "name": "经济开发试验区"
          },
          {
            "id": 2062,
            "name": "惠来县"
          },
          {
            "id": 2063,
            "name": "揭东区"
          },
          {
            "id": 2064,
            "name": "揭西县"
          },
          {
            "id": 2069,
            "name": "榕城区"
          }]
        },
        "江门": {
          "id": 2076,
          "children": [{
            "id": 2076,
            "name": "全部"
          },
          {
            "id": 2077,
            "name": "新会区"
          },
          {
            "id": 2079,
            "name": "江海区"
          },
          {
            "id": 2080,
            "name": "蓬江区"
          },
          {
            "id": 2082,
            "name": "台山市"
          },
          {
            "id": 2083,
            "name": "鹤山市"
          },
          {
            "id": 2087,
            "name": "恩平市"
          },
          {
            "id": 2088,
            "name": "开平市"
          }]
        },
        "河源": {
          "id": 2178,
          "children": [{
            "id": 2178,
            "name": "全部"
          },
          {
            "id": 2179,
            "name": "紫金县"
          },
          {
            "id": 2180,
            "name": "连平县"
          },
          {
            "id": 2181,
            "name": "和平县"
          },
          {
            "id": 2183,
            "name": "源城区"
          },
          {
            "id": 2184,
            "name": "东源县"
          },
          {
            "id": 2189,
            "name": "龙川县"
          }]
        },
        "惠州": {
          "id": 2376,
          "children": [{
            "id": 2376,
            "name": "全部"
          },
          {
            "id": 2377,
            "name": "惠东县"
          },
          {
            "id": 2378,
            "name": "龙门县"
          },
          {
            "id": 2379,
            "name": "博罗县"
          },
          {
            "id": 2383,
            "name": "惠城区"
          },
          {
            "id": 2392,
            "name": "惠阳区"
          }]
        },
        "广州": {
          "id": 2519,
          "children": [{
            "id": 2519,
            "name": "全部"
          },
          {
            "id": 2520,
            "name": "越秀区"
          },
          {
            "id": 2524,
            "name": "天河区"
          },
          {
            "id": 2525,
            "name": "海珠区"
          },
          {
            "id": 2529,
            "name": "番禺区"
          },
          {
            "id": 2531,
            "name": "荔湾区"
          },
          {
            "id": 2532,
            "name": "黄埔区"
          },
          {
            "id": 2536,
            "name": "增城市"
          },
          {
            "id": 2540,
            "name": "白云区"
          },
          {
            "id": 2544,
            "name": "近郊"
          },
          {
            "id": 2545,
            "name": "花都区"
          },
          {
            "id": 2546,
            "name": "南沙区"
          },
          {
            "id": 2551,
            "name": "从化市"
          }]
        },
        "佛山": {
          "id": 2589,
          "children": [{
            "id": 2589,
            "name": "全部"
          },
          {
            "id": 2590,
            "name": "顺德区"
          },
          {
            "id": 2593,
            "name": "高明区"
          },
          {
            "id": 2594,
            "name": "三水区"
          },
          {
            "id": 2595,
            "name": "盐步"
          },
          {
            "id": 2596,
            "name": "禅城区"
          },
          {
            "id": 2599,
            "name": "南海区"
          },
          {
            "id": 2600,
            "name": "南庄"
          },
          {
            "id": 2603,
            "name": "黄岐"
          },
          {
            "id": 2606,
            "name": "西樵"
          },
          {
            "id": 2623,
            "name": "大沥"
          }]
        },
        "东莞": {
          "id": 2708,
          "children": [{
            "id": 2708,
            "name": "全部"
          },
          {
            "id": 2709,
            "name": "莞城街道"
          },
          {
            "id": 2710,
            "name": "东城街道"
          },
          {
            "id": 2711,
            "name": "南城街道"
          },
          {
            "id": 2718,
            "name": "万江街道"
          },
          {
            "id": 2719,
            "name": "厚街镇"
          },
          {
            "id": 2721,
            "name": "虎门镇"
          },
          {
            "id": 2723,
            "name": "樟木头镇"
          },
          {
            "id": 2724,
            "name": "长安镇"
          },
          {
            "id": 2725,
            "name": "石龙镇"
          },
          {
            "id": 2726,
            "name": "清溪镇"
          },
          {
            "id": 2727,
            "name": "大岭山镇"
          },
          {
            "id": 2728,
            "name": "常平镇"
          },
          {
            "id": 2729,
            "name": "石碣镇"
          },
          {
            "id": 2730,
            "name": "大朗镇"
          },
          {
            "id": 2731,
            "name": "桥头镇"
          },
          {
            "id": 2732,
            "name": "东坑镇"
          },
          {
            "id": 2733,
            "name": "塘厦镇"
          },
          {
            "id": 2734,
            "name": "黄江镇"
          },
          {
            "id": 2735,
            "name": "寮步镇"
          },
          {
            "id": 2736,
            "name": "麻涌镇"
          },
          {
            "id": 2737,
            "name": "中堂镇"
          },
          {
            "id": 2738,
            "name": "高埗镇"
          },
          {
            "id": 2739,
            "name": "横沥镇"
          },
          {
            "id": 2740,
            "name": "企石镇"
          },
          {
            "id": 2741,
            "name": "沙田镇"
          },
          {
            "id": 2746,
            "name": "凤岗镇"
          },
          {
            "id": 2748,
            "name": "谢岗镇"
          },
          {
            "id": 2755,
            "name": "望牛墩镇"
          },
          {
            "id": 2756,
            "name": "道滘镇"
          },
          {
            "id": 2757,
            "name": "石排镇"
          },
          {
            "id": 2758,
            "name": "洪梅镇"
          },
          {
            "id": 2764,
            "name": "茶山镇"
          }]
        },
        "潮州": {
          "id": 3094,
          "children": [{
            "id": 3094,
            "name": "全部"
          },
          {
            "id": 3095,
            "name": "饶平县"
          },
          {
            "id": 3096,
            "name": "潮安区"
          },
          {
            "id": 3098,
            "name": "枫溪区"
          },
          {
            "id": 3099,
            "name": "湘桥区"
          }]
        }
      }
    },
    "浙江省": {
      "id": 193,
      "children": {
        "全部": {
          "id": 193,
          "children": [{
            "id": 193,
            "name": "全部"
          }]
        },
        "舟山": {
          "id": 194,
          "children": [{
            "id": 194,
            "name": "全部"
          },
          {
            "id": 195,
            "name": "岱山县"
          },
          {
            "id": 199,
            "name": "定海区"
          },
          {
            "id": 200,
            "name": "嵊泗县"
          },
          {
            "id": 203,
            "name": "普陀区"
          }]
        },
        "温州": {
          "id": 759,
          "children": [{
            "id": 759,
            "name": "全部"
          },
          {
            "id": 760,
            "name": "龙湾区"
          },
          {
            "id": 761,
            "name": "乐清市"
          },
          {
            "id": 762,
            "name": "瓯海区"
          },
          {
            "id": 763,
            "name": "永嘉县"
          },
          {
            "id": 766,
            "name": "鹿城区"
          },
          {
            "id": 768,
            "name": "瑞安市"
          },
          {
            "id": 769,
            "name": "泰顺县"
          },
          {
            "id": 770,
            "name": "文成县"
          },
          {
            "id": 771,
            "name": "平阳县"
          },
          {
            "id": 772,
            "name": "洞头县"
          },
          {
            "id": 782,
            "name": "苍南县"
          }]
        },
        "绍兴": {
          "id": 1119,
          "children": [{
            "id": 1119,
            "name": "全部"
          },
          {
            "id": 1120,
            "name": "柯桥区"
          },
          {
            "id": 1122,
            "name": "上虞区"
          },
          {
            "id": 1123,
            "name": "越城区"
          },
          {
            "id": 1124,
            "name": "新昌县"
          },
          {
            "id": 1127,
            "name": "诸暨市"
          },
          {
            "id": 1137,
            "name": "嵊州市"
          }]
        },
        "衢州": {
          "id": 1339,
          "children": [{
            "id": 1339,
            "name": "全部"
          },
          {
            "id": 1340,
            "name": "江山市"
          },
          {
            "id": 1344,
            "name": "衢江区"
          },
          {
            "id": 1345,
            "name": "常山县"
          },
          {
            "id": 1351,
            "name": "柯城区"
          },
          {
            "id": 1353,
            "name": "开化县"
          },
          {
            "id": 1359,
            "name": "龙游县"
          }]
        },
        "宁波": {
          "id": 1543,
          "children": [{
            "id": 1543,
            "name": "全部"
          },
          {
            "id": 1544,
            "name": "江北区"
          },
          {
            "id": 1545,
            "name": "海曙区"
          },
          {
            "id": 1549,
            "name": "镇海区"
          },
          {
            "id": 1551,
            "name": "鄞州区"
          },
          {
            "id": 1555,
            "name": "北仑区"
          },
          {
            "id": 1557,
            "name": "余姚市"
          },
          {
            "id": 1558,
            "name": "奉化市"
          },
          {
            "id": 1559,
            "name": "宁海县"
          },
          {
            "id": 1561,
            "name": "慈溪市"
          },
          {
            "id": 1567,
            "name": "象山县"
          }]
        },
        "丽水": {
          "id": 1803,
          "children": [{
            "id": 1803,
            "name": "全部"
          },
          {
            "id": 1804,
            "name": "莲都区"
          },
          {
            "id": 1809,
            "name": "缙云县"
          },
          {
            "id": 1810,
            "name": "龙泉市"
          },
          {
            "id": 1813,
            "name": "青田县"
          },
          {
            "id": 1821,
            "name": "云和县"
          },
          {
            "id": 1824,
            "name": "遂昌县"
          },
          {
            "id": 1825,
            "name": "松阳县"
          },
          {
            "id": 1828,
            "name": "景宁畲族自治县"
          },
          {
            "id": 1834,
            "name": "庆元县"
          }]
        },
        "金华": {
          "id": 2065,
          "children": [{
            "id": 2065,
            "name": "全部"
          },
          {
            "id": 2066,
            "name": "义乌市"
          },
          {
            "id": 2070,
            "name": "浦江县"
          },
          {
            "id": 2071,
            "name": "金东区"
          },
          {
            "id": 2072,
            "name": "磐安县"
          },
          {
            "id": 2073,
            "name": "武义县"
          },
          {
            "id": 2074,
            "name": "东阳市"
          },
          {
            "id": 2075,
            "name": "永康市"
          },
          {
            "id": 2078,
            "name": "兰溪市"
          },
          {
            "id": 2081,
            "name": "婺城区"
          }]
        },
        "嘉兴": {
          "id": 2107,
          "children": [{
            "id": 2107,
            "name": "全部"
          },
          {
            "id": 2108,
            "name": "秀洲区"
          },
          {
            "id": 2109,
            "name": "南湖区"
          },
          {
            "id": 2110,
            "name": "海盐县"
          },
          {
            "id": 2111,
            "name": "桐乡市"
          },
          {
            "id": 2116,
            "name": "海宁市"
          },
          {
            "id": 2121,
            "name": "平湖市"
          },
          {
            "id": 2123,
            "name": "嘉善县"
          }]
        },
        "湖州": {
          "id": 2294,
          "children": [{
            "id": 2294,
            "name": "全部"
          },
          {
            "id": 2295,
            "name": "南浔区"
          },
          {
            "id": 2296,
            "name": "长兴县"
          },
          {
            "id": 2299,
            "name": "安吉县"
          },
          {
            "id": 2302,
            "name": "吴兴区"
          },
          {
            "id": 2303,
            "name": "德清县"
          }]
        },
        "杭州": {
          "id": 2390,
          "children": [{
            "id": 2390,
            "name": "全部"
          },
          {
            "id": 2391,
            "name": "拱墅区"
          },
          {
            "id": 2393,
            "name": "萧山区"
          },
          {
            "id": 2394,
            "name": "滨江区"
          },
          {
            "id": 2395,
            "name": "江干区"
          },
          {
            "id": 2396,
            "name": "西湖区"
          },
          {
            "id": 2397,
            "name": "余杭区"
          },
          {
            "id": 2399,
            "name": "上城区"
          },
          {
            "id": 2403,
            "name": "桐庐县"
          },
          {
            "id": 2404,
            "name": "临安市"
          },
          {
            "id": 2407,
            "name": "近郊"
          },
          {
            "id": 2411,
            "name": "淳安县"
          },
          {
            "id": 2413,
            "name": "富阳区"
          },
          {
            "id": 2415,
            "name": "下城区"
          },
          {
            "id": 2420,
            "name": "建德市"
          }]
        },
        "台州": {
          "id": 3142,
          "children": [{
            "id": 3142,
            "name": "全部"
          },
          {
            "id": 3143,
            "name": "路桥区"
          },
          {
            "id": 3144,
            "name": "椒江区"
          },
          {
            "id": 3145,
            "name": "天台县"
          },
          {
            "id": 3146,
            "name": "黄岩区"
          },
          {
            "id": 3147,
            "name": "临海市"
          },
          {
            "id": 3150,
            "name": "玉环市"
          },
          {
            "id": 3151,
            "name": "仙居县"
          },
          {
            "id": 3156,
            "name": "三门县"
          },
          {
            "id": 3159,
            "name": "温岭市"
          }]
        }
      }
    },
    "福建省": {
      "id": 218,
      "children": {
        "全部": {
          "id": 218,
          "children": [{
            "id": 218,
            "name": "全部"
          }]
        },
        "漳州": {
          "id": 219,
          "children": [{
            "id": 219,
            "name": "全部"
          },
          {
            "id": 220,
            "name": "芗城区"
          },
          {
            "id": 230,
            "name": "龙海市"
          },
          {
            "id": 235,
            "name": "云霄县"
          },
          {
            "id": 236,
            "name": "东山县"
          },
          {
            "id": 237,
            "name": "长泰县"
          },
          {
            "id": 240,
            "name": "龙文区"
          },
          {
            "id": 241,
            "name": "平和县"
          },
          {
            "id": 242,
            "name": "漳浦县"
          },
          {
            "id": 243,
            "name": "南靖县"
          },
          {
            "id": 244,
            "name": "华安县"
          },
          {
            "id": 246,
            "name": "诏安县"
          }]
        },
        "厦门": {
          "id": 666,
          "children": [{
            "id": 666,
            "name": "全部"
          },
          {
            "id": 667,
            "name": "同安区"
          },
          {
            "id": 669,
            "name": "鼓浪屿"
          },
          {
            "id": 670,
            "name": "翔安区"
          },
          {
            "id": 671,
            "name": "集美区"
          },
          {
            "id": 673,
            "name": "思明区"
          },
          {
            "id": 683,
            "name": "海沧区"
          },
          {
            "id": 715,
            "name": "湖里区"
          }]
        },
        "三明": {
          "id": 962,
          "children": [{
            "id": 962,
            "name": "全部"
          },
          {
            "id": 963,
            "name": "三元区"
          },
          {
            "id": 965,
            "name": "大田县"
          },
          {
            "id": 968,
            "name": "永安市"
          },
          {
            "id": 970,
            "name": "尤溪县"
          },
          {
            "id": 974,
            "name": "梅列区"
          },
          {
            "id": 975,
            "name": "明溪县"
          },
          {
            "id": 978,
            "name": "清流县"
          },
          {
            "id": 979,
            "name": "沙县"
          },
          {
            "id": 980,
            "name": "将乐县"
          },
          {
            "id": 983,
            "name": "建宁县"
          },
          {
            "id": 985,
            "name": "宁化县"
          },
          {
            "id": 1010,
            "name": "泰宁县"
          }]
        },
        "泉州": {
          "id": 1394,
          "children": [{
            "id": 1394,
            "name": "全部"
          },
          {
            "id": 1395,
            "name": "南安市"
          },
          {
            "id": 1396,
            "name": "洛江区"
          },
          {
            "id": 1397,
            "name": "安溪县"
          },
          {
            "id": 1398,
            "name": "惠安县"
          },
          {
            "id": 1399,
            "name": "鲤城区"
          },
          {
            "id": 1400,
            "name": "泉港区"
          },
          {
            "id": 1401,
            "name": "永春县"
          },
          {
            "id": 1403,
            "name": "金门县"
          },
          {
            "id": 1404,
            "name": "石狮市"
          },
          {
            "id": 1405,
            "name": "德化县"
          },
          {
            "id": 1415,
            "name": "丰泽区"
          },
          {
            "id": 1418,
            "name": "晋江市"
          }]
        },
        "莆田": {
          "id": 1437,
          "children": [{
            "id": 1437,
            "name": "全部"
          },
          {
            "id": 1438,
            "name": "涵江区"
          },
          {
            "id": 1439,
            "name": "城厢区"
          },
          {
            "id": 1440,
            "name": "秀屿区"
          },
          {
            "id": 1444,
            "name": "仙游县"
          },
          {
            "id": 1461,
            "name": "荔城区"
          }]
        },
        "南平": {
          "id": 1478,
          "children": [{
            "id": 1478,
            "name": "全部"
          },
          {
            "id": 1479,
            "name": "邵武市"
          },
          {
            "id": 1480,
            "name": "建瓯市"
          },
          {
            "id": 1483,
            "name": "武夷山市"
          },
          {
            "id": 1484,
            "name": "延平区"
          },
          {
            "id": 1487,
            "name": "建阳区"
          },
          {
            "id": 1489,
            "name": "顺昌县"
          },
          {
            "id": 1493,
            "name": "浦城县"
          },
          {
            "id": 1494,
            "name": "光泽县"
          },
          {
            "id": 1497,
            "name": "政和县"
          },
          {
            "id": 1498,
            "name": "松溪县"
          }]
        },
        "宁德": {
          "id": 1506,
          "children": [{
            "id": 1506,
            "name": "全部"
          },
          {
            "id": 1507,
            "name": "寿宁县"
          },
          {
            "id": 1509,
            "name": "柘荣县"
          },
          {
            "id": 1510,
            "name": "蕉城区"
          },
          {
            "id": 1511,
            "name": "霞浦县"
          },
          {
            "id": 1512,
            "name": "屏南县"
          },
          {
            "id": 1513,
            "name": "古田县"
          },
          {
            "id": 1514,
            "name": "周宁县"
          },
          {
            "id": 1515,
            "name": "东侨区"
          },
          {
            "id": 1516,
            "name": "福鼎市"
          },
          {
            "id": 1519,
            "name": "福安市"
          }]
        },
        "龙岩": {
          "id": 1777,
          "children": [{
            "id": 1777,
            "name": "全部"
          },
          {
            "id": 1778,
            "name": "新罗区"
          },
          {
            "id": 1780,
            "name": "长汀县"
          },
          {
            "id": 1785,
            "name": "永定区"
          },
          {
            "id": 1790,
            "name": "上杭县"
          },
          {
            "id": 1793,
            "name": "漳平市"
          },
          {
            "id": 1795,
            "name": "武平县"
          },
          {
            "id": 1796,
            "name": "连城县"
          }]
        },
        "福州": {
          "id": 2601,
          "children": [{
            "id": 2601,
            "name": "全部"
          },
          {
            "id": 2602,
            "name": "鼓楼区"
          },
          {
            "id": 2604,
            "name": "台江区"
          },
          {
            "id": 2605,
            "name": "马尾区"
          },
          {
            "id": 2607,
            "name": "闽侯县"
          },
          {
            "id": 2608,
            "name": "仓山区"
          },
          {
            "id": 2609,
            "name": "近郊"
          },
          {
            "id": 2610,
            "name": "福清市"
          },
          {
            "id": 2611,
            "name": "长乐市"
          },
          {
            "id": 2612,
            "name": "罗源县"
          },
          {
            "id": 2613,
            "name": "连江县"
          },
          {
            "id": 2614,
            "name": "闽清县"
          },
          {
            "id": 2615,
            "name": "永泰县"
          },
          {
            "id": 2622,
            "name": "平潭县"
          },
          {
            "id": 2626,
            "name": "晋安区"
          }]
        }
      }
    },
    "江苏省": {
      "id": 223,
      "children": {
        "全部": {
          "id": 223,
          "children": [{
            "id": 223,
            "name": "全部"
          }]
        },
        "镇江": {
          "id": 224,
          "children": [{
            "id": 224,
            "name": "全部"
          },
          {
            "id": 225,
            "name": "京口区"
          },
          {
            "id": 226,
            "name": "润州区"
          },
          {
            "id": 229,
            "name": "丹阳市"
          },
          {
            "id": 233,
            "name": "扬中市"
          },
          {
            "id": 234,
            "name": "句容市"
          },
          {
            "id": 238,
            "name": "大港新区"
          },
          {
            "id": 239,
            "name": "丹徒区"
          }]
        },
        "扬州": {
          "id": 474,
          "children": [{
            "id": 474,
            "name": "全部"
          },
          {
            "id": 475,
            "name": "广陵区"
          },
          {
            "id": 482,
            "name": "维扬区"
          },
          {
            "id": 490,
            "name": "江都区"
          },
          {
            "id": 493,
            "name": "开发区"
          },
          {
            "id": 494,
            "name": "邗江区"
          },
          {
            "id": 498,
            "name": "仪征市"
          },
          {
            "id": 499,
            "name": "高邮市"
          },
          {
            "id": 503,
            "name": "宝应县"
          }]
        },
        "盐城": {
          "id": 477,
          "children": [{
            "id": 477,
            "name": "全部"
          },
          {
            "id": 478,
            "name": "东台市"
          },
          {
            "id": 481,
            "name": "盐都区"
          },
          {
            "id": 484,
            "name": "亭湖区"
          },
          {
            "id": 487,
            "name": "大丰区"
          },
          {
            "id": 491,
            "name": "响水县"
          },
          {
            "id": 492,
            "name": "射阳县"
          },
          {
            "id": 496,
            "name": "阜宁县"
          },
          {
            "id": 497,
            "name": "建湖县"
          },
          {
            "id": 500,
            "name": "经济技术开发区"
          },
          {
            "id": 502,
            "name": "滨海县"
          },
          {
            "id": 504,
            "name": "城南新区"
          }]
        },
        "无锡": {
          "id": 784,
          "children": [{
            "id": 784,
            "name": "全部"
          },
          {
            "id": 785,
            "name": "新吴区"
          },
          {
            "id": 790,
            "name": "锡山区"
          },
          {
            "id": 794,
            "name": "惠山区"
          },
          {
            "id": 796,
            "name": "宜兴市"
          },
          {
            "id": 800,
            "name": "江阴市"
          },
          {
            "id": 812,
            "name": "梁溪区"
          },
          {
            "id": 820,
            "name": "滨湖区"
          }]
        },
        "泰州": {
          "id": 908,
          "children": [{
            "id": 908,
            "name": "全部"
          },
          {
            "id": 909,
            "name": "海陵区"
          },
          {
            "id": 916,
            "name": "泰兴市"
          },
          {
            "id": 920,
            "name": "姜堰区"
          },
          {
            "id": 923,
            "name": "高港区"
          },
          {
            "id": 927,
            "name": "兴化市"
          },
          {
            "id": 930,
            "name": "靖江市"
          }]
        },
        "宿迁": {
          "id": 1077,
          "children": [{
            "id": 1077,
            "name": "全部"
          },
          {
            "id": 1078,
            "name": "宿城区"
          },
          {
            "id": 1082,
            "name": "宿豫区"
          },
          {
            "id": 1089,
            "name": "泗阳县"
          },
          {
            "id": 1092,
            "name": "沭阳县"
          },
          {
            "id": 1100,
            "name": "泗洪县"
          }]
        },
        "苏州": {
          "id": 1148,
          "children": [{
            "id": 1148,
            "name": "全部"
          },
          {
            "id": 1149,
            "name": "工业园区"
          },
          {
            "id": 1151,
            "name": "高新区"
          },
          {
            "id": 1159,
            "name": "吴中区"
          },
          {
            "id": 1162,
            "name": "吴江区"
          },
          {
            "id": 1163,
            "name": "太仓市"
          },
          {
            "id": 1164,
            "name": "张家港市"
          },
          {
            "id": 1165,
            "name": "常熟市"
          },
          {
            "id": 1166,
            "name": "昆山市"
          },
          {
            "id": 1168,
            "name": "相城区"
          },
          {
            "id": 1177,
            "name": "虎丘区"
          },
          {
            "id": 1179,
            "name": "姑苏区"
          }]
        },
        "南通": {
          "id": 1546,
          "children": [{
            "id": 1546,
            "name": "全部"
          },
          {
            "id": 1547,
            "name": "港闸区"
          },
          {
            "id": 1548,
            "name": "通州区"
          },
          {
            "id": 1550,
            "name": "海门市"
          },
          {
            "id": 1552,
            "name": "如皋市"
          },
          {
            "id": 1553,
            "name": "启东市"
          },
          {
            "id": 1554,
            "name": "崇川区"
          },
          {
            "id": 1556,
            "name": "海安县"
          },
          {
            "id": 1560,
            "name": "如东县"
          }]
        },
        "南京": {
          "id": 1562,
          "children": [{
            "id": 1562,
            "name": "全部"
          },
          {
            "id": 1563,
            "name": "秦淮区"
          },
          {
            "id": 1564,
            "name": "江宁区"
          },
          {
            "id": 1565,
            "name": "鼓楼区"
          },
          {
            "id": 1566,
            "name": "建邺区"
          },
          {
            "id": 1568,
            "name": "栖霞区"
          },
          {
            "id": 1569,
            "name": "玄武区"
          },
          {
            "id": 1570,
            "name": "雨花台区"
          },
          {
            "id": 1573,
            "name": "高淳区"
          },
          {
            "id": 1574,
            "name": "溧水区"
          },
          {
            "id": 1577,
            "name": "六合区"
          },
          {
            "id": 1591,
            "name": "浦口区"
          }]
        },
        "连云港": {
          "id": 1903,
          "children": [{
            "id": 1903,
            "name": "全部"
          },
          {
            "id": 1904,
            "name": "连云区"
          },
          {
            "id": 1905,
            "name": "东海县"
          },
          {
            "id": 1908,
            "name": "海州区"
          },
          {
            "id": 1910,
            "name": "赣榆区"
          },
          {
            "id": 1911,
            "name": "灌南县"
          },
          {
            "id": 1912,
            "name": "灌云县"
          }]
        },
        "常州": {
          "id": 2887,
          "children": [{
            "id": 2887,
            "name": "全部"
          },
          {
            "id": 2888,
            "name": "天宁区"
          },
          {
            "id": 2889,
            "name": "钟楼区"
          },
          {
            "id": 2893,
            "name": "溧阳市"
          },
          {
            "id": 2896,
            "name": "新北区"
          },
          {
            "id": 2901,
            "name": "金坛区"
          },
          {
            "id": 2906,
            "name": "武进区"
          }]
        },
        "徐州": {
          "id": 3184,
          "children": [{
            "id": 3184,
            "name": "全部"
          },
          {
            "id": 3185,
            "name": "贾汪区"
          },
          {
            "id": 3188,
            "name": "云龙区"
          },
          {
            "id": 3189,
            "name": "睢宁县"
          },
          {
            "id": 3190,
            "name": "鼓楼区"
          },
          {
            "id": 3191,
            "name": "铜山区"
          },
          {
            "id": 3192,
            "name": "丰县"
          },
          {
            "id": 3193,
            "name": "新沂市"
          },
          {
            "id": 3196,
            "name": "邳州市"
          },
          {
            "id": 3197,
            "name": "泉山区"
          },
          {
            "id": 3200,
            "name": "沛县"
          }]
        }
      }
    },
    "河南省": {
      "id": 258,
      "children": {
        "全部": {
          "id": 258,
          "children": [{
            "id": 258,
            "name": "全部"
          }]
        },
        "驻马店": {
          "id": 259,
          "children": [{
            "id": 259,
            "name": "全部"
          },
          {
            "id": 260,
            "name": "驿城区"
          },
          {
            "id": 261,
            "name": "确山县"
          },
          {
            "id": 262,
            "name": "泌阳县"
          },
          {
            "id": 263,
            "name": "遂平县"
          },
          {
            "id": 271,
            "name": "平舆县"
          },
          {
            "id": 272,
            "name": "西平县"
          },
          {
            "id": 274,
            "name": "汝南县"
          },
          {
            "id": 275,
            "name": "新蔡县"
          },
          {
            "id": 276,
            "name": "正阳县"
          },
          {
            "id": 277,
            "name": "上蔡县"
          }]
        },
        "郑州": {
          "id": 278,
          "children": [{
            "id": 278,
            "name": "全部"
          },
          {
            "id": 279,
            "name": "管城回族区"
          },
          {
            "id": 280,
            "name": "中原区"
          },
          {
            "id": 281,
            "name": "惠济区"
          },
          {
            "id": 282,
            "name": "上街区"
          },
          {
            "id": 283,
            "name": "金水区"
          },
          {
            "id": 284,
            "name": "登封市"
          },
          {
            "id": 285,
            "name": "荥阳市"
          },
          {
            "id": 286,
            "name": "高新区"
          },
          {
            "id": 287,
            "name": "二七区"
          },
          {
            "id": 288,
            "name": "新郑市"
          },
          {
            "id": 289,
            "name": "近郊"
          },
          {
            "id": 290,
            "name": "新密市"
          },
          {
            "id": 291,
            "name": "巩义市"
          },
          {
            "id": 292,
            "name": "中牟县"
          }]
        },
        "信阳": {
          "id": 600,
          "children": [{
            "id": 600,
            "name": "全部"
          },
          {
            "id": 601,
            "name": "浉河区"
          },
          {
            "id": 605,
            "name": "平桥区"
          },
          {
            "id": 611,
            "name": "息县"
          },
          {
            "id": 613,
            "name": "淮滨县"
          },
          {
            "id": 621,
            "name": "潢川县"
          },
          {
            "id": 626,
            "name": "光山县"
          },
          {
            "id": 628,
            "name": "固始县"
          },
          {
            "id": 631,
            "name": "罗山县"
          },
          {
            "id": 634,
            "name": "商城县"
          },
          {
            "id": 644,
            "name": "新县"
          }]
        },
        "新乡": {
          "id": 602,
          "children": [{
            "id": 602,
            "name": "全部"
          },
          {
            "id": 603,
            "name": "卫滨区"
          },
          {
            "id": 608,
            "name": "牧野区"
          },
          {
            "id": 609,
            "name": "凤泉区"
          },
          {
            "id": 619,
            "name": "获嘉县"
          },
          {
            "id": 625,
            "name": "红旗区"
          },
          {
            "id": 627,
            "name": "新乡县"
          },
          {
            "id": 629,
            "name": "卫辉市"
          },
          {
            "id": 630,
            "name": "封丘县"
          },
          {
            "id": 632,
            "name": "延津县"
          },
          {
            "id": 633,
            "name": "辉县市"
          },
          {
            "id": 635,
            "name": "长垣县"
          },
          {
            "id": 639,
            "name": "原阳县"
          }]
        },
        "许昌": {
          "id": 636,
          "children": [{
            "id": 636,
            "name": "全部"
          },
          {
            "id": 637,
            "name": "长葛市"
          },
          {
            "id": 638,
            "name": "建安区"
          },
          {
            "id": 640,
            "name": "鄢陵县"
          },
          {
            "id": 641,
            "name": "襄城县"
          },
          {
            "id": 647,
            "name": "禹州市"
          },
          {
            "id": 672,
            "name": "魏都区"
          }]
        },
        "三门峡": {
          "id": 1025,
          "children": [{
            "id": 1025,
            "name": "全部"
          },
          {
            "id": 1026,
            "name": "义马市"
          },
          {
            "id": 1029,
            "name": "灵宝市"
          },
          {
            "id": 1030,
            "name": "渑池县"
          },
          {
            "id": 1031,
            "name": "陕州区"
          },
          {
            "id": 1032,
            "name": "卢氏县"
          },
          {
            "id": 1037,
            "name": "湖滨区"
          }]
        },
        "商丘": {
          "id": 1060,
          "children": [{
            "id": 1060,
            "name": "全部"
          },
          {
            "id": 1061,
            "name": "宁陵县"
          },
          {
            "id": 1062,
            "name": "梁园区"
          },
          {
            "id": 1063,
            "name": "虞城县"
          },
          {
            "id": 1064,
            "name": "民权县"
          },
          {
            "id": 1068,
            "name": "睢县"
          },
          {
            "id": 1069,
            "name": "永城市"
          },
          {
            "id": 1071,
            "name": "睢阳区"
          },
          {
            "id": 1076,
            "name": "夏邑县"
          },
          {
            "id": 1081,
            "name": "柘城县"
          }]
        },
        "濮阳": {
          "id": 1433,
          "children": [{
            "id": 1433,
            "name": "全部"
          },
          {
            "id": 1434,
            "name": "清丰县"
          },
          {
            "id": 1435,
            "name": "台前县"
          },
          {
            "id": 1436,
            "name": "濮阳县"
          },
          {
            "id": 1443,
            "name": "华龙区"
          },
          {
            "id": 1446,
            "name": "范县"
          },
          {
            "id": 1447,
            "name": "南乐县"
          }]
        },
        "平顶山": {
          "id": 1457,
          "children": [{
            "id": 1457,
            "name": "全部"
          },
          {
            "id": 1458,
            "name": "新华区"
          },
          {
            "id": 1459,
            "name": "湛河区"
          },
          {
            "id": 1460,
            "name": "石龙区"
          },
          {
            "id": 1463,
            "name": "卫东区"
          },
          {
            "id": 1464,
            "name": "舞钢市"
          },
          {
            "id": 1469,
            "name": "汝州市"
          },
          {
            "id": 1471,
            "name": "郏县"
          },
          {
            "id": 1472,
            "name": "宝丰县"
          },
          {
            "id": 1473,
            "name": "鲁山县"
          },
          {
            "id": 1474,
            "name": "叶县"
          }]
        },
        "南阳": {
          "id": 1524,
          "children": [{
            "id": 1524,
            "name": "全部"
          },
          {
            "id": 1525,
            "name": "南召县"
          },
          {
            "id": 1526,
            "name": "邓州市"
          },
          {
            "id": 1527,
            "name": "卧龙区"
          },
          {
            "id": 1530,
            "name": "镇平县"
          },
          {
            "id": 1531,
            "name": "西峡县"
          },
          {
            "id": 1532,
            "name": "内乡县"
          },
          {
            "id": 1534,
            "name": "唐河县"
          },
          {
            "id": 1535,
            "name": "宛城区"
          },
          {
            "id": 1537,
            "name": "淅川县"
          },
          {
            "id": 1538,
            "name": "新野县"
          },
          {
            "id": 1540,
            "name": "桐柏县"
          },
          {
            "id": 1541,
            "name": "社旗县"
          },
          {
            "id": 1542,
            "name": "方城县"
          }]
        },
        "漯河": {
          "id": 1726,
          "children": [{
            "id": 1726,
            "name": "全部"
          },
          {
            "id": 1727,
            "name": "郾城区"
          },
          {
            "id": 1728,
            "name": "源汇区"
          },
          {
            "id": 1730,
            "name": "召陵区"
          },
          {
            "id": 1738,
            "name": "临颍县"
          },
          {
            "id": 1743,
            "name": "舞阳县"
          }]
        },
        "洛阳": {
          "id": 1871,
          "children": [{
            "id": 1871,
            "name": "全部"
          },
          {
            "id": 1872,
            "name": "老城区"
          },
          {
            "id": 1873,
            "name": "瀍河回族区"
          },
          {
            "id": 1875,
            "name": "吉利区"
          },
          {
            "id": 1876,
            "name": "西工区"
          },
          {
            "id": 1877,
            "name": "洛龙区"
          },
          {
            "id": 1880,
            "name": "孟津县"
          },
          {
            "id": 1881,
            "name": "偃师市"
          },
          {
            "id": 1882,
            "name": "汝阳县"
          },
          {
            "id": 1883,
            "name": "栾川县"
          },
          {
            "id": 1884,
            "name": "宜阳县"
          },
          {
            "id": 1885,
            "name": "嵩县"
          },
          {
            "id": 1886,
            "name": "伊川县"
          },
          {
            "id": 1887,
            "name": "新安县"
          },
          {
            "id": 1894,
            "name": "洛宁县"
          },
          {
            "id": 1901,
            "name": "涧西区"
          }]
        },
        "开封": {
          "id": 1932,
          "children": [{
            "id": 1932,
            "name": "全部"
          },
          {
            "id": 1933,
            "name": "鼓楼区"
          },
          {
            "id": 1934,
            "name": "顺河回族区"
          },
          {
            "id": 1935,
            "name": "禹王台区"
          },
          {
            "id": 1936,
            "name": "杞县"
          },
          {
            "id": 1938,
            "name": "龙亭区"
          },
          {
            "id": 1940,
            "name": "尉氏县"
          },
          {
            "id": 1943,
            "name": "祥符区"
          },
          {
            "id": 1944,
            "name": "兰考县"
          },
          {
            "id": 1950,
            "name": "通许县"
          }]
        },
        "焦作": {
          "id": 2038,
          "children": [{
            "id": 2038,
            "name": "全部"
          },
          {
            "id": 2039,
            "name": "中站区"
          },
          {
            "id": 2040,
            "name": "沁阳市"
          },
          {
            "id": 2041,
            "name": "解放区"
          },
          {
            "id": 2042,
            "name": "山阳区"
          },
          {
            "id": 2043,
            "name": "博爱县"
          },
          {
            "id": 2044,
            "name": "马村区"
          },
          {
            "id": 2045,
            "name": "温县"
          },
          {
            "id": 2046,
            "name": "修武县"
          },
          {
            "id": 2047,
            "name": "武陟县"
          },
          {
            "id": 2048,
            "name": "孟州市"
          },
          {
            "id": 2051,
            "name": "济源市"
          }]
        },
        "鹤壁": {
          "id": 2185,
          "children": [{
            "id": 2185,
            "name": "全部"
          },
          {
            "id": 2186,
            "name": "鹤山区"
          },
          {
            "id": 2187,
            "name": "淇县"
          },
          {
            "id": 2188,
            "name": "淇滨区"
          },
          {
            "id": 2192,
            "name": "山城区"
          },
          {
            "id": 2195,
            "name": "浚县"
          }]
        },
        "安阳": {
          "id": 3049,
          "children": [{
            "id": 3049,
            "name": "全部"
          },
          {
            "id": 3050,
            "name": "殷都区"
          },
          {
            "id": 3053,
            "name": "北关区"
          },
          {
            "id": 3057,
            "name": "安阳县"
          },
          {
            "id": 3058,
            "name": "内黄县"
          },
          {
            "id": 3059,
            "name": "汤阴县"
          },
          {
            "id": 3060,
            "name": "文峰区"
          },
          {
            "id": 3061,
            "name": "林州市"
          },
          {
            "id": 3064,
            "name": "滑县"
          },
          {
            "id": 3065,
            "name": "龙安区"
          }]
        },
        "周口": {
          "id": 3194,
          "children": [{
            "id": 3194,
            "name": "全部"
          },
          {
            "id": 3195,
            "name": "项城市"
          },
          {
            "id": 3198,
            "name": "川汇区"
          },
          {
            "id": 3199,
            "name": "西华县"
          },
          {
            "id": 3201,
            "name": "扶沟县"
          },
          {
            "id": 3202,
            "name": "商水县"
          },
          {
            "id": 3203,
            "name": "太康县"
          },
          {
            "id": 3204,
            "name": "淮阳县"
          },
          {
            "id": 3207,
            "name": "沈丘县"
          },
          {
            "id": 3208,
            "name": "鹿邑县"
          },
          {
            "id": 3213,
            "name": "郸城县"
          }]
        }
      }
    },
    "四川省": {
      "id": 293,
      "children": {
        "全部": {
          "id": 293,
          "children": [{
            "id": 293,
            "name": "全部"
          }]
        },
        "雅安": {
          "id": 294,
          "children": [{
            "id": 294,
            "name": "全部"
          },
          {
            "id": 295,
            "name": "名山区"
          },
          {
            "id": 296,
            "name": "汉源县"
          },
          {
            "id": 297,
            "name": "雨城区"
          },
          {
            "id": 298,
            "name": "石棉县"
          },
          {
            "id": 299,
            "name": "芦山县"
          },
          {
            "id": 300,
            "name": "天全县"
          },
          {
            "id": 301,
            "name": "荥经县"
          },
          {
            "id": 302,
            "name": "宝兴县"
          }]
        },
        "宜宾": {
          "id": 442,
          "children": [{
            "id": 442,
            "name": "全部"
          },
          {
            "id": 443,
            "name": "宜宾县"
          },
          {
            "id": 445,
            "name": "南溪区"
          },
          {
            "id": 446,
            "name": "江安县"
          },
          {
            "id": 454,
            "name": "高县"
          },
          {
            "id": 455,
            "name": "筠连县"
          },
          {
            "id": 456,
            "name": "翠屏区"
          },
          {
            "id": 462,
            "name": "珙县"
          },
          {
            "id": 463,
            "name": "兴文县"
          },
          {
            "id": 467,
            "name": "屏山县"
          },
          {
            "id": 470,
            "name": "长宁县"
          }]
        },
        "遂宁": {
          "id": 995,
          "children": [{
            "id": 995,
            "name": "全部"
          },
          {
            "id": 996,
            "name": "安居区"
          },
          {
            "id": 997,
            "name": "蓬溪县"
          },
          {
            "id": 999,
            "name": "船山区"
          },
          {
            "id": 1000,
            "name": "射洪县"
          },
          {
            "id": 1004,
            "name": "大英县"
          }]
        },
        "攀枝花": {
          "id": 1421,
          "children": [{
            "id": 1421,
            "name": "全部"
          },
          {
            "id": 1422,
            "name": "西区"
          },
          {
            "id": 1424,
            "name": "盐边县"
          },
          {
            "id": 1427,
            "name": "仁和区"
          },
          {
            "id": 1428,
            "name": "米易县"
          },
          {
            "id": 1432,
            "name": "东区"
          }]
        },
        "内江": {
          "id": 1485,
          "children": [{
            "id": 1485,
            "name": "全部"
          },
          {
            "id": 1486,
            "name": "威远县"
          },
          {
            "id": 1488,
            "name": "资中县"
          },
          {
            "id": 1496,
            "name": "市中区"
          },
          {
            "id": 1499,
            "name": "东兴区"
          },
          {
            "id": 1508,
            "name": "隆昌市"
          }]
        },
        "南充": {
          "id": 1490,
          "children": [{
            "id": 1490,
            "name": "全部"
          },
          {
            "id": 1491,
            "name": "高坪区"
          },
          {
            "id": 1492,
            "name": "嘉陵区"
          },
          {
            "id": 1495,
            "name": "顺庆区"
          },
          {
            "id": 1500,
            "name": "营山县"
          },
          {
            "id": 1501,
            "name": "阆中市"
          },
          {
            "id": 1502,
            "name": "蓬安县"
          },
          {
            "id": 1503,
            "name": "仪陇县"
          },
          {
            "id": 1504,
            "name": "南部县"
          },
          {
            "id": 1505,
            "name": "西充县"
          }]
        },
        "眉山": {
          "id": 1586,
          "children": [{
            "id": 1586,
            "name": "全部"
          },
          {
            "id": 1587,
            "name": "洪雅县"
          },
          {
            "id": 1588,
            "name": "丹棱县"
          },
          {
            "id": 1589,
            "name": "青神县"
          },
          {
            "id": 1590,
            "name": "彭山区"
          },
          {
            "id": 1598,
            "name": "东坡区"
          },
          {
            "id": 1601,
            "name": "仁寿县"
          }]
        },
        "绵阳": {
          "id": 1613,
          "children": [{
            "id": 1613,
            "name": "全部"
          },
          {
            "id": 1614,
            "name": "游仙区"
          },
          {
            "id": 1620,
            "name": "盐亭县"
          },
          {
            "id": 1623,
            "name": "江油市"
          },
          {
            "id": 1624,
            "name": "安州区"
          },
          {
            "id": 1626,
            "name": "三台县"
          },
          {
            "id": 1627,
            "name": "梓潼县"
          },
          {
            "id": 1630,
            "name": "平武县"
          },
          {
            "id": 1634,
            "name": "北川羌族自治县"
          },
          {
            "id": 1669,
            "name": "涪城区"
          }]
        },
        "凉山": {
          "id": 1691,
          "children": [{
            "id": 1691,
            "name": "全部"
          },
          {
            "id": 1692,
            "name": "盐源县"
          },
          {
            "id": 1693,
            "name": "德昌县"
          },
          {
            "id": 1694,
            "name": "会理县"
          },
          {
            "id": 1695,
            "name": "会东县"
          },
          {
            "id": 1696,
            "name": "宁南县"
          },
          {
            "id": 1698,
            "name": "金阳县"
          },
          {
            "id": 1699,
            "name": "普格县"
          },
          {
            "id": 1700,
            "name": "昭觉县"
          },
          {
            "id": 1701,
            "name": "西昌市"
          },
          {
            "id": 1702,
            "name": "冕宁县"
          },
          {
            "id": 1703,
            "name": "喜德县"
          },
          {
            "id": 1704,
            "name": "越西县"
          },
          {
            "id": 1705,
            "name": "布拖县"
          },
          {
            "id": 1706,
            "name": "美姑县"
          },
          {
            "id": 1707,
            "name": "甘洛县"
          },
          {
            "id": 1711,
            "name": "雷波县"
          },
          {
            "id": 1714,
            "name": "木里藏族自治县"
          }]
        },
        "泸州": {
          "id": 1750,
          "children": [{
            "id": 1750,
            "name": "全部"
          },
          {
            "id": 1751,
            "name": "合江县"
          },
          {
            "id": 1752,
            "name": "泸县"
          },
          {
            "id": 1753,
            "name": "纳溪区"
          },
          {
            "id": 1754,
            "name": "江阳区"
          },
          {
            "id": 1755,
            "name": "龙马潭区"
          },
          {
            "id": 1757,
            "name": "古蔺县"
          },
          {
            "id": 1758,
            "name": "叙永县"
          }]
        },
        "乐山": {
          "id": 1767,
          "children": [{
            "id": 1767,
            "name": "全部"
          },
          {
            "id": 1768,
            "name": "沙湾区"
          },
          {
            "id": 1771,
            "name": "五通桥区"
          },
          {
            "id": 1773,
            "name": "金口河区"
          },
          {
            "id": 1774,
            "name": "犍为县"
          },
          {
            "id": 1781,
            "name": "夹江县"
          },
          {
            "id": 1782,
            "name": "市中区"
          },
          {
            "id": 1783,
            "name": "峨眉山市"
          },
          {
            "id": 1789,
            "name": "井研县"
          },
          {
            "id": 1791,
            "name": "峨边彝族自治县"
          },
          {
            "id": 1797,
            "name": "马边彝族自治县"
          },
          {
            "id": 1807,
            "name": "沐川县"
          }]
        },
        "甘孜": {
          "id": 2440,
          "children": [{
            "id": 2440,
            "name": "全部"
          },
          {
            "id": 2441,
            "name": "康定市"
          },
          {
            "id": 2444,
            "name": "丹巴县"
          },
          {
            "id": 2447,
            "name": "雅江县"
          },
          {
            "id": 2448,
            "name": "泸定县"
          },
          {
            "id": 2451,
            "name": "道孚县"
          },
          {
            "id": 2452,
            "name": "九龙县"
          },
          {
            "id": 2454,
            "name": "石渠县"
          },
          {
            "id": 2455,
            "name": "色达县"
          },
          {
            "id": 2456,
            "name": "理塘县"
          },
          {
            "id": 2457,
            "name": "德格县"
          },
          {
            "id": 2458,
            "name": "新龙县"
          },
          {
            "id": 2459,
            "name": "乡城县"
          },
          {
            "id": 2460,
            "name": "炉霍县"
          },
          {
            "id": 2461,
            "name": "得荣县"
          },
          {
            "id": 2462,
            "name": "巴塘县"
          },
          {
            "id": 2463,
            "name": "白玉县"
          },
          {
            "id": 2467,
            "name": "稻城县"
          },
          {
            "id": 2473,
            "name": "甘孜县"
          }]
        },
        "广元": {
          "id": 2469,
          "children": [{
            "id": 2469,
            "name": "全部"
          },
          {
            "id": 2470,
            "name": "朝天区"
          },
          {
            "id": 2472,
            "name": "旺苍县"
          },
          {
            "id": 2475,
            "name": "青川县"
          },
          {
            "id": 2476,
            "name": "昭化区"
          },
          {
            "id": 2479,
            "name": "剑阁县"
          },
          {
            "id": 2481,
            "name": "苍溪县"
          },
          {
            "id": 2522,
            "name": "利州区"
          }]
        },
        "达州": {
          "id": 2667,
          "children": [{
            "id": 2667,
            "name": "全部"
          },
          {
            "id": 2668,
            "name": "万源市"
          },
          {
            "id": 2669,
            "name": "达川区"
          },
          {
            "id": 2672,
            "name": "通川区"
          },
          {
            "id": 2673,
            "name": "开江县"
          },
          {
            "id": 2674,
            "name": "宣汉县"
          },
          {
            "id": 2676,
            "name": "大竹县"
          },
          {
            "id": 2682,
            "name": "渠县"
          }]
        },
        "德阳": {
          "id": 2680,
          "children": [{
            "id": 2680,
            "name": "全部"
          },
          {
            "id": 2681,
            "name": "什邡市"
          },
          {
            "id": 2688,
            "name": "罗江县"
          },
          {
            "id": 2689,
            "name": "绵竹市"
          },
          {
            "id": 2690,
            "name": "旌阳区"
          },
          {
            "id": 2695,
            "name": "广汉市"
          },
          {
            "id": 2696,
            "name": "中江县"
          }]
        },
        "成都": {
          "id": 2919,
          "children": [{
            "id": 2919,
            "name": "全部"
          },
          {
            "id": 2920,
            "name": "武侯区"
          },
          {
            "id": 2923,
            "name": "成华区"
          },
          {
            "id": 2925,
            "name": "青羊区"
          },
          {
            "id": 2926,
            "name": "郫县"
          },
          {
            "id": 2927,
            "name": "金牛区"
          },
          {
            "id": 2932,
            "name": "温江区"
          },
          {
            "id": 2934,
            "name": "锦江区"
          },
          {
            "id": 2935,
            "name": "龙泉驿区"
          },
          {
            "id": 2936,
            "name": "青白江区"
          },
          {
            "id": 2938,
            "name": "彭州市"
          },
          {
            "id": 2939,
            "name": "新津县"
          },
          {
            "id": 2945,
            "name": "崇州市"
          },
          {
            "id": 2946,
            "name": "都江堰市"
          },
          {
            "id": 2948,
            "name": "邛崃市"
          },
          {
            "id": 2950,
            "name": "金堂县"
          },
          {
            "id": 2953,
            "name": "大邑县"
          },
          {
            "id": 2956,
            "name": "蒲江县"
          },
          {
            "id": 2957,
            "name": "简阳市"
          },
          {
            "id": 2960,
            "name": "高新区"
          },
          {
            "id": 2965,
            "name": "新都区"
          },
          {
            "id": 2968,
            "name": "双流区"
          }]
        },
        "巴中": {
          "id": 2990,
          "children": [{
            "id": 2990,
            "name": "全部"
          },
          {
            "id": 2991,
            "name": "通江县"
          },
          {
            "id": 2992,
            "name": "巴州区"
          },
          {
            "id": 2994,
            "name": "平昌县"
          },
          {
            "id": 2995,
            "name": "恩阳区"
          },
          {
            "id": 2996,
            "name": "南江县"
          }]
        },
        "阿坝": {
          "id": 3000,
          "children": [{
            "id": 3000,
            "name": "全部"
          },
          {
            "id": 3001,
            "name": "马尔康市"
          },
          {
            "id": 3003,
            "name": "理县"
          },
          {
            "id": 3009,
            "name": "茂县"
          },
          {
            "id": 3010,
            "name": "汶川县"
          },
          {
            "id": 3011,
            "name": "金川县"
          },
          {
            "id": 3012,
            "name": "小金县"
          },
          {
            "id": 3013,
            "name": "九寨沟县"
          },
          {
            "id": 3014,
            "name": "壤塘县"
          },
          {
            "id": 3016,
            "name": "松潘县"
          },
          {
            "id": 3017,
            "name": "黑水县"
          },
          {
            "id": 3018,
            "name": "若尔盖县"
          },
          {
            "id": 3019,
            "name": "阿坝县"
          },
          {
            "id": 3020,
            "name": "红原县"
          }]
        },
        "自贡": {
          "id": 3205,
          "children": [{
            "id": 3205,
            "name": "全部"
          },
          {
            "id": 3206,
            "name": "贡井区"
          },
          {
            "id": 3209,
            "name": "大安区"
          },
          {
            "id": 3210,
            "name": "沿滩区"
          },
          {
            "id": 3211,
            "name": "荣县"
          },
          {
            "id": 3212,
            "name": "自流井区"
          },
          {
            "id": 3214,
            "name": "富顺县"
          }]
        }
      }
    },
    "山西省": {
      "id": 327,
      "children": {
        "全部": {
          "id": 327,
          "children": [{
            "id": 327,
            "name": "全部"
          }]
        },
        "阳泉": {
          "id": 328,
          "children": [{
            "id": 328,
            "name": "全部"
          },
          {
            "id": 329,
            "name": "郊区"
          },
          {
            "id": 330,
            "name": "矿区"
          },
          {
            "id": 331,
            "name": "城区"
          },
          {
            "id": 332,
            "name": "盂县"
          },
          {
            "id": 372,
            "name": "平定县"
          }]
        },
        "运城": {
          "id": 411,
          "children": [{
            "id": 411,
            "name": "全部"
          },
          {
            "id": 412,
            "name": "永济市"
          },
          {
            "id": 413,
            "name": "万荣县"
          },
          {
            "id": 414,
            "name": "盐湖区"
          },
          {
            "id": 415,
            "name": "临猗县"
          },
          {
            "id": 416,
            "name": "新绛县"
          },
          {
            "id": 417,
            "name": "稷山县"
          },
          {
            "id": 418,
            "name": "河津市"
          },
          {
            "id": 420,
            "name": "闻喜县"
          },
          {
            "id": 421,
            "name": "禹都开发区"
          },
          {
            "id": 422,
            "name": "垣曲县"
          },
          {
            "id": 423,
            "name": "绛县"
          },
          {
            "id": 424,
            "name": "平陆县"
          },
          {
            "id": 427,
            "name": "芮城县"
          },
          {
            "id": 429,
            "name": "夏县"
          }]
        },
        "忻州": {
          "id": 520,
          "children": [{
            "id": 520,
            "name": "全部"
          },
          {
            "id": 521,
            "name": "五台县"
          },
          {
            "id": 522,
            "name": "定襄县"
          },
          {
            "id": 523,
            "name": "原平市"
          },
          {
            "id": 524,
            "name": "繁峙县"
          },
          {
            "id": 525,
            "name": "忻府区"
          },
          {
            "id": 526,
            "name": "代县"
          },
          {
            "id": 527,
            "name": "五寨县"
          },
          {
            "id": 528,
            "name": "静乐县"
          },
          {
            "id": 529,
            "name": "岢岚县"
          },
          {
            "id": 530,
            "name": "河曲县"
          },
          {
            "id": 531,
            "name": "神池县"
          },
          {
            "id": 532,
            "name": "偏关县"
          },
          {
            "id": 534,
            "name": "保德县"
          },
          {
            "id": 545,
            "name": "宁武县"
          }]
        },
        "太原": {
          "id": 902,
          "children": [{
            "id": 902,
            "name": "全部"
          },
          {
            "id": 903,
            "name": "迎泽区"
          },
          {
            "id": 910,
            "name": "杏花岭区"
          },
          {
            "id": 911,
            "name": "小店区"
          },
          {
            "id": 914,
            "name": "万柏林区"
          },
          {
            "id": 915,
            "name": "晋源区"
          },
          {
            "id": 917,
            "name": "尖草坪区"
          },
          {
            "id": 918,
            "name": "近郊"
          },
          {
            "id": 926,
            "name": "阳曲县"
          },
          {
            "id": 928,
            "name": "清徐县"
          },
          {
            "id": 938,
            "name": "娄烦县"
          },
          {
            "id": 939,
            "name": "古交市"
          }]
        },
        "朔州": {
          "id": 954,
          "children": [{
            "id": 954,
            "name": "全部"
          },
          {
            "id": 955,
            "name": "平鲁区"
          },
          {
            "id": 956,
            "name": "山阴县"
          },
          {
            "id": 957,
            "name": "朔城区"
          },
          {
            "id": 958,
            "name": "右玉县"
          },
          {
            "id": 959,
            "name": "应县"
          },
          {
            "id": 967,
            "name": "怀仁县"
          }]
        },
        "吕梁": {
          "id": 1744,
          "children": [{
            "id": 1744,
            "name": "全部"
          },
          {
            "id": 1745,
            "name": "离石区"
          },
          {
            "id": 1746,
            "name": "孝义市"
          },
          {
            "id": 1748,
            "name": "文水县"
          },
          {
            "id": 1759,
            "name": "中阳县"
          },
          {
            "id": 1760,
            "name": "柳林县"
          },
          {
            "id": 1761,
            "name": "临县"
          },
          {
            "id": 1763,
            "name": "方山县"
          },
          {
            "id": 1764,
            "name": "岚县"
          },
          {
            "id": 1765,
            "name": "交口县"
          },
          {
            "id": 1766,
            "name": "汾阳市"
          },
          {
            "id": 1769,
            "name": "石楼县"
          },
          {
            "id": 1770,
            "name": "兴县"
          },
          {
            "id": 1772,
            "name": "交城县"
          }]
        },
        "临汾": {
          "id": 1836,
          "children": [{
            "id": 1836,
            "name": "全部"
          },
          {
            "id": 1837,
            "name": "曲沃县"
          },
          {
            "id": 1838,
            "name": "翼城县"
          },
          {
            "id": 1839,
            "name": "襄汾县"
          },
          {
            "id": 1840,
            "name": "洪洞县"
          },
          {
            "id": 1842,
            "name": "安泽县"
          },
          {
            "id": 1843,
            "name": "古县"
          },
          {
            "id": 1844,
            "name": "吉县"
          },
          {
            "id": 1845,
            "name": "大宁县"
          },
          {
            "id": 1846,
            "name": "蒲县"
          },
          {
            "id": 1847,
            "name": "乡宁县"
          },
          {
            "id": 1848,
            "name": "永和县"
          },
          {
            "id": 1849,
            "name": "隰县"
          },
          {
            "id": 1850,
            "name": "汾西县"
          },
          {
            "id": 1851,
            "name": "尧都区"
          },
          {
            "id": 1852,
            "name": "霍州市"
          },
          {
            "id": 1853,
            "name": "浮山县"
          },
          {
            "id": 1866,
            "name": "侯马市"
          }]
        },
        "晋中": {
          "id": 1993,
          "children": [{
            "id": 1993,
            "name": "全部"
          },
          {
            "id": 1994,
            "name": "榆社县"
          },
          {
            "id": 1995,
            "name": "左权县"
          },
          {
            "id": 1996,
            "name": "介休市"
          },
          {
            "id": 2003,
            "name": "和顺县"
          },
          {
            "id": 2004,
            "name": "昔阳县"
          },
          {
            "id": 2005,
            "name": "寿阳县"
          },
          {
            "id": 2006,
            "name": "祁县"
          },
          {
            "id": 2007,
            "name": "灵石县"
          },
          {
            "id": 2010,
            "name": "榆次区"
          },
          {
            "id": 2011,
            "name": "太谷县"
          },
          {
            "id": 2013,
            "name": "平遥县"
          }]
        },
        "晋城": {
          "id": 2016,
          "children": [{
            "id": 2016,
            "name": "全部"
          },
          {
            "id": 2017,
            "name": "高平市"
          },
          {
            "id": 2018,
            "name": "泽州县"
          },
          {
            "id": 2019,
            "name": "城区"
          },
          {
            "id": 2023,
            "name": "阳城县"
          },
          {
            "id": 2029,
            "name": "沁水县"
          },
          {
            "id": 2035,
            "name": "陵川县"
          }]
        },
        "长治": {
          "id": 2844,
          "children": [{
            "id": 2844,
            "name": "全部"
          },
          {
            "id": 2845,
            "name": "城区"
          },
          {
            "id": 2850,
            "name": "郊区"
          },
          {
            "id": 2854,
            "name": "潞城市"
          },
          {
            "id": 2855,
            "name": "长治县"
          },
          {
            "id": 2866,
            "name": "屯留县"
          },
          {
            "id": 2868,
            "name": "襄垣县"
          },
          {
            "id": 2872,
            "name": "平顺县"
          },
          {
            "id": 2873,
            "name": "黎城县"
          },
          {
            "id": 2876,
            "name": "壶关县"
          },
          {
            "id": 2877,
            "name": "长子县"
          },
          {
            "id": 2879,
            "name": "武乡县"
          },
          {
            "id": 2894,
            "name": "沁源县"
          },
          {
            "id": 2905,
            "name": "沁县"
          }]
        }
      }
    },
    "江西省": {
      "id": 341,
      "children": {
        "全部": {
          "id": 341,
          "children": [{
            "id": 341,
            "name": "全部"
          }]
        },
        "鹰潭": {
          "id": 342,
          "children": [{
            "id": 342,
            "name": "全部"
          },
          {
            "id": 343,
            "name": "贵溪市"
          },
          {
            "id": 344,
            "name": "余江县"
          },
          {
            "id": 368,
            "name": "月湖区"
          }]
        },
        "宜春": {
          "id": 398,
          "children": [{
            "id": 398,
            "name": "全部"
          },
          {
            "id": 399,
            "name": "丰城市"
          },
          {
            "id": 401,
            "name": "樟树市"
          },
          {
            "id": 402,
            "name": "奉新县"
          },
          {
            "id": 403,
            "name": "万载县"
          },
          {
            "id": 404,
            "name": "高安市"
          },
          {
            "id": 407,
            "name": "宜丰县"
          },
          {
            "id": 408,
            "name": "上高县"
          },
          {
            "id": 409,
            "name": "袁州区"
          },
          {
            "id": 410,
            "name": "铜鼓县"
          },
          {
            "id": 419,
            "name": "靖安县"
          }]
        },
        "新余": {
          "id": 548,
          "children": [{
            "id": 548,
            "name": "全部"
          },
          {
            "id": 549,
            "name": "渝水区"
          },
          {
            "id": 553,
            "name": "分宜县"
          }]
        },
        "上饶": {
          "id": 1044,
          "children": [{
            "id": 1044,
            "name": "全部"
          },
          {
            "id": 1045,
            "name": "德兴市"
          },
          {
            "id": 1046,
            "name": "广丰区"
          },
          {
            "id": 1048,
            "name": "玉山县"
          },
          {
            "id": 1050,
            "name": "弋阳县"
          },
          {
            "id": 1051,
            "name": "鄱阳县"
          },
          {
            "id": 1052,
            "name": "横峰县"
          },
          {
            "id": 1053,
            "name": "余干县"
          },
          {
            "id": 1054,
            "name": "上饶县"
          },
          {
            "id": 1055,
            "name": "婺源县"
          },
          {
            "id": 1056,
            "name": "铅山县"
          },
          {
            "id": 1057,
            "name": "三清山"
          },
          {
            "id": 1058,
            "name": "万年县"
          },
          {
            "id": 1059,
            "name": "信州区"
          }]
        },
        "萍乡": {
          "id": 1406,
          "children": [{
            "id": 1406,
            "name": "全部"
          },
          {
            "id": 1407,
            "name": "上栗县"
          },
          {
            "id": 1408,
            "name": "湘东区"
          },
          {
            "id": 1409,
            "name": "莲花县"
          },
          {
            "id": 1410,
            "name": "芦溪县"
          },
          {
            "id": 1414,
            "name": "安源区"
          }]
        },
        "南昌": {
          "id": 1517,
          "children": [{
            "id": 1517,
            "name": "全部"
          },
          {
            "id": 1518,
            "name": "东湖区"
          },
          {
            "id": 1520,
            "name": "西湖区"
          },
          {
            "id": 1521,
            "name": "南昌县"
          },
          {
            "id": 1522,
            "name": "青云谱区"
          },
          {
            "id": 1523,
            "name": "进贤县"
          },
          {
            "id": 1528,
            "name": "湾里区"
          },
          {
            "id": 1529,
            "name": "青山湖区"
          },
          {
            "id": 1533,
            "name": "安义县"
          },
          {
            "id": 1536,
            "name": "近郊"
          },
          {
            "id": 1539,
            "name": "新建区"
          }]
        },
        "景德镇": {
          "id": 1969,
          "children": [{
            "id": 1969,
            "name": "全部"
          },
          {
            "id": 1970,
            "name": "昌江区"
          },
          {
            "id": 1971,
            "name": "乐平市"
          },
          {
            "id": 1973,
            "name": "珠山区"
          },
          {
            "id": 1974,
            "name": "浮梁县"
          }]
        },
        "吉安": {
          "id": 1980,
          "children": [{
            "id": 1980,
            "name": "全部"
          },
          {
            "id": 1981,
            "name": "井冈山市"
          },
          {
            "id": 1982,
            "name": "吉安县"
          },
          {
            "id": 1983,
            "name": "青原区"
          },
          {
            "id": 1984,
            "name": "峡江县"
          },
          {
            "id": 1985,
            "name": "吉水县"
          },
          {
            "id": 1986,
            "name": "新干县"
          },
          {
            "id": 1987,
            "name": "永丰县"
          },
          {
            "id": 1988,
            "name": "泰和县"
          },
          {
            "id": 1989,
            "name": "吉州区"
          },
          {
            "id": 1990,
            "name": "永新县"
          },
          {
            "id": 1991,
            "name": "遂川县"
          },
          {
            "id": 1992,
            "name": "万安县"
          },
          {
            "id": 2001,
            "name": "安福县"
          }]
        },
        "九江": {
          "id": 2020,
          "children": [{
            "id": 2020,
            "name": "全部"
          },
          {
            "id": 2021,
            "name": "开发区"
          },
          {
            "id": 2022,
            "name": "修水县"
          },
          {
            "id": 2024,
            "name": "瑞昌市"
          },
          {
            "id": 2025,
            "name": "柴桑区"
          },
          {
            "id": 2026,
            "name": "浔阳区"
          },
          {
            "id": 2027,
            "name": "濂溪区"
          },
          {
            "id": 2028,
            "name": "德安县"
          },
          {
            "id": 2030,
            "name": "庐山市"
          },
          {
            "id": 2031,
            "name": "都昌县"
          },
          {
            "id": 2032,
            "name": "永修县"
          },
          {
            "id": 2033,
            "name": "湖口县"
          },
          {
            "id": 2034,
            "name": "彭泽县"
          },
          {
            "id": 2036,
            "name": "共青城市"
          },
          {
            "id": 2037,
            "name": "武宁县"
          }]
        },
        "赣州": {
          "id": 2483,
          "children": [{
            "id": 2483,
            "name": "全部"
          },
          {
            "id": 2484,
            "name": "瑞金市"
          },
          {
            "id": 2485,
            "name": "赣县区"
          },
          {
            "id": 2486,
            "name": "信丰县"
          },
          {
            "id": 2487,
            "name": "南康区"
          },
          {
            "id": 2489,
            "name": "大余县"
          },
          {
            "id": 2490,
            "name": "崇义县"
          },
          {
            "id": 2491,
            "name": "上犹县"
          },
          {
            "id": 2492,
            "name": "定南县"
          },
          {
            "id": 2493,
            "name": "龙南县"
          },
          {
            "id": 2494,
            "name": "全南县"
          },
          {
            "id": 2496,
            "name": "宁都县"
          },
          {
            "id": 2497,
            "name": "于都县"
          },
          {
            "id": 2498,
            "name": "章贡区"
          },
          {
            "id": 2499,
            "name": "兴国县"
          },
          {
            "id": 2500,
            "name": "寻乌县"
          },
          {
            "id": 2501,
            "name": "石城县"
          },
          {
            "id": 2502,
            "name": "安远县"
          },
          {
            "id": 2506,
            "name": "会昌县"
          }]
        },
        "抚州": {
          "id": 2569,
          "children": [{
            "id": 2569,
            "name": "全部"
          },
          {
            "id": 2570,
            "name": "南城县"
          },
          {
            "id": 2571,
            "name": "南丰县"
          },
          {
            "id": 2572,
            "name": "黎川县"
          },
          {
            "id": 2573,
            "name": "乐安县"
          },
          {
            "id": 2574,
            "name": "崇仁县"
          },
          {
            "id": 2578,
            "name": "资溪县"
          },
          {
            "id": 2579,
            "name": "宜黄县"
          },
          {
            "id": 2580,
            "name": "广昌县"
          },
          {
            "id": 2581,
            "name": "东乡县"
          },
          {
            "id": 2584,
            "name": "金溪县"
          },
          {
            "id": 2586,
            "name": "临川区"
          }]
        }
      }
    },
    "广西壮族自治区": {
      "id": 363,
      "children": {
        "全部": {
          "id": 363,
          "children": [{
            "id": 363,
            "name": "全部"
          }]
        },
        "玉林": {
          "id": 364,
          "children": [{
            "id": 364,
            "name": "全部"
          },
          {
            "id": 365,
            "name": "兴业县"
          },
          {
            "id": 366,
            "name": "容县"
          },
          {
            "id": 367,
            "name": "陆川县"
          },
          {
            "id": 369,
            "name": "福绵区"
          },
          {
            "id": 370,
            "name": "博白县"
          },
          {
            "id": 373,
            "name": "玉州区"
          },
          {
            "id": 394,
            "name": "北流市"
          }]
        },
        "梧州": {
          "id": 724,
          "children": [{
            "id": 724,
            "name": "全部"
          },
          {
            "id": 725,
            "name": "岑溪市"
          },
          {
            "id": 726,
            "name": "蒙山县"
          },
          {
            "id": 727,
            "name": "长洲区"
          },
          {
            "id": 728,
            "name": "苍梧县"
          },
          {
            "id": 729,
            "name": "万秀区"
          },
          {
            "id": 730,
            "name": "龙圩区"
          },
          {
            "id": 736,
            "name": "藤县"
          }]
        },
        "钦州": {
          "id": 1308,
          "children": [{
            "id": 1308,
            "name": "全部"
          },
          {
            "id": 1309,
            "name": "钦南区"
          },
          {
            "id": 1311,
            "name": "钦北区"
          },
          {
            "id": 1315,
            "name": "灵山县"
          },
          {
            "id": 1319,
            "name": "浦北县"
          }]
        },
        "南宁": {
          "id": 1571,
          "children": [{
            "id": 1571,
            "name": "全部"
          },
          {
            "id": 1572,
            "name": "兴宁区"
          },
          {
            "id": 1575,
            "name": "西乡塘区"
          },
          {
            "id": 1576,
            "name": "近郊"
          },
          {
            "id": 1578,
            "name": "邕宁区"
          },
          {
            "id": 1579,
            "name": "良庆区"
          },
          {
            "id": 1580,
            "name": "青秀区"
          },
          {
            "id": 1581,
            "name": "武鸣区"
          },
          {
            "id": 1582,
            "name": "横县"
          },
          {
            "id": 1583,
            "name": "江南区"
          },
          {
            "id": 1584,
            "name": "上林县"
          },
          {
            "id": 1585,
            "name": "宾阳县"
          },
          {
            "id": 1592,
            "name": "马山县"
          },
          {
            "id": 1593,
            "name": "隆安县"
          }]
        },
        "来宾": {
          "id": 1736,
          "children": [{
            "id": 1736,
            "name": "全部"
          },
          {
            "id": 1737,
            "name": "兴宾区"
          },
          {
            "id": 1740,
            "name": "合山市"
          },
          {
            "id": 1741,
            "name": "忻城县"
          },
          {
            "id": 1749,
            "name": "象州县"
          },
          {
            "id": 1756,
            "name": "金秀瑶族自治县"
          },
          {
            "id": 1762,
            "name": "武宣县"
          }]
        },
        "柳州": {
          "id": 1888,
          "children": [{
            "id": 1888,
            "name": "全部"
          },
          {
            "id": 1889,
            "name": "城中区"
          },
          {
            "id": 1890,
            "name": "柳江县"
          },
          {
            "id": 1891,
            "name": "柳北区"
          },
          {
            "id": 1892,
            "name": "柳城县"
          },
          {
            "id": 1893,
            "name": "鹿寨县"
          },
          {
            "id": 1895,
            "name": "柳南区"
          },
          {
            "id": 1896,
            "name": "融安县"
          },
          {
            "id": 1897,
            "name": "融水苗族自治县"
          },
          {
            "id": 1902,
            "name": "鱼峰区"
          },
          {
            "id": 1907,
            "name": "三江侗族自治县"
          }]
        },
        "贺州": {
          "id": 2197,
          "children": [{
            "id": 2197,
            "name": "全部"
          },
          {
            "id": 2198,
            "name": "平桂区"
          },
          {
            "id": 2199,
            "name": "昭平县"
          },
          {
            "id": 2202,
            "name": "富川瑶族自治县"
          },
          {
            "id": 2205,
            "name": "钟山县"
          },
          {
            "id": 2207,
            "name": "八步区"
          }]
        },
        "河池": {
          "id": 2210,
          "children": [{
            "id": 2210,
            "name": "全部"
          },
          {
            "id": 2211,
            "name": "金城江区"
          },
          {
            "id": 2215,
            "name": "南丹县"
          },
          {
            "id": 2216,
            "name": "宜州区"
          },
          {
            "id": 2217,
            "name": "天峨县"
          },
          {
            "id": 2218,
            "name": "东兰县"
          },
          {
            "id": 2219,
            "name": "凤山县"
          },
          {
            "id": 2220,
            "name": "都安瑶族自治县"
          },
          {
            "id": 2224,
            "name": "罗城县"
          },
          {
            "id": 2225,
            "name": "巴马瑶族自治县"
          },
          {
            "id": 2226,
            "name": "大化瑶族自治县"
          },
          {
            "id": 2227,
            "name": "环江县"
          }]
        },
        "贵港": {
          "id": 2477,
          "children": [{
            "id": 2477,
            "name": "全部"
          },
          {
            "id": 2478,
            "name": "港南区"
          },
          {
            "id": 2480,
            "name": "覃塘区"
          },
          {
            "id": 2482,
            "name": "桂平市"
          },
          {
            "id": 2488,
            "name": "港北区"
          },
          {
            "id": 2495,
            "name": "平南县"
          }]
        },
        "桂林": {
          "id": 2512,
          "children": [{
            "id": 2512,
            "name": "全部"
          },
          {
            "id": 2513,
            "name": "七星区"
          },
          {
            "id": 2516,
            "name": "象山区"
          },
          {
            "id": 2517,
            "name": "秀峰区"
          },
          {
            "id": 2523,
            "name": "叠彩区"
          },
          {
            "id": 2526,
            "name": "雁山区"
          },
          {
            "id": 2528,
            "name": "临桂区"
          },
          {
            "id": 2530,
            "name": "灵川县"
          },
          {
            "id": 2533,
            "name": "永福县"
          },
          {
            "id": 2534,
            "name": "灌阳县"
          },
          {
            "id": 2535,
            "name": "兴安县"
          },
          {
            "id": 2537,
            "name": "全州县"
          },
          {
            "id": 2538,
            "name": "阳朔县"
          },
          {
            "id": 2539,
            "name": "平乐县"
          },
          {
            "id": 2541,
            "name": "资源县"
          },
          {
            "id": 2542,
            "name": "荔浦县"
          },
          {
            "id": 2543,
            "name": "龙胜各族自治县"
          },
          {
            "id": 2547,
            "name": "恭城瑶族自治县"
          }]
        },
        "防城港": {
          "id": 2548,
          "children": [{
            "id": 2548,
            "name": "全部"
          },
          {
            "id": 2549,
            "name": "港口区"
          },
          {
            "id": 2550,
            "name": "东兴市"
          },
          {
            "id": 2552,
            "name": "上思县"
          },
          {
            "id": 2564,
            "name": "防城区"
          }]
        },
        "崇左": {
          "id": 2773,
          "children": [{
            "id": 2773,
            "name": "全部"
          },
          {
            "id": 2774,
            "name": "扶绥县"
          },
          {
            "id": 2775,
            "name": "龙州县"
          },
          {
            "id": 2776,
            "name": "江州区"
          },
          {
            "id": 2777,
            "name": "宁明县"
          },
          {
            "id": 2779,
            "name": "凭祥市"
          },
          {
            "id": 2782,
            "name": "大新县"
          },
          {
            "id": 2788,
            "name": "天等县"
          }]
        },
        "北海": {
          "id": 3005,
          "children": [{
            "id": 3005,
            "name": "全部"
          },
          {
            "id": 3006,
            "name": "银海区"
          },
          {
            "id": 3007,
            "name": "铁山港区"
          },
          {
            "id": 3008,
            "name": "合浦县"
          },
          {
            "id": 3021,
            "name": "海城区"
          }]
        },
        "百色": {
          "id": 3087,
          "children": [{
            "id": 3087,
            "name": "全部"
          },
          {
            "id": 3088,
            "name": "田阳县"
          },
          {
            "id": 3091,
            "name": "田东县"
          },
          {
            "id": 3092,
            "name": "德保县"
          },
          {
            "id": 3093,
            "name": "平果县"
          },
          {
            "id": 3097,
            "name": "靖西市"
          },
          {
            "id": 3100,
            "name": "右江区"
          },
          {
            "id": 3101,
            "name": "凌云县"
          },
          {
            "id": 3104,
            "name": "田林县"
          },
          {
            "id": 3109,
            "name": "乐业县"
          },
          {
            "id": 3110,
            "name": "西林县"
          },
          {
            "id": 3112,
            "name": "那坡县"
          },
          {
            "id": 3115,
            "name": "隆林各族自治县"
          }]
        }
      }
    },
    "湖北省": {
      "id": 450,
      "children": {
        "全部": {
          "id": 450,
          "children": [{
            "id": 450,
            "name": "全部"
          }]
        },
        "宜昌": {
          "id": 451,
          "children": [{
            "id": 451,
            "name": "全部"
          },
          {
            "id": 452,
            "name": "西陵区"
          },
          {
            "id": 453,
            "name": "伍家岗区"
          },
          {
            "id": 457,
            "name": "猇亭区"
          },
          {
            "id": 458,
            "name": "点军区"
          },
          {
            "id": 459,
            "name": "夷陵区"
          },
          {
            "id": 460,
            "name": "枝江市"
          },
          {
            "id": 464,
            "name": "宜都市"
          },
          {
            "id": 466,
            "name": "远安县"
          },
          {
            "id": 469,
            "name": "当阳市"
          },
          {
            "id": 472,
            "name": "长阳县"
          },
          {
            "id": 473,
            "name": "五峰县"
          },
          {
            "id": 483,
            "name": "秭归县"
          },
          {
            "id": 485,
            "name": "兴山县"
          }]
        },
        "咸宁": {
          "id": 538,
          "children": [{
            "id": 538,
            "name": "全部"
          },
          {
            "id": 539,
            "name": "咸安区"
          },
          {
            "id": 540,
            "name": "赤壁市"
          },
          {
            "id": 541,
            "name": "嘉鱼县"
          },
          {
            "id": 544,
            "name": "通城县"
          },
          {
            "id": 546,
            "name": "通山县"
          },
          {
            "id": 552,
            "name": "崇阳县"
          }]
        },
        "仙桃": {
          "id": 542,
          "children": [{
            "id": 542,
            "name": "全部"
          },
          {
            "id": 543,
            "name": "文化步行街"
          },
          {
            "id": 547,
            "name": "中百广场\/客运站"
          },
          {
            "id": 550,
            "name": "富迪三友生活广场"
          },
          {
            "id": 551,
            "name": "商城大厦\/大新路"
          },
          {
            "id": 556,
            "name": "张沟镇"
          },
          {
            "id": 557,
            "name": "武商仙桃购物中心"
          },
          {
            "id": 559,
            "name": "汉江大桥"
          },
          {
            "id": 561,
            "name": "钱沟路"
          },
          {
            "id": 562,
            "name": "市中心"
          },
          {
            "id": 563,
            "name": "刘口沔街\/一中"
          },
          {
            "id": 564,
            "name": "新街"
          },
          {
            "id": 565,
            "name": "彭场镇"
          },
          {
            "id": 572,
            "name": "新天地国际广场\/沃尔玛"
          }]
        },
        "孝感": {
          "id": 569,
          "children": [{
            "id": 569,
            "name": "全部"
          },
          {
            "id": 570,
            "name": "汉川市"
          },
          {
            "id": 575,
            "name": "孝南区"
          },
          {
            "id": 576,
            "name": "孝昌县"
          },
          {
            "id": 577,
            "name": "大悟县"
          },
          {
            "id": 578,
            "name": "应城市"
          },
          {
            "id": 580,
            "name": "安陆市"
          },
          {
            "id": 607,
            "name": "云梦县"
          }]
        },
        "武汉": {
          "id": 822,
          "children": [{
            "id": 822,
            "name": "全部"
          },
          {
            "id": 823,
            "name": "汉阳区"
          },
          {
            "id": 825,
            "name": "武昌区"
          },
          {
            "id": 826,
            "name": "东西湖区"
          },
          {
            "id": 827,
            "name": "江汉区"
          },
          {
            "id": 828,
            "name": "江岸区"
          },
          {
            "id": 829,
            "name": "黄陂区"
          },
          {
            "id": 830,
            "name": "汉南区"
          },
          {
            "id": 831,
            "name": "洪山区"
          },
          {
            "id": 832,
            "name": "近郊"
          },
          {
            "id": 833,
            "name": "蔡甸区"
          },
          {
            "id": 834,
            "name": "新洲区"
          },
          {
            "id": 838,
            "name": "青山区"
          },
          {
            "id": 852,
            "name": "硚口区"
          },
          {
            "id": 853,
            "name": "江夏区"
          }]
        },
        "随州": {
          "id": 1007,
          "children": [{
            "id": 1007,
            "name": "全部"
          },
          {
            "id": 1008,
            "name": "曾都区"
          },
          {
            "id": 1019,
            "name": "广水市"
          },
          {
            "id": 1028,
            "name": "随县"
          }]
        },
        "十堰": {
          "id": 1074,
          "children": [{
            "id": 1074,
            "name": "全部"
          },
          {
            "id": 1075,
            "name": "张湾区"
          },
          {
            "id": 1085,
            "name": "丹江口市"
          },
          {
            "id": 1087,
            "name": "茅箭区"
          },
          {
            "id": 1091,
            "name": "郧阳区"
          },
          {
            "id": 1094,
            "name": "房县"
          },
          {
            "id": 1096,
            "name": "竹山县"
          },
          {
            "id": 1105,
            "name": "郧西县"
          },
          {
            "id": 1107,
            "name": "武当山"
          },
          {
            "id": 1110,
            "name": "竹溪县"
          }]
        },
        "潜江": {
          "id": 1291,
          "children": [{
            "id": 1291,
            "name": "全部"
          },
          {
            "id": 1292,
            "name": "广华"
          },
          {
            "id": 1295,
            "name": "新时代广场"
          },
          {
            "id": 1296,
            "name": "水牛城"
          },
          {
            "id": 1297,
            "name": "中百广场"
          },
          {
            "id": 1298,
            "name": "五七向阳"
          },
          {
            "id": 1299,
            "name": "东风路"
          },
          {
            "id": 1300,
            "name": "虾街"
          },
          {
            "id": 1301,
            "name": "常青藤城市广场"
          },
          {
            "id": 1302,
            "name": "江汉艺术学院"
          },
          {
            "id": 1303,
            "name": "汽车站"
          },
          {
            "id": 1304,
            "name": "曹禺公园"
          },
          {
            "id": 1305,
            "name": "市政府"
          },
          {
            "id": 1306,
            "name": "金桥广场"
          },
          {
            "id": 1310,
            "name": "中心城"
          }]
        },
        "黄冈": {
          "id": 2258,
          "children": [{
            "id": 2258,
            "name": "全部"
          },
          {
            "id": 2259,
            "name": "罗田县"
          },
          {
            "id": 2260,
            "name": "英山县"
          },
          {
            "id": 2262,
            "name": "武穴市"
          },
          {
            "id": 2263,
            "name": "黄州区"
          },
          {
            "id": 2264,
            "name": "浠水县"
          },
          {
            "id": 2265,
            "name": "蕲春县"
          },
          {
            "id": 2267,
            "name": "黄梅县"
          },
          {
            "id": 2268,
            "name": "团风县"
          },
          {
            "id": 2269,
            "name": "红安县"
          },
          {
            "id": 2275,
            "name": "麻城市"
          }]
        },
        "黄石": {
          "id": 2273,
          "children": [{
            "id": 2273,
            "name": "全部"
          },
          {
            "id": 2274,
            "name": "西塞山区"
          },
          {
            "id": 2277,
            "name": "下陆区"
          },
          {
            "id": 2279,
            "name": "铁山区"
          },
          {
            "id": 2280,
            "name": "黄石港区"
          },
          {
            "id": 2282,
            "name": "黄石经济开发区"
          },
          {
            "id": 2283,
            "name": "阳新县"
          },
          {
            "id": 2284,
            "name": "大冶市"
          }]
        },
        "鄂州": {
          "id": 2616,
          "children": [{
            "id": 2616,
            "name": "全部"
          },
          {
            "id": 2617,
            "name": "梁子湖区"
          },
          {
            "id": 2618,
            "name": "鄂城区"
          },
          {
            "id": 2619,
            "name": "华容区"
          }]
        },
        "荆门": {
          "id": 3131,
          "children": [{
            "id": 3131,
            "name": "全部"
          },
          {
            "id": 3132,
            "name": "沙洋县"
          },
          {
            "id": 3133,
            "name": "掇刀区"
          },
          {
            "id": 3134,
            "name": "钟祥市"
          },
          {
            "id": 3135,
            "name": "东宝区"
          },
          {
            "id": 3136,
            "name": "京山县"
          }]
        },
        "天门": {
          "id": 3175,
          "children": [{
            "id": 3175,
            "name": "全部"
          },
          {
            "id": 3176,
            "name": "陆羽广场"
          },
          {
            "id": 3178,
            "name": "西门"
          },
          {
            "id": 3180,
            "name": "罗马商城\/胜利二路"
          },
          {
            "id": 3181,
            "name": "侨乡客运站"
          },
          {
            "id": 3183,
            "name": "新城区"
          },
          {
            "id": 3186,
            "name": "陆羽公园"
          }]
        }
      }
    },
    "青海省": {
      "id": 581,
      "children": {
        "全部": {
          "id": 581,
          "children": [{
            "id": 581,
            "name": "全部"
          }]
        },
        "西宁": {
          "id": 582,
          "children": [{
            "id": 582,
            "name": "全部"
          },
          {
            "id": 583,
            "name": "城西区"
          },
          {
            "id": 586,
            "name": "城中区"
          },
          {
            "id": 588,
            "name": "湟源县"
          },
          {
            "id": 589,
            "name": "城北区"
          },
          {
            "id": 591,
            "name": "大通县"
          },
          {
            "id": 592,
            "name": "城东区"
          },
          {
            "id": 593,
            "name": "湟中县"
          }]
        },
        "海西": {
          "id": 2112,
          "children": [{
            "id": 2112,
            "name": "全部"
          },
          {
            "id": 2113,
            "name": "德令哈市"
          },
          {
            "id": 2124,
            "name": "乌兰县"
          },
          {
            "id": 2128,
            "name": "格尔木市"
          },
          {
            "id": 2130,
            "name": "天峻县"
          },
          {
            "id": 2135,
            "name": "都兰县"
          },
          {
            "id": 2139,
            "name": "海西蒙古族藏族自治州直辖"
          }]
        },
        "海北": {
          "id": 2114,
          "children": [{
            "id": 2114,
            "name": "全部"
          },
          {
            "id": 2115,
            "name": "海晏县"
          },
          {
            "id": 2120,
            "name": "祁连县"
          },
          {
            "id": 2129,
            "name": "刚察县"
          },
          {
            "id": 2131,
            "name": "门源回族自治县"
          }]
        },
        "黄南": {
          "id": 2126,
          "children": [{
            "id": 2126,
            "name": "全部"
          },
          {
            "id": 2127,
            "name": "同仁县"
          },
          {
            "id": 2132,
            "name": "尖扎县"
          },
          {
            "id": 2138,
            "name": "泽库县"
          },
          {
            "id": 2140,
            "name": "河南县"
          }]
        },
        "海东": {
          "id": 2152,
          "children": [{
            "id": 2152,
            "name": "全部"
          },
          {
            "id": 2153,
            "name": "平安区"
          },
          {
            "id": 2156,
            "name": "乐都区"
          },
          {
            "id": 2158,
            "name": "民和县"
          },
          {
            "id": 2159,
            "name": "化隆回族自治县"
          },
          {
            "id": 2160,
            "name": "互助土族自治县"
          },
          {
            "id": 2161,
            "name": "循化县"
          }]
        },
        "果洛": {
          "id": 2431,
          "children": [{
            "id": 2431,
            "name": "全部"
          },
          {
            "id": 2432,
            "name": "玛沁县"
          },
          {
            "id": 2433,
            "name": "班玛县"
          },
          {
            "id": 2434,
            "name": "甘德县"
          },
          {
            "id": 2435,
            "name": "久治县"
          },
          {
            "id": 2436,
            "name": "玛多县"
          },
          {
            "id": 2442,
            "name": "达日县"
          }]
        }
      }
    },
    "海南省": {
      "id": 674,
      "children": {
        "全部": {
          "id": 674,
          "children": [{
            "id": 674,
            "name": "全部"
          }]
        },
        "万宁": {
          "id": 675,
          "children": [{
            "id": 675,
            "name": "全部"
          },
          {
            "id": 676,
            "name": "椰林湾"
          },
          {
            "id": 677,
            "name": "兴隆"
          },
          {
            "id": 678,
            "name": "人民中路"
          },
          {
            "id": 679,
            "name": "万州大道"
          },
          {
            "id": 680,
            "name": "神州半岛度假区"
          },
          {
            "id": 681,
            "name": "文明中路"
          },
          {
            "id": 682,
            "name": "环市一路"
          },
          {
            "id": 684,
            "name": "侨隆商业广场"
          },
          {
            "id": 685,
            "name": "石梅湾"
          },
          {
            "id": 686,
            "name": "日月湾"
          },
          {
            "id": 687,
            "name": "红砖西路"
          },
          {
            "id": 688,
            "name": "兴隆热带植物园"
          },
          {
            "id": 689,
            "name": "光明南路"
          },
          {
            "id": 690,
            "name": "环市二路"
          },
          {
            "id": 691,
            "name": "环市三东路"
          },
          {
            "id": 692,
            "name": "环市三西路"
          },
          {
            "id": 695,
            "name": "建设路"
          },
          {
            "id": 699,
            "name": "火车站"
          },
          {
            "id": 710,
            "name": "兴隆温泉景区"
          }]
        },
        "文昌": {
          "id": 693,
          "children": [{
            "id": 693,
            "name": "全部"
          },
          {
            "id": 694,
            "name": "铜鼓岭"
          },
          {
            "id": 696,
            "name": "文昌公园"
          },
          {
            "id": 697,
            "name": "汇昌路"
          },
          {
            "id": 698,
            "name": "文昌大道"
          },
          {
            "id": 700,
            "name": "庆龄路"
          },
          {
            "id": 701,
            "name": "罐头厂"
          },
          {
            "id": 702,
            "name": "教育路"
          },
          {
            "id": 703,
            "name": "和平路"
          },
          {
            "id": 704,
            "name": "文建路"
          },
          {
            "id": 705,
            "name": "东郊椰林风景名胜区"
          },
          {
            "id": 706,
            "name": "环球码头"
          },
          {
            "id": 707,
            "name": "高隆湾"
          },
          {
            "id": 708,
            "name": "铜鼓岭国家级自然保护区"
          },
          {
            "id": 709,
            "name": "会文佛珠交易市场"
          },
          {
            "id": 711,
            "name": "文清大道"
          },
          {
            "id": 714,
            "name": "白金海岸"
          },
          {
            "id": 722,
            "name": "碧海椰都度假区"
          }]
        },
        "屯昌县": {
          "id": 835,
          "children": [{
            "id": 835,
            "name": "全部"
          },
          {
            "id": 836,
            "name": "屯昌县政府"
          },
          {
            "id": 837,
            "name": "城南客运站"
          },
          {
            "id": 839,
            "name": "亿万家商厦"
          },
          {
            "id": 840,
            "name": "金盛达商务广场"
          },
          {
            "id": 841,
            "name": "明珠广场"
          },
          {
            "id": 842,
            "name": "屯昌县公安局"
          },
          {
            "id": 843,
            "name": "文体公园"
          },
          {
            "id": 855,
            "name": "屯昌车站"
          }]
        },
        "三亚": {
          "id": 1133,
          "children": [{
            "id": 1133,
            "name": "全部"
          },
          {
            "id": 1134,
            "name": "海棠区"
          },
          {
            "id": 1141,
            "name": "吉阳区"
          },
          {
            "id": 1146,
            "name": "保亭县"
          },
          {
            "id": 1147,
            "name": "五指山市"
          },
          {
            "id": 1153,
            "name": "天涯区"
          },
          {
            "id": 1160,
            "name": "崖州区"
          }]
        },
        "琼中": {
          "id": 1227,
          "children": [{
            "id": 1227,
            "name": "全部"
          },
          {
            "id": 1228,
            "name": "琼中汽车站"
          },
          {
            "id": 1229,
            "name": "百花岭风景区"
          },
          {
            "id": 1230,
            "name": "琼中湿地公园"
          },
          {
            "id": 1231,
            "name": "琼中县政府"
          },
          {
            "id": 1232,
            "name": "山兰大厦"
          },
          {
            "id": 1237,
            "name": "氧立方森林公园"
          },
          {
            "id": 1240,
            "name": "什云村"
          }]
        },
        "琼海": {
          "id": 1247,
          "children": [{
            "id": 1247,
            "name": "全部"
          },
          {
            "id": 1248,
            "name": "博鳌"
          },
          {
            "id": 1253,
            "name": "爱华东路"
          },
          {
            "id": 1255,
            "name": "爱华西路"
          },
          {
            "id": 1257,
            "name": "元亨街"
          },
          {
            "id": 1258,
            "name": "百佳汇超市"
          },
          {
            "id": 1259,
            "name": "汽车站"
          },
          {
            "id": 1262,
            "name": "德海路"
          },
          {
            "id": 1264,
            "name": "金海路"
          },
          {
            "id": 1265,
            "name": "银海路"
          },
          {
            "id": 1266,
            "name": "潭门镇"
          },
          {
            "id": 1268,
            "name": "万泉镇"
          },
          {
            "id": 1271,
            "name": "兴海路"
          },
          {
            "id": 1272,
            "name": "亚洲湾"
          },
          {
            "id": 1273,
            "name": "龙寿洋万亩田野公园"
          },
          {
            "id": 1277,
            "name": "嘉积镇"
          },
          {
            "id": 1279,
            "name": "官塘镇"
          },
          {
            "id": 1288,
            "name": "博鳌亚洲论坛永久会址"
          }]
        },
        "临高县": {
          "id": 1654,
          "children": [{
            "id": 1654,
            "name": "全部"
          },
          {
            "id": 1655,
            "name": "临高汽车站"
          },
          {
            "id": 1657,
            "name": "文澜文化公园"
          },
          {
            "id": 1658,
            "name": "欧凯生活广场"
          },
          {
            "id": 1659,
            "name": "临高县政府"
          },
          {
            "id": 1662,
            "name": "临高南站"
          },
          {
            "id": 1663,
            "name": "碧桂园金沙滩"
          },
          {
            "id": 1666,
            "name": "东城镇"
          }]
        },
        "乐东": {
          "id": 1660,
          "children": [{
            "id": 1660,
            "name": "全部"
          },
          {
            "id": 1661,
            "name": "尖峰岭"
          },
          {
            "id": 1664,
            "name": "莺歌海盐场"
          },
          {
            "id": 1665,
            "name": "海南省第三医院乐东分院"
          },
          {
            "id": 1668,
            "name": "乐东党校"
          },
          {
            "id": 1670,
            "name": "乐东商业步行街"
          }]
        },
        "陵水": {
          "id": 1671,
          "children": [{
            "id": 1671,
            "name": "全部"
          },
          {
            "id": 1672,
            "name": "海韵广场"
          },
          {
            "id": 1673,
            "name": "香水湾"
          },
          {
            "id": 1674,
            "name": "中心大道"
          },
          {
            "id": 1675,
            "name": "文化路"
          },
          {
            "id": 1676,
            "name": "新村镇"
          },
          {
            "id": 1677,
            "name": "清水湾"
          },
          {
            "id": 1678,
            "name": "建设路"
          },
          {
            "id": 1679,
            "name": "英州镇"
          },
          {
            "id": 1680,
            "name": "分界洲"
          },
          {
            "id": 1686,
            "name": "海棠湾"
          },
          {
            "id": 1690,
            "name": "汇丰广场"
          }]
        },
        "海口": {
          "id": 2312,
          "children": [{
            "id": 2312,
            "name": "全部"
          },
          {
            "id": 2313,
            "name": "秀英区"
          },
          {
            "id": 2317,
            "name": "琼山区"
          },
          {
            "id": 2318,
            "name": "美兰区"
          },
          {
            "id": 2319,
            "name": "白沙县"
          },
          {
            "id": 2320,
            "name": "定安县"
          },
          {
            "id": 2321,
            "name": "昌江县"
          },
          {
            "id": 2323,
            "name": "龙华区"
          },
          {
            "id": 2326,
            "name": "临高县"
          },
          {
            "id": 2327,
            "name": "澄迈县"
          },
          {
            "id": 2329,
            "name": "屯昌县"
          },
          {
            "id": 2330,
            "name": "琼海市"
          },
          {
            "id": 2331,
            "name": "东方市"
          },
          {
            "id": 2335,
            "name": "文昌市"
          },
          {
            "id": 2339,
            "name": "儋州市"
          }]
        },
        "东方": {
          "id": 2646,
          "children": [{
            "id": 2646,
            "name": "全部"
          },
          {
            "id": 2647,
            "name": "华人国际商城"
          },
          {
            "id": 2649,
            "name": "解放西路"
          },
          {
            "id": 2651,
            "name": "东海路"
          },
          {
            "id": 2652,
            "name": "琼西路"
          },
          {
            "id": 2653,
            "name": "三角公园"
          },
          {
            "id": 2654,
            "name": "滨海南路"
          },
          {
            "id": 2655,
            "name": "滨海北路"
          },
          {
            "id": 2656,
            "name": "东方大道"
          },
          {
            "id": 2657,
            "name": "二环北路"
          },
          {
            "id": 2658,
            "name": "二环南路"
          },
          {
            "id": 2659,
            "name": "永安西路"
          },
          {
            "id": 2660,
            "name": "滨海西路"
          },
          {
            "id": 2661,
            "name": "永安东路"
          },
          {
            "id": 2662,
            "name": "鱼鳞洲风景区"
          }]
        },
        "澄迈县": {
          "id": 2780,
          "children": [{
            "id": 2780,
            "name": "全部"
          },
          {
            "id": 2781,
            "name": "澄迈县委党校"
          },
          {
            "id": 2783,
            "name": "金山寺景区"
          },
          {
            "id": 2784,
            "name": "欧凯生活购物广场"
          },
          {
            "id": 2785,
            "name": "金江客运站"
          },
          {
            "id": 2786,
            "name": "澄迈老城镇"
          },
          {
            "id": 2787,
            "name": "福山镇"
          },
          {
            "id": 2793,
            "name": "盈滨半岛"
          }]
        },
        "定安县": {
          "id": 3113,
          "children": [{
            "id": 3113,
            "name": "全部"
          },
          {
            "id": 3114,
            "name": "天安购物广场"
          },
          {
            "id": 3117,
            "name": "安定县政府"
          }]
        }
      }
    },
    "新疆维吾尔自治区": {
      "id": 776,
      "children": {
        "全部": {
          "id": 776,
          "children": [{
            "id": 776,
            "name": "全部"
          }]
        },
        "乌鲁木齐": {
          "id": 777,
          "children": [{
            "id": 777,
            "name": "全部"
          },
          {
            "id": 778,
            "name": "沙依巴克区"
          },
          {
            "id": 783,
            "name": "新市区"
          },
          {
            "id": 786,
            "name": "乌鲁木齐县"
          },
          {
            "id": 787,
            "name": "天山区"
          },
          {
            "id": 789,
            "name": "水磨沟区"
          },
          {
            "id": 791,
            "name": "近郊"
          },
          {
            "id": 792,
            "name": "达坂城区"
          },
          {
            "id": 793,
            "name": "米东区"
          },
          {
            "id": 795,
            "name": "头屯河区"
          }]
        },
        "石河子": {
          "id": 1013,
          "children": [{
            "id": 1013,
            "name": "全部"
          },
          {
            "id": 1014,
            "name": "向阳街道"
          },
          {
            "id": 1015,
            "name": "红山街道"
          },
          {
            "id": 1016,
            "name": "新城街道"
          },
          {
            "id": 1020,
            "name": "东城街道"
          },
          {
            "id": 1021,
            "name": "老街街道"
          },
          {
            "id": 1023,
            "name": "石河子乡"
          },
          {
            "id": 1027,
            "name": "开发区"
          },
          {
            "id": 1036,
            "name": "北泉镇"
          }]
        },
        "喀什地区": {
          "id": 1921,
          "children": [{
            "id": 1921,
            "name": "全部"
          },
          {
            "id": 1922,
            "name": "泽普县"
          },
          {
            "id": 1923,
            "name": "莎车县"
          },
          {
            "id": 1924,
            "name": "喀什市"
          },
          {
            "id": 1925,
            "name": "疏勒县"
          },
          {
            "id": 1926,
            "name": "岳普湖县"
          },
          {
            "id": 1927,
            "name": "叶城县"
          },
          {
            "id": 1928,
            "name": "麦盖提县"
          },
          {
            "id": 1929,
            "name": "疏附县"
          },
          {
            "id": 1930,
            "name": "巴楚县"
          },
          {
            "id": 1931,
            "name": "塔县"
          },
          {
            "id": 1937,
            "name": "伽师县"
          },
          {
            "id": 1939,
            "name": "英吉沙县"
          }]
        }
      }
    },
    "台湾省": {
      "id": 844,
      "children": {
        "全部": {
          "id": 844,
          "children": [{
            "id": 844,
            "name": "全部"
          }]
        },
        "台湾": {
          "id": 845,
          "children": [{
            "id": 845,
            "name": "全部"
          },
          {
            "id": 846,
            "name": "新北"
          },
          {
            "id": 847,
            "name": "台中"
          },
          {
            "id": 848,
            "name": "宜兰"
          },
          {
            "id": 849,
            "name": "南投"
          },
          {
            "id": 850,
            "name": "高雄"
          },
          {
            "id": 851,
            "name": "屏东"
          },
          {
            "id": 854,
            "name": "彰化"
          },
          {
            "id": 856,
            "name": "台东"
          },
          {
            "id": 857,
            "name": "新竹市"
          },
          {
            "id": 858,
            "name": "台北"
          },
          {
            "id": 859,
            "name": "花莲"
          },
          {
            "id": 860,
            "name": "嘉义市"
          },
          {
            "id": 861,
            "name": "苗栗"
          },
          {
            "id": 862,
            "name": "基隆"
          },
          {
            "id": 863,
            "name": "澎湖"
          },
          {
            "id": 864,
            "name": "台南"
          },
          {
            "id": 865,
            "name": "桃园"
          }]
        }
      }
    },
    "天津市": {
      "id": 905,
      "children": {
        "全部": {
          "id": 905,
          "children": [{
            "id": 905,
            "name": "全部"
          }]
        },
        "天津": {
          "id": 906,
          "children": [{
            "id": 906,
            "name": "全部"
          },
          {
            "id": 907,
            "name": "滨海新区"
          },
          {
            "id": 912,
            "name": "和平区"
          },
          {
            "id": 919,
            "name": "河东区"
          },
          {
            "id": 921,
            "name": "河北区"
          },
          {
            "id": 922,
            "name": "河西区"
          },
          {
            "id": 924,
            "name": "南开区"
          },
          {
            "id": 925,
            "name": "红桥区"
          },
          {
            "id": 929,
            "name": "北辰区"
          },
          {
            "id": 931,
            "name": "津南区"
          },
          {
            "id": 932,
            "name": "东丽区"
          },
          {
            "id": 933,
            "name": "宝坻区"
          },
          {
            "id": 934,
            "name": "静海区"
          },
          {
            "id": 942,
            "name": "宁河区"
          },
          {
            "id": 945,
            "name": "西青区"
          },
          {
            "id": 948,
            "name": "蓟州区"
          },
          {
            "id": 952,
            "name": "武清区"
          }]
        }
      }
    },
    "西藏自治区": {
      "id": 935,
      "children": {
        "全部": {
          "id": 935,
          "children": [{
            "id": 935,
            "name": "全部"
          }]
        },
        "山南": {
          "id": 936,
          "children": [{
            "id": 936,
            "name": "全部"
          },
          {
            "id": 937,
            "name": "乃东区"
          },
          {
            "id": 940,
            "name": "扎囊县"
          },
          {
            "id": 941,
            "name": "桑日县"
          },
          {
            "id": 943,
            "name": "琼结县"
          },
          {
            "id": 944,
            "name": "曲松县"
          },
          {
            "id": 946,
            "name": "措美县"
          },
          {
            "id": 947,
            "name": "加查县"
          },
          {
            "id": 949,
            "name": "隆子县"
          },
          {
            "id": 950,
            "name": "贡嘎县"
          },
          {
            "id": 951,
            "name": "错那县"
          },
          {
            "id": 953,
            "name": "洛扎县"
          },
          {
            "id": 964,
            "name": "浪卡子县"
          }]
        },
        "那曲": {
          "id": 1454,
          "children": [{
            "id": 1454,
            "name": "全部"
          },
          {
            "id": 1455,
            "name": "色尼区"
          },
          {
            "id": 1462,
            "name": "嘉黎县"
          },
          {
            "id": 1465,
            "name": "安多县"
          },
          {
            "id": 1466,
            "name": "申扎县"
          },
          {
            "id": 1467,
            "name": "聂荣县"
          },
          {
            "id": 1468,
            "name": "比如县"
          },
          {
            "id": 1470,
            "name": "索县"
          },
          {
            "id": 1475,
            "name": "双湖县"
          },
          {
            "id": 1476,
            "name": "班戈县"
          },
          {
            "id": 1477,
            "name": "尼玛县"
          },
          {
            "id": 1482,
            "name": "巴青县"
          }]
        },
        "林芝": {
          "id": 1637,
          "children": [{
            "id": 1637,
            "name": "全部"
          },
          {
            "id": 1638,
            "name": "工布江达县"
          },
          {
            "id": 1640,
            "name": "墨脱县"
          },
          {
            "id": 1641,
            "name": "波密县"
          },
          {
            "id": 1642,
            "name": "巴宜区"
          },
          {
            "id": 1643,
            "name": "米林县"
          },
          {
            "id": 1644,
            "name": "朗县"
          },
          {
            "id": 1648,
            "name": "察隅县"
          }]
        },
        "拉萨": {
          "id": 1775,
          "children": [{
            "id": 1775,
            "name": "全部"
          },
          {
            "id": 1776,
            "name": "林周县"
          },
          {
            "id": 1779,
            "name": "当雄县"
          },
          {
            "id": 1784,
            "name": "城关区"
          },
          {
            "id": 1786,
            "name": "堆龙德庆县"
          },
          {
            "id": 1794,
            "name": "墨竹工卡县"
          },
          {
            "id": 1798,
            "name": "曲水县"
          },
          {
            "id": 1799,
            "name": "尼木县"
          },
          {
            "id": 1817,
            "name": "达孜县"
          }]
        },
        "昌都": {
          "id": 2753,
          "children": [{
            "id": 2753,
            "name": "全部"
          },
          {
            "id": 2754,
            "name": "卡若区"
          },
          {
            "id": 2759,
            "name": "江达县"
          },
          {
            "id": 2762,
            "name": "贡觉县"
          },
          {
            "id": 2763,
            "name": "类乌齐县"
          },
          {
            "id": 2765,
            "name": "丁青县"
          },
          {
            "id": 2766,
            "name": "左贡县"
          },
          {
            "id": 2768,
            "name": "八宿县"
          },
          {
            "id": 2769,
            "name": "芒康县"
          },
          {
            "id": 2770,
            "name": "边坝县"
          },
          {
            "id": 2771,
            "name": "察雅县"
          },
          {
            "id": 2789,
            "name": "洛隆县"
          }]
        },
        "阿里": {
          "id": 3102,
          "children": [{
            "id": 3102,
            "name": "全部"
          },
          {
            "id": 3103,
            "name": "普兰县"
          },
          {
            "id": 3105,
            "name": "札达县"
          },
          {
            "id": 3106,
            "name": "革吉县"
          },
          {
            "id": 3107,
            "name": "日土县"
          },
          {
            "id": 3108,
            "name": "改则县"
          },
          {
            "id": 3111,
            "name": "措勤县"
          },
          {
            "id": 3116,
            "name": "噶尔县"
          }]
        }
      }
    },
    "黑龙江省": {
      "id": 1001,
      "children": {
        "全部": {
          "id": 1001,
          "children": [{
            "id": 1001,
            "name": "全部"
          }]
        },
        "双鸭山": {
          "id": 1002,
          "children": [{
            "id": 1002,
            "name": "全部"
          },
          {
            "id": 1003,
            "name": "岭东区"
          },
          {
            "id": 1005,
            "name": "尖山区"
          },
          {
            "id": 1006,
            "name": "宝山区"
          },
          {
            "id": 1009,
            "name": "四方台区"
          },
          {
            "id": 1017,
            "name": "集贤县"
          },
          {
            "id": 1018,
            "name": "友谊县"
          },
          {
            "id": 1022,
            "name": "宝清县"
          },
          {
            "id": 1024,
            "name": "饶河县"
          }]
        },
        "绥化": {
          "id": 1033,
          "children": [{
            "id": 1033,
            "name": "全部"
          },
          {
            "id": 1034,
            "name": "肇东市"
          },
          {
            "id": 1035,
            "name": "望奎县"
          },
          {
            "id": 1038,
            "name": "庆安县"
          },
          {
            "id": 1039,
            "name": "海伦市"
          },
          {
            "id": 1040,
            "name": "兰西县"
          },
          {
            "id": 1041,
            "name": "青冈县"
          },
          {
            "id": 1042,
            "name": "安达市"
          },
          {
            "id": 1043,
            "name": "绥棱县"
          },
          {
            "id": 1047,
            "name": "明水县"
          },
          {
            "id": 1049,
            "name": "北林区"
          }]
        },
        "齐齐哈尔": {
          "id": 1312,
          "children": [{
            "id": 1312,
            "name": "全部"
          },
          {
            "id": 1313,
            "name": "龙沙区"
          },
          {
            "id": 1314,
            "name": "铁锋区"
          },
          {
            "id": 1320,
            "name": "建华区"
          },
          {
            "id": 1323,
            "name": "昂昂溪区"
          },
          {
            "id": 1325,
            "name": "碾子山区"
          },
          {
            "id": 1329,
            "name": "梅里斯区"
          },
          {
            "id": 1334,
            "name": "龙江县"
          },
          {
            "id": 1338,
            "name": "富拉尔基区"
          },
          {
            "id": 1341,
            "name": "讷河市"
          },
          {
            "id": 1346,
            "name": "依安县"
          },
          {
            "id": 1347,
            "name": "泰来县"
          },
          {
            "id": 1348,
            "name": "甘南县"
          },
          {
            "id": 1354,
            "name": "富裕县"
          },
          {
            "id": 1355,
            "name": "克山县"
          },
          {
            "id": 1356,
            "name": "拜泉县"
          },
          {
            "id": 1366,
            "name": "克东县"
          }]
        },
        "七台河": {
          "id": 1367,
          "children": [{
            "id": 1367,
            "name": "全部"
          },
          {
            "id": 1368,
            "name": "新兴区"
          },
          {
            "id": 1369,
            "name": "桃山区"
          },
          {
            "id": 1374,
            "name": "茄子河区"
          },
          {
            "id": 1390,
            "name": "勃利县"
          }]
        },
        "牡丹江": {
          "id": 1607,
          "children": [{
            "id": 1607,
            "name": "全部"
          },
          {
            "id": 1608,
            "name": "爱民区"
          },
          {
            "id": 1609,
            "name": "东安区"
          },
          {
            "id": 1612,
            "name": "阳明区"
          },
          {
            "id": 1618,
            "name": "西安区"
          },
          {
            "id": 1619,
            "name": "穆棱市"
          },
          {
            "id": 1625,
            "name": "海林市"
          },
          {
            "id": 1628,
            "name": "绥芬河市"
          },
          {
            "id": 1629,
            "name": "宁安市"
          },
          {
            "id": 1636,
            "name": "东宁市"
          },
          {
            "id": 1639,
            "name": "林口县"
          }]
        },
        "鸡西": {
          "id": 1997,
          "children": [{
            "id": 1997,
            "name": "全部"
          },
          {
            "id": 1998,
            "name": "鸡冠区"
          },
          {
            "id": 1999,
            "name": "恒山区"
          },
          {
            "id": 2000,
            "name": "梨树区"
          },
          {
            "id": 2002,
            "name": "滴道区"
          },
          {
            "id": 2008,
            "name": "麻山区"
          },
          {
            "id": 2009,
            "name": "虎林市"
          },
          {
            "id": 2012,
            "name": "城子河区"
          },
          {
            "id": 2014,
            "name": "密山市"
          },
          {
            "id": 2015,
            "name": "鸡东县"
          }]
        },
        "佳木斯": {
          "id": 2049,
          "children": [{
            "id": 2049,
            "name": "全部"
          },
          {
            "id": 2050,
            "name": "前进区"
          },
          {
            "id": 2052,
            "name": "同江市"
          },
          {
            "id": 2053,
            "name": "东风区"
          },
          {
            "id": 2054,
            "name": "向阳区"
          },
          {
            "id": 2055,
            "name": "抚远市"
          },
          {
            "id": 2056,
            "name": "富锦市"
          },
          {
            "id": 2057,
            "name": "桦川县"
          },
          {
            "id": 2058,
            "name": "桦南县"
          },
          {
            "id": 2067,
            "name": "汤原县"
          },
          {
            "id": 2068,
            "name": "郊区"
          }]
        },
        "黑河": {
          "id": 2190,
          "children": [{
            "id": 2190,
            "name": "全部"
          },
          {
            "id": 2191,
            "name": "爱辉区"
          },
          {
            "id": 2193,
            "name": "北安市"
          },
          {
            "id": 2194,
            "name": "嫩江县"
          },
          {
            "id": 2196,
            "name": "五大连池市"
          },
          {
            "id": 2203,
            "name": "孙吴县"
          },
          {
            "id": 2204,
            "name": "逊克县"
          }]
        },
        "鹤岗": {
          "id": 2200,
          "children": [{
            "id": 2200,
            "name": "全部"
          },
          {
            "id": 2201,
            "name": "兴山区"
          },
          {
            "id": 2206,
            "name": "向阳区"
          },
          {
            "id": 2208,
            "name": "南山区"
          },
          {
            "id": 2209,
            "name": "兴安区"
          },
          {
            "id": 2212,
            "name": "萝北县"
          },
          {
            "id": 2213,
            "name": "东山区"
          },
          {
            "id": 2214,
            "name": "工农区"
          },
          {
            "id": 2221,
            "name": "绥滨县"
          }]
        },
        "哈尔滨": {
          "id": 2380,
          "children": [{
            "id": 2380,
            "name": "全部"
          },
          {
            "id": 2381,
            "name": "道里区"
          },
          {
            "id": 2382,
            "name": "平房区"
          },
          {
            "id": 2384,
            "name": "南岗区"
          },
          {
            "id": 2385,
            "name": "香坊区"
          },
          {
            "id": 2386,
            "name": "呼兰区"
          },
          {
            "id": 2387,
            "name": "道外区"
          },
          {
            "id": 2388,
            "name": "阿城区"
          },
          {
            "id": 2389,
            "name": "松北区"
          },
          {
            "id": 2398,
            "name": "尚志市"
          },
          {
            "id": 2400,
            "name": "依兰县"
          },
          {
            "id": 2401,
            "name": "五常市"
          },
          {
            "id": 2402,
            "name": "双城区"
          },
          {
            "id": 2405,
            "name": "方正县"
          },
          {
            "id": 2406,
            "name": "近郊"
          },
          {
            "id": 2408,
            "name": "宾县"
          },
          {
            "id": 2409,
            "name": "巴彦县"
          },
          {
            "id": 2410,
            "name": "木兰县"
          },
          {
            "id": 2412,
            "name": "通河县"
          },
          {
            "id": 2414,
            "name": "延寿县"
          }]
        },
        "大兴安岭": {
          "id": 2632,
          "children": [{
            "id": 2632,
            "name": "全部"
          },
          {
            "id": 2633,
            "name": "呼玛县"
          },
          {
            "id": 2634,
            "name": "加格达奇区"
          },
          {
            "id": 2636,
            "name": "塔河县"
          },
          {
            "id": 2648,
            "name": "漠河县"
          }]
        },
        "大庆": {
          "id": 2697,
          "children": [{
            "id": 2697,
            "name": "全部"
          },
          {
            "id": 2698,
            "name": "萨尔图区"
          },
          {
            "id": 2702,
            "name": "让胡路区"
          },
          {
            "id": 2704,
            "name": "龙凤区"
          },
          {
            "id": 2706,
            "name": "红岗区"
          },
          {
            "id": 2707,
            "name": "大同区"
          },
          {
            "id": 2712,
            "name": "肇州县"
          },
          {
            "id": 2715,
            "name": "肇源县"
          },
          {
            "id": 2717,
            "name": "杜尔伯特县"
          },
          {
            "id": 2720,
            "name": "开发区"
          },
          {
            "id": 2722,
            "name": "林甸县"
          }]
        }
      }
    },
    "上海市": {
      "id": 1172,
      "children": {
        "全部": {
          "id": 1172,
          "children": [{
            "id": 1172,
            "name": "全部"
          }]
        },
        "上海": {
          "id": 1173,
          "children": [{
            "id": 1173,
            "name": "全部"
          },
          {
            "id": 1174,
            "name": "浦东新区"
          },
          {
            "id": 1176,
            "name": "徐汇区"
          },
          {
            "id": 1178,
            "name": "长宁区"
          },
          {
            "id": 1183,
            "name": "黄浦区"
          },
          {
            "id": 1187,
            "name": "杨浦区"
          },
          {
            "id": 1190,
            "name": "静安区"
          },
          {
            "id": 1192,
            "name": "闵行区"
          },
          {
            "id": 1196,
            "name": "普陀区"
          },
          {
            "id": 1201,
            "name": "宝山区"
          },
          {
            "id": 1210,
            "name": "松江区"
          },
          {
            "id": 1211,
            "name": "虹口区"
          },
          {
            "id": 1213,
            "name": "青浦区"
          },
          {
            "id": 1215,
            "name": "嘉定区"
          },
          {
            "id": 1218,
            "name": "金山区"
          },
          {
            "id": 1219,
            "name": "崇明区"
          },
          {
            "id": 1222,
            "name": "奉贤区"
          }]
        }
      }
    },
    "重庆市": {
      "id": 2912,
      "children": {
        "全部": {
          "id": 2912,
          "children": [{
            "id": 2912,
            "name": "全部"
          }]
        },
        "重庆": {
          "id": 2913,
          "children": [{
            "id": 2913,
            "name": "全部"
          },
          {
            "id": 2914,
            "name": "大渡口区"
          },
          {
            "id": 2915,
            "name": "沙坪坝区"
          },
          {
            "id": 2916,
            "name": "南岸区"
          },
          {
            "id": 2918,
            "name": "九龙坡区"
          },
          {
            "id": 2922,
            "name": "渝中区"
          },
          {
            "id": 2924,
            "name": "万州区"
          },
          {
            "id": 2928,
            "name": "巴南区"
          },
          {
            "id": 2929,
            "name": "合川区"
          },
          {
            "id": 2930,
            "name": "永川区"
          },
          {
            "id": 2931,
            "name": "涪陵区"
          },
          {
            "id": 2933,
            "name": "黔江区"
          },
          {
            "id": 2937,
            "name": "长寿区"
          },
          {
            "id": 2940,
            "name": "北碚区"
          },
          {
            "id": 2941,
            "name": "江津区"
          },
          {
            "id": 2942,
            "name": "南川区"
          },
          {
            "id": 2943,
            "name": "彭水苗族土家族自治县"
          },
          {
            "id": 2944,
            "name": "綦江区"
          },
          {
            "id": 2947,
            "name": "忠县"
          },
          {
            "id": 2949,
            "name": "秀山土家族苗族自治县"
          },
          {
            "id": 2951,
            "name": "璧山区"
          },
          {
            "id": 2952,
            "name": "开州区"
          },
          {
            "id": 2954,
            "name": "江北区"
          },
          {
            "id": 2955,
            "name": "近郊"
          },
          {
            "id": 2958,
            "name": "渝北区"
          },
          {
            "id": 2959,
            "name": "铜梁区"
          },
          {
            "id": 2961,
            "name": "大足区"
          },
          {
            "id": 2962,
            "name": "潼南区"
          },
          {
            "id": 2963,
            "name": "垫江县"
          },
          {
            "id": 2964,
            "name": "武隆县"
          },
          {
            "id": 2966,
            "name": "丰都县"
          },
          {
            "id": 2967,
            "name": "城口县"
          },
          {
            "id": 2969,
            "name": "奉节县"
          },
          {
            "id": 2970,
            "name": "荣昌区"
          },
          {
            "id": 2971,
            "name": "梁平县"
          },
          {
            "id": 2972,
            "name": "石柱土家族自治县"
          },
          {
            "id": 2973,
            "name": "酉阳土家族苗族自治县"
          },
          {
            "id": 2974,
            "name": "巫溪县"
          },
          {
            "id": 2975,
            "name": "云阳县"
          },
          {
            "id": 2979,
            "name": "巫山县"
          }]
        }
      }
    }
  }

module.exports = regions;